{"data": {"doi": "10.1111/cgf.12370", "year": "2014", "title": "Illustrative Visualization of Molecular Reactions using Omniscient Intelligence and Passive Agents", "conferenceName": "EuroVis", "authors": "Mathieu Le Muzic;J{\\'{u}}lius Parulek;Anne{-}Kristin Stavrum;Ivan Viola", "citationCount": "17", "affiliation": "Le Muzic, M (Corresponding Author), Vienna Univ Technol, Inst Comp Graph \\& Algorithms, Vienna, Austria.\nLe Muzic, M.; Viola, I., Vienna Univ Technol, Inst Comp Graph \\& Algorithms, Vienna, Austria.\nParulek, J.; Stavrum, A. K.; Viola, I., Univ Bergen, Dept Informat, N-5020 Bergen, Norway.", "countries": "Norway;Austria", "abstract": "In this paper we propose a new type of a particle systems, tailored for illustrative visualization purposes, in particular for visualizing molecular reactions in biological networks. Previous visualizations of biochemical processes were exploiting the results of agent-based modeling. Such modeling aims at reproducing accurately the stochastic nature of molecular interactions. However, it is impossible to expect events of interest happening at a certain time and location, which is impractical for storytelling. To obtain the means of controlling molecular interactions, we propose to govern passive agents with an omniscient intelligence, instead of giving to the agents the freedom of initiating reaction autonomously. This makes it possible to generate illustrative animated stories that communicate the functioning of the molecular machinery. The rendering performance delivers for interactive framerates of massive amounts of data, based on the dynamic tessellation capabilities of modern graphics cards. Finally, we report an informal expert feedback we obtained from the potential users.", "keywords": "", "link": "https://doi.org/10.1111/cgf.12370", "refList": ["10.1073/pnas.75.1.303", "10.1109/tvcg.2007.70517", "10.1109/pdmc-hibi.2010.18", "10.1145/357306.357310", "10.1088/1478-3967/1/3/001", "10.1109/mcg.2013.37", "10.1093/bioinformatics/btg015", "10.1057/palgrave.ivs.9500102", "10.1109/tvcg.2006.115", "10.1109/isbi.2010.5490235", "10.1093/bioinformatics/btl485", "10.1109/tvcg.2013.154", "10.1007/pl00009412", "10.1016/j.str.2010.12.023", "10.1109/pacificvis.2009.4906853", "10.1111/cgf.12197", "10.1093/nar/28.1.27", "10.1109/biovis.2013.6664345"], "wos": 1, "children": [{"doi": "10.1109/scivis.2015.7429492", "title": "CPU Ray Tracing Large Particle Data with Balanced P-k-d Trees", "year": "2015", "conferenceName": "SciVis", "authors": "Ingo Wald;Aaron Knoll;Gregory P. Johnson;William Usher;Valerio Pascucci;Michael E. Papka", "citationCount": "14", "affiliation": "Wald, I (Corresponding Author), Intel Corp, Santa Clara, CA 95051 USA. Wald, Ingo; Johnson, Gregory P., Intel Corp, Santa Clara, CA 95051 USA. Knoll, Aaron; Usher, Will; Pascucci, Valerio, Univ Utah, Inst Sci, Salt Lake City, UT 84112 USA. Papka, Michael E., Northern Illinois Univ, Argonne Natl Lab, De Kalb, IL USA.", "countries": "USA", "abstract": "We present a novel approach to rendering large particle data sets from molecular dynamics, astrophysics and other sources. We employ a new data structure adapted from the original balanced k-d tree, which allows for representation of data with trivial or no overhead. In the OSPRay visualization framework, we have developed an efficient CPU algorithm for traversing, classifying and ray tracing these data. Our approach is able to render up to billions of particles on a typical workstation, purely on the CPU, without any approximations or level-of-detail techniques, and optionally with attribute-based color mapping, dynamic range query, and advanced lighting models such as ambient occlusion and path tracing.", "keywords": "Ray tracing, Visualization, Particle Data, k-d Trees", "link": "http://dx.doi.org/10.1109/SciVis.2015.7429492", "refList": ["10.1109/tvcg.2005.79", "10.1145/2601097.2601199", "10.1071/as07022", "10.1088/0067-0049/192/1/9", "10.1111/cgf.12363", "10.1109/tvcg.2012.282", "10.1111/cgf.12370", "10.1145/361002.361007", "10.1109/ldav.2013.6675159", "10.1111/j.1365-2966.2008.13212.x", "10.1088/1367-2630/10/12/125006"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2017.2743979", "title": "Screen-Space Normal Distribution Function Caching for Consistent Multi-Resolution Rendering of Large Particle Data", "year": "2017", "conferenceName": "SciVis", "authors": "Mohamed Ibrahim;Patrick Wickenhauser;Peter Rautek;Guido Reina;Markus Hadwiger", "citationCount": "1", "affiliation": "Ibrahim, M (Corresponding Author), KAUST, Thuwal 239556900, Saudi Arabia. Ibrahim, Mohamed; Rautek, Peter; Hadwiger, Markus, KAUST, Thuwal 239556900, Saudi Arabia. Wickenhaeuser, Patrick; Reina, Guido, Univ Stuttgart, Visualizat Res Ctr VISUS, Stuttgart, Germany.", "countries": "Germany;Arabia", "abstract": "Molecular dynamics (MD) simulations are crucial to investigating important processes in physics and thermodynamics. The simulated atoms are usually visualized as hard spheres with Phong shading, where individual particles and their local density can be perceived well in close-up views. However, for large-scale simulations with 10 million particles or more, the visualization of large fields-of-view usually suffers from strong aliasing artifacts, because the mismatch between data size and output resolution leads to severe under-sampling of the geometry. Excessive super-sampling can alleviate this problem, but is prohibitively expensive. This paper presents a novel visualization method for large-scale particle data that addresses aliasing while enabling interactive high-quality rendering. We introduce the novel concept of screen-space normal distribution functions (S-NDFs) for particle data. S-NDFs represent the distribution of surface normals that map to a given pixel in screen space, which enables high-quality re-lighting without re-rendering particles. In order to facilitate interactive zooming, we cache S-NDFs in a screen-space mipmap (S-MIP). Together, these two concepts enable interactive, scale-consistent re-lighting and shading changes, as well as zooming, without having to re-sample the particle data. We show how our method facilitates the interactive exploration of real-world large-scale MD simulation data in different scenarios.", "keywords": "Multiresolution Techniques,Point-Based Data,Glyph-based Techniques,Scalability Issues,Molecular Visualization", "link": "http://dx.doi.org/10.1109/TVCG.2017.2743979", "refList": ["10.1109/tvcg.2011.81", "10.1109/tvcg.2010.215", "10.2312/spbg/spbg06/059-065", "10.1111/j.1467-8659.2009.01698.x", "10.1109/tvcg.2014.2350479", "10.1145/2508363.2508422", "10.1145/965141.563893", "10.1111/j.1467-8659.2012.03128.x", "10.1111/j.1467-8659.2011.01964.x", "10.1111/cgf.12363", "10.2312/vcbm.20151209", "10.1145/2366145.2366152", "10.1109/visual.2003.1250404", "10.1007/978-3-642-38750-0\\_1", "10.1109/tvcg.2007.70439", "10.1109/scivis.2015.7429492", "10.1145/1239451.1239479", "10.2312/egwr/egsr07/195-206", "10.1109/tvcg.2014.2346324", "10.1111/cgf.12197", "10.2312/egpgv/egpgv13/009-016", "10.1109/tvcg.2009.142", "10.1109/tvcg.2016.2599041", "10.1109/sc.2014.40", "10.1109/visual.2004.103", "10.1021/ct500169q", "10.1145/1730804.1730834"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2015.2467293", "title": "Real-Time Molecular Visualization Supporting Diffuse Interreflections and Ambient Occlusion", "year": "2015", "conferenceName": "SciVis", "authors": "Robin Skånberg;Pere-Pau Vázquez;Victor Guallar;Timo Ropinski", "citationCount": "10", "affiliation": "Skanberg, R (Corresponding Author), Univ Ulm, Visual Comp Grp, D-89069 Ulm, Germany. Skanberg, Robin; Ropinski, Timo, Univ Ulm, Visual Comp Grp, D-89069 Ulm, Germany. Vazquez, Pere-Pau, UPC Barcelona, MOVING Grp, Barcelona, Spain. Guallar, Victor, Barcelona Supercomp Ctr, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "Today molecular simulations produce complex data sets capturing the interactions of molecules in detail. Due to the complexity of this time-varying data, advanced visualization techniques are required to support its visual analysis. Current molecular visualization techniques utilize ambient occlusion as a global illumination approximation to improve spatial comprehension. Besides these shadow-like effects, interreflections are also known to improve the spatial comprehension of complex geometric structures. Unfortunately, the inherent computational complexity of interreflections would forbid interactive exploration, which is mandatory in many scenarios dealing with static and time-varying data. In this paper, we introduce a novel analytic approach for capturing interreflections of molecular structures in real-time. By exploiting the knowledge of the underlying space filling representations, we are able to reduce the required parameters and can thus apply symbolic regression to obtain an analytic expression for interreflections. We show how to obtain the data required for the symbolic regression analysis, and how to exploit our analytic solution to enhance interactive molecular visualizations.", "keywords": "Molecular visualization, diffuse interreflections, ambient occlusion", "link": "http://dx.doi.org/10.1109/TVCG.2015.2467293", "refList": ["10.1186/1472-6807-9-19", "10.1109/tvcg.2009.157", "10.1109/tvcg.2007.70517", "10.1145/1609967.1609971", "10.1186/1758-2946-4-17", "10.1145/2461912.2462009", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01698.x", "10.1109/tvcg.2014.2350479", "10.1063/1.1770803", "10.1111/j.1467-8659.2012.03128.x", "10.1109/tvcg.2010.250", "10.1371/journal.pcbi.1003321", "10.1107/s0021889811038970", "10.1109/pacificvis.2015.7156385", "10.1109/tvcg.2006.115", "10.1107/s0021889808012016", "10.1111/cgf.12375", "10.1145/383259.383317", "10.1109/tvcg.2007.70578", "10.1093/bib/bbq089", "10.1109/tvcg.2014.2346404", "10.1109/tvcg.2012.282", "10.1111/cgf.12373", "10.1109/mcg.2013.37", "10.1109/pacificvis.2009.4906853", "10.1109/pacificvis.2012.6183593", "10.1111/cgf.12197", "10.1126/science.1165893", "10.1111/j.1467-8659.2011.01917.x", "10.1063/1.1733573", "10.1016/0263-7855(96)00018-5", "10.1145/1141911.1142016", "10.1109/biovis.2012.6378599", "10.1111/cgf.12370", "10.1109/tvcg.2009.168", "10.1016/j.sbi.2007.06.008"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2016.2598825", "title": "Physics-Based Visual Characterization of Molecular Interaction Forces", "year": "2016", "conferenceName": "SciVis", "authors": "Pedro Hermosilla;Jorge Estrada;Victor Guallar;Timo Ropinski;Àlvar Vinacua;Pere-Pau Vázquez", "citationCount": "10", "affiliation": "Hermosilla, P (Corresponding Author), ViRVIG Grp, Barcelona, Spain. Hermosilla, P (Corresponding Author), Barcelona Supercomp Ctr, Barcelona, Spain. Hermosilla, Pedro, ViRVIG Grp, Barcelona, Spain. Hermosilla, Pedro; Estrada, Jorge; Guallar, Victor, Barcelona Supercomp Ctr, Barcelona, Spain. Ropinski, Timo, Univ Ulm, Visual Comp Grp, D-89069 Ulm, Germany. Vinacua, Alvar; Vazquez, Pere-Pau, UPC Barcelona, ViRVIG Grp, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "Molecular simulations are used in many areas of biotechnology, such as drug design and enzyme engineering. Despite the development of automatic computational protocols, analysis of molecular interactions is still a major aspect where human comprehension and intuition are key to accelerate, analyze, and propose modifications to the molecule of interest. Most visualization algorithms help the users by providing an accurate depiction of the spatial arrangement: the atoms involved in inter-molecular contacts. There are few tools that provide visual information on the forces governing molecular docking. However, these tools, commonly restricted to close interaction between atoms, do not consider whole simulation paths, long-range distances and, importantly, do not provide visual cues for a quick and intuitive comprehension of the energy functions (modeling intermolecular interactions) involved. In this paper, we propose visualizations designed to enable the characterization of interaction forces by taking into account several relevant variables such as molecule-ligand distance and the energy function, which is essential to understand binding affinities. We put emphasis on mapping molecular docking paths obtained from Molecular Dynamics or Monte Carlo simulations, and provide time-dependent visualizations for different energy components and particle resolutions: atoms, groups or residues. The presented visualizations have the potential to support domain experts in a more efficient drug or enzyme design process.", "keywords": "Molecular visualization;binding analysis", "link": "http://dx.doi.org/10.1109/TVCG.2016.2598825", "refList": ["10.1186/1472-6807-9-19", "10.1109/tvcg.2009.157", "10.1109/tvcg.2007.70517", "10.1186/1758-2946-4-17", "10.1016/j.str.2015.09.012", "10.1111/cgf.12374", "10.1006/jmbi.1996.0663", "10.1021/ci200227u", "10.2312/spbg/spbg06/059-065", "10.1021/ci049885e", "10.1006/jmbi.1998.2400", "10.1111/j.1467-8659.2009.01698.x", "10.1109/tvcg.2014.2350479", "10.1111/j.1467-8659.2012.03128.x", "10.1109/tvcg.2010.250", "10.1371/journal.pcbi.1003321", "10.1107/s0021889811038970", "10.1093/nar/gkt454", "10.1109/tvcg.2006.115", "10.1146/annurev-biophys-042910-155245", "10.1107/s0021889808012016", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12375", "10.1109/tvcg.2007.70578", "10.1021/acscatal.6b00028", "10.1093/bib/bbq089", "10.1093/nar/gkv315", "10.1109/tvcg.2015.2467293", "10.1109/tvcg.2012.282", "10.1111/cgf.12373", "10.1093/bioinformatics/btl150", "10.1109/mcg.2013.37", "10.1109/pacificvis.2009.4906853", "10.1109/pacificvis.2012.6183593", "10.1111/cgf.12197", "10.1186/1758-2946-5-40", "10.2312/eurovisstar.20151112", "10.1080/10611860400024078", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2014.2346403", "10.1007/s10822-011-9531-0", "10.1111/cgf.12370", "10.1109/tvcg.2009.168", "10.1016/j.sbi.2007.06.008"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864851", "title": "Visualization of Large Molecular Trajectories", "year": "2018", "conferenceName": "SciVis", "authors": "David Duran;Pedro Hermosilla;Timo Ropinski;Barbora Kozlíková;Àlvar Vinacua;Pere-Pau Vázquez", "citationCount": "1", "affiliation": "Duran, D (Corresponding Author), UPC Barcelona, ViRVIG Grp, Barcelona, Spain. Duran, David; Vinacua, Alvar; Vazquez, Pere-Pau, UPC Barcelona, ViRVIG Grp, Barcelona, Spain. Hermosilla, Pedro; Ropinski, Timo, Univ Ulm, Visual Comp Grp, Ulm, Germany. Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.", "countries": "Spain;Germany;Republic", "abstract": "The analysis of protein-ligand interactions is a time-intensive task. Researchers have to analyze multiple physico-chemical properties of the protein at once and combine them to derive conclusions about the protein-ligand interplay. Typically, several charts are inspected, and 3D animations can be played side-by-side to obtain a deeper understanding of the data. With the advances in simulation techniques, larger and larger datasets are available, with up to hundreds of thousands of steps. Unfortunately, such large trajectories are very difficult to investigate with traditional approaches. Therefore, the need for special tools that facilitate inspection of these large trajectories becomes substantial. In this paper, we present a novel system for visual exploration of very large trajectories in an interactive and user-friendly way. Several visualization motifs are automatically derived from the data to give the user the information about interactions between protein and ligand. Our system offers specialized widgets to ease and accelerate data inspection and navigation to interesting parts of the simulation. The system is suitable also for simulations where multiple ligands are involved. We have tested the usefulness of our tool on a set of datasets obtained from protein engineers, and we describe the expert feedback.", "keywords": "Molecular visualization,simulation inspection,long trajectories", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864851", "refList": ["10.1109/tkde.2016.2557324", "10.1002/anie.199009921", "10.1145/2702123.2702419", "10.1109/mcse.2015.7", "10.1021/ci200227u", "10.1007/s10822-010-9352-6", "10.1016/j.sbi.2012.11.002", "10.1109/tvcg.2014.2350479", "10.3390/e16010233", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1038/nmeth.3258", "10.1109/tvcg.2016.2598797", "10.1109/tvcg.2016.2598825", "10.1186/1753-6561-8-s2-s3", "10.1021/ct400341p", "10.1016/0010-4655(95)00041-d", "10.1111/cgf.12928", "10.1145/1364782.1364802", "10.1109/tvcg.2016.2539960", "10.1109/tvcg.2012.225", "10.1093/bib/bbq089", "10.2312/eurovisshort.20171146", "10.1093/nar/gkv315", "10.1109/bigdata.2015.7363824", "10.1109/tits.2015.2436897", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1186/1753-6561-8-s2-s5", "10.1016/0263-7855(96)00018-5", "10.1093/comjnl/20.4.364", "10.2174/1874091x01610010001", "10.1214/ss/1076102418", "10.1145/2890478", "10.1109/biovis.2012.6378599", "10.1109/tvcg.2014.2346574", "10.1111/cgf.13208", "10.1016/j.sbi.2014.04.002"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934258", "title": "Scale-Space Splatting: Reforming Spacetime for Cross-Scale Exploration of Integral Measures in Molecular Dynamics", "year": "2019", "conferenceName": "SciVis", "authors": "Juraj Pálenik;Jan Byska;Stefan Bruckner;Helwig Hauser", "citationCount": "0", "affiliation": "Palenik, J (Corresponding Author), Univ Bergen, Bergen, Norway. Palenik, Juraj; Byska, Jan; Bruckner, Stefan; Hauser, Helwig, Univ Bergen, Bergen, Norway. Byska, Jan, Masaryk Univ, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "Understanding large amounts of spatiotemporal data from particle-based simulations, such as molecular dynamics, often relies on the computation and analysis of aggregate measures. These, however, by virtue of aggregation, hide structural information about the space/time localization of the studied phenomena. This leads to degenerate cases where the measures fail to capture distinct behaviour. In order to drill into these aggregate values, we propose a multi-scale visual exploration technique. Our novel representation, based on partial domain aggregation, enables the construction of a continuous scale-space for discrete datasets and the simultaneous exploration of scales in both space and time. We link these two scale-spaces in a scale-space space-time cube and model linked views as orthogonal slices through this cube, thus enabling the rapid identification of spatio-temporal patterns at multiple scales. To demonstrate the effectiveness of our approach, we showcase an advanced exploration of a protein-ligand simulation.", "keywords": "Scale space,time-series,scientific simulation,multi-scale analysis,space-time cube,molecular dynamics", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934258", "refList": ["10.1111/cgf.13445", "10.1109/tvcg.2012.191", "10.1201/b14876", "10.1145/827051.827056", "10.1080/07391102.2005.10531229", "10.1021/acs.jcim.7b00070", "10.1007/978-3-8348-9190-729", "10.1111/cgf.13427", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1016/0021-9991(82)90025-0", "10.1111/cgf.13177", "10.1007/978-1-4757-6465-9", "10.1145/1044588.1044615", "10.2307/2669996", "10.1109/tvcg.2018.2865049", "10.1007/978-3-540-70823-0\\_3", "10.1111/cgf.13640", "10.1109/tvcg.2010.253", "10.1109/tvcg.2009.177", "10.1016/j.csda.2018.03.014", "10.1109/tvcg.2009.200", "10.1109/visual.2003.1250353", "10.2312/eurovisshort.20171146", "10.1109/tvcg.2010.148", "10.1002/9780470316849", "10.1109/visual.1993.398859", "10.1007/978-1-4612-4026-6", "10.1016/j.jmb.2018.09.004", "10.1111/cgf.13415", "10.2312/molva.20181102", "10.1371/journal.pcbi.1002708", "10.1007/s10851-010-0242-2", "10.1016/0263-7855(96)00018-5", "10.1109/visual.2003.1250402", "10.1007/bf01936872", "10.1002/wics.79", "10.1111/j.1467-8659.2009.01684.x", "10.1109/tvcg.2018.2864510", "10.1111/cgf.12804", "10.1117/12.904668", "10.1002/jcc.20289", "10.1088/0965-0393/18/1/015012", "10.1109/34.56205", "10.1111/j.1435-5597.1970.tb01464.x", "10.1007/978-0-85729-079-3", "10.1007/s11263-005-1838-7"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}, {"doi": "10.1109/pacificvis.2019.00032", "year": "2019", "title": "Visual Analysis of Ligand Trajectories in Molecular Dynamics", "conferenceName": "PacificVis", "authors": "Adam Jurc{\\'{\\i}}k;Katar{\\'{\\i}}na Furmanov{\\'{a}};Jan Byska;Vojtech Von{\\'{a}}sek;Ondrej V{\\'{a}}vra;Pavol Ulbrich;Helwig Hauser;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nJurcik, Adam; Furmanova, Katarina; Byska, Jan; Vavra, Ondrej; Ulbrich, Pavol; Hauser, Helwig; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nByska, Jan, Univ Bergen, Bergen, Norway.\nVonasek, Vojtech, Czech Tech Univ, Prague, Czech Republic.\nVavra, Ondrej, FNUSA ICRC, Brno, Czech Republic.\nHauser, Helwig, MMIV, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "In many cases, protein reactions with other small molecules (ligands) occur in a deeply buried active site. When studying these types of reactions, it is crucial for biochemists to examine trajectories of ligand motion. These trajectories are predicted with in-silico methods that produce large ensembles of possible trajectories. In this paper, we propose a novel approach to the interactive visual exploration and analysis of large sets of ligand trajectories, enabling the domain experts to understand protein function based on the trajectory properties. The proposed solution is composed of multiple linked 2D and 3D views, enabling the interactive exploration and filtering of trajectories in an informed way. In the workflow, we focus on the practical aspects of the interactive visual analysis specific to ligand trajectories. We adapt the small multiples principle to resolve an overly large number of trajectories into smaller chunks that are easier to analyze. We describe how drill-down techniques can be used to create and store selections of the trajectories with desired properties, enabling the comparison of multiple datasets. In appropriately designed 2D and 3D views, biochemists can either observe individual trajectories or choose to aggregate the information into a functional boxplot or density visualization. Our solution is based on a tight collaboration with the domain experts, aiming to address their needs as much as possible. The usefulness of our novel approach is demonstrated by two case studies, conducted by the collaborating protein engineers.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization; Human-centered computing; Visualization; Visualization systems and toolkits", "link": "https://doi.org/10.1109/PacificVis.2019.00032", "refList": ["10.1021/acscatal.6b02081", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2010.44", "10.1007/s11634-013-0158-y", "10.1186/s12859-016-1445-3", "10.1111/cgf.12106", "10.1021/ci200227u", "10.1007/978-3-319-15976-8\\_1", "10.1039/c3fd00145h", "10.1109/tvcg.2014.2346455", "10.1080/13658816.2010.511223", "10.1002/jcc.21334", "10.1109/tvcg.2016.2598825", "10.1109/romoco.2017.8003911", "10.1093/bioinformatics/btx125", "10.1109/tvcg.2006.99", "10.1111/cgf.12928", "10.1038/nchembio.205", "10.1002/anie.201206708", "10.1002/prot.25177", "10.1198/jcgs.2009.08158", "10.1021/bi901900s", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/bti1017", "10.1016/s0065-3233(08)60520-3", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.2312/molva.20181102", "10.1021/ct9000685", "10.1074/jbc.ra117.000328", "10.2312/vcbm.20171235", "10.1111/cgf.13428"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13428", "year": "2018", "title": "Visual Analysis of protein-ligand interactions", "conferenceName": "EuroVis", "authors": "Pere{-}Pau V{\\'{a}}zquez;Pedro Hermosilla;Victor Guallar;Jorge Estrada;{\\`{A}}lvar Vinacua", "citationCount": "5", "affiliation": "Vazquez, P (Corresponding Author), Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nVazquez, P.; Vinacua, A., Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nHermosilla, P., Univ Ulm, Visual Comp Grp, Ulm, Germany.\nGuallar, V.; Estrada, J., Barcelona SuperComp Ctr, Barcelona, Spain.\nGuallar, V., ICREA, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "The analysis of protein-ligand interactions is complex because of the many factors at play. Most current methods for visual analysis provide this information in the form of simple 2D plots, which, besides being quite space hungry, often encode a low number of different properties. In this paper we present a system for compact 2D visualization of molecular simulations. It purposely omits most spatial information and presents physical information associated to single molecular components and their pairwise interactions through a set of 2D InfoVis tools with coordinated views, suitable interaction, and focus+context techniques to analyze large amounts of data. The system provides a wide range of motifs for elements such as protein secondary structures or hydrogen bond networks, and a set of tools for their interactive inspection, both for a single simulation and for comparing two different simulations. As a result, the analysis of protein-ligand interactions of Molecular Simulation trajectories is greatly facilitated.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13428", "refList": ["10.1186/1758-2946-4-17", "10.1021/ci200227u", "10.1021/ci049885e", "10.1109/tvcg.2014.2350479", "10.3390/e16010233", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1186/1471-2105-14-244", "10.1371/journal.pcbi.1003321", "10.1107/s0021889811038970", "10.1109/tvcg.2016.2598825", "10.2312/vcbm.20151209", "10.1107/s0021889808012016", "10.1111/cgf.12928", "10.1146/annurev.physchem.51.1.129", "10.1023/a:1008005918983", "10.1111/cgf.12375", "10.1109/tvcg.2007.70578", "10.1093/bioinformatics/btu364", "10.1093/nar/gkv315", "10.1109/tvcg.2015.2467293", "10.1107/s0907444905029604", "10.1073/pnas.95.11.5998", "10.1109/tvcg.2012.282", "10.1111/cgf.12373", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1093/bioinformatics/btl150", "10.1109/pacificvis.2009.4906853", "10.1111/cgf.12197", "10.1080/10611860400024078", "10.1186/1758-2946-5-40", "10.1006/jmbi.1998.2401", "10.1101/gr.092759.109", "10.1109/tvcg.2014.2346403", "10.1002/jcc.20292", "10.1007/s10822-011-9531-0", "10.1093/nar/gkw265", "10.1179/000870403235002042"], "wos": 1, "children": [{"doi": "10.1109/pacificvis.2019.00032", "year": "2019", "title": "Visual Analysis of Ligand Trajectories in Molecular Dynamics", "conferenceName": "PacificVis", "authors": "Adam Jurc{\\'{\\i}}k;Katar{\\'{\\i}}na Furmanov{\\'{a}};Jan Byska;Vojtech Von{\\'{a}}sek;Ondrej V{\\'{a}}vra;Pavol Ulbrich;Helwig Hauser;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nJurcik, Adam; Furmanova, Katarina; Byska, Jan; Vavra, Ondrej; Ulbrich, Pavol; Hauser, Helwig; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nByska, Jan, Univ Bergen, Bergen, Norway.\nVonasek, Vojtech, Czech Tech Univ, Prague, Czech Republic.\nVavra, Ondrej, FNUSA ICRC, Brno, Czech Republic.\nHauser, Helwig, MMIV, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "In many cases, protein reactions with other small molecules (ligands) occur in a deeply buried active site. When studying these types of reactions, it is crucial for biochemists to examine trajectories of ligand motion. These trajectories are predicted with in-silico methods that produce large ensembles of possible trajectories. In this paper, we propose a novel approach to the interactive visual exploration and analysis of large sets of ligand trajectories, enabling the domain experts to understand protein function based on the trajectory properties. The proposed solution is composed of multiple linked 2D and 3D views, enabling the interactive exploration and filtering of trajectories in an informed way. In the workflow, we focus on the practical aspects of the interactive visual analysis specific to ligand trajectories. We adapt the small multiples principle to resolve an overly large number of trajectories into smaller chunks that are easier to analyze. We describe how drill-down techniques can be used to create and store selections of the trajectories with desired properties, enabling the comparison of multiple datasets. In appropriately designed 2D and 3D views, biochemists can either observe individual trajectories or choose to aggregate the information into a functional boxplot or density visualization. Our solution is based on a tight collaboration with the domain experts, aiming to address their needs as much as possible. The usefulness of our novel approach is demonstrated by two case studies, conducted by the collaborating protein engineers.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization; Human-centered computing; Visualization; Visualization systems and toolkits", "link": "https://doi.org/10.1109/PacificVis.2019.00032", "refList": ["10.1021/acscatal.6b02081", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2010.44", "10.1007/s11634-013-0158-y", "10.1186/s12859-016-1445-3", "10.1111/cgf.12106", "10.1021/ci200227u", "10.1007/978-3-319-15976-8\\_1", "10.1039/c3fd00145h", "10.1109/tvcg.2014.2346455", "10.1080/13658816.2010.511223", "10.1002/jcc.21334", "10.1109/tvcg.2016.2598825", "10.1109/romoco.2017.8003911", "10.1093/bioinformatics/btx125", "10.1109/tvcg.2006.99", "10.1111/cgf.12928", "10.1038/nchembio.205", "10.1002/anie.201206708", "10.1002/prot.25177", "10.1198/jcgs.2009.08158", "10.1021/bi901900s", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/bti1017", "10.1016/s0065-3233(08)60520-3", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.2312/molva.20181102", "10.1021/ct9000685", "10.1074/jbc.ra117.000328", "10.2312/vcbm.20171235", "10.1111/cgf.13428"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}], "len": 19}, {"doi": "10.1111/cgf.13426", "year": "2018", "title": "A General Illumination Model for Molecular Visualization", "conferenceName": "EuroVis", "authors": "Pedro Hermosilla;Pere{-}Pau V{\\'{a}}zquez;{\\`{A}}lvar Vinacua;Timo Ropinski", "citationCount": "2", "affiliation": "Hermosilla, P (Corresponding Author), Ulm Univ, Visual Comp Grp, Ulm, Germany.\nHermosilla, P.; Ropinski, T., Ulm Univ, Visual Comp Grp, Ulm, Germany.\nVazquez, P.; Vinacua, A., Univ Politecn Cataluna, VIRVIG Grp, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "Several visual representations have been developed over the years to visualize molecular structures, and to enable a better understanding of their underlying chemical processes. Today, the most frequently used atom-based representations are the Space-filling, the Solvent Excluded Surface, the Balls-and-Sticks, and the Licorice models. While each of these representations has its individual benefits, when applied to large-scale models spatial arrangements can be difficult to interpret when employing current visualization techniques. In the past it has been shown that global illumination techniques improve the perception of molecular visualizations; unfortunately existing approaches are tailored towards a single visual representation. We propose a general illumination model for molecular visualization that is valid for different representations. With our illumination model, it becomes possible, for the first time, to achieve consistent illumination among all atom-based molecular representations. The proposed model can be further evaluated in real-time, as it employs an analytical solution to simulate diffuse light interactions between objects. To be able to derive such a solution for the rather complicated and diverse visual representations, we propose the use of regression analysis together with adapted parameter sampling strategies as well as shape parametrization guided sampling, which are applied to the geometric building blocks of the targeted visual representations. We will discuss the proposed sampling strategies, the derived illumination model, and demonstrate its capabilities when visualizing several dynamic molecules.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13426", "refList": ["10.1109/tvcg.2009.157", "10.1145/2461912.2462009", "10.1111/cgf.12374", "10.2312/spbg/spbg06/059-065", "10.1007/s00371-017-1397-2", "10.1109/tvcg.2006.115", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12627", "10.1002/(sici)1097-0282(199603)38:3", "10.1109/tvcg.2015.2467293", "10.1016/j.visres.2010.09.006", "10.1111/cgf.12349", "10.1111/j.1467-8659.2011.01917.x", "10.1111/j.1467-8659.2009.01693.x", "10.1111/cgf.12197", "10.1109/pacificvis.2012.6183593", "10.1109/icra.2015.7139702", "10.1007/978-90-481-2678-1\\_6", "10.1006/jsbi.1996.0022", "10.1109/biovis.2011.6094043", "10.1111/cgf.12370"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.13428", "year": "2018", "title": "Visual Analysis of protein-ligand interactions", "conferenceName": "EuroVis", "authors": "Pere{-}Pau V{\\'{a}}zquez;Pedro Hermosilla;Victor Guallar;Jorge Estrada;{\\`{A}}lvar Vinacua", "citationCount": "5", "affiliation": "Vazquez, P (Corresponding Author), Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nVazquez, P.; Vinacua, A., Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nHermosilla, P., Univ Ulm, Visual Comp Grp, Ulm, Germany.\nGuallar, V.; Estrada, J., Barcelona SuperComp Ctr, Barcelona, Spain.\nGuallar, V., ICREA, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "The analysis of protein-ligand interactions is complex because of the many factors at play. Most current methods for visual analysis provide this information in the form of simple 2D plots, which, besides being quite space hungry, often encode a low number of different properties. In this paper we present a system for compact 2D visualization of molecular simulations. It purposely omits most spatial information and presents physical information associated to single molecular components and their pairwise interactions through a set of 2D InfoVis tools with coordinated views, suitable interaction, and focus+context techniques to analyze large amounts of data. The system provides a wide range of motifs for elements such as protein secondary structures or hydrogen bond networks, and a set of tools for their interactive inspection, both for a single simulation and for comparing two different simulations. As a result, the analysis of protein-ligand interactions of Molecular Simulation trajectories is greatly facilitated.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13428", "refList": ["10.1186/1758-2946-4-17", "10.1021/ci200227u", "10.1021/ci049885e", "10.1109/tvcg.2014.2350479", "10.3390/e16010233", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1186/1471-2105-14-244", "10.1371/journal.pcbi.1003321", "10.1107/s0021889811038970", "10.1109/tvcg.2016.2598825", "10.2312/vcbm.20151209", "10.1107/s0021889808012016", "10.1111/cgf.12928", "10.1146/annurev.physchem.51.1.129", "10.1023/a:1008005918983", "10.1111/cgf.12375", "10.1109/tvcg.2007.70578", "10.1093/bioinformatics/btu364", "10.1093/nar/gkv315", "10.1109/tvcg.2015.2467293", "10.1107/s0907444905029604", "10.1073/pnas.95.11.5998", "10.1109/tvcg.2012.282", "10.1111/cgf.12373", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1093/bioinformatics/btl150", "10.1109/pacificvis.2009.4906853", "10.1111/cgf.12197", "10.1080/10611860400024078", "10.1186/1758-2946-5-40", "10.1006/jmbi.1998.2401", "10.1101/gr.092759.109", "10.1109/tvcg.2014.2346403", "10.1002/jcc.20292", "10.1007/s10822-011-9531-0", "10.1093/nar/gkw265", "10.1179/000870403235002042"], "wos": 1, "children": [{"doi": "10.1109/pacificvis.2019.00032", "year": "2019", "title": "Visual Analysis of Ligand Trajectories in Molecular Dynamics", "conferenceName": "PacificVis", "authors": "Adam Jurc{\\'{\\i}}k;Katar{\\'{\\i}}na Furmanov{\\'{a}};Jan Byska;Vojtech Von{\\'{a}}sek;Ondrej V{\\'{a}}vra;Pavol Ulbrich;Helwig Hauser;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nJurcik, Adam; Furmanova, Katarina; Byska, Jan; Vavra, Ondrej; Ulbrich, Pavol; Hauser, Helwig; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nByska, Jan, Univ Bergen, Bergen, Norway.\nVonasek, Vojtech, Czech Tech Univ, Prague, Czech Republic.\nVavra, Ondrej, FNUSA ICRC, Brno, Czech Republic.\nHauser, Helwig, MMIV, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "In many cases, protein reactions with other small molecules (ligands) occur in a deeply buried active site. When studying these types of reactions, it is crucial for biochemists to examine trajectories of ligand motion. These trajectories are predicted with in-silico methods that produce large ensembles of possible trajectories. In this paper, we propose a novel approach to the interactive visual exploration and analysis of large sets of ligand trajectories, enabling the domain experts to understand protein function based on the trajectory properties. The proposed solution is composed of multiple linked 2D and 3D views, enabling the interactive exploration and filtering of trajectories in an informed way. In the workflow, we focus on the practical aspects of the interactive visual analysis specific to ligand trajectories. We adapt the small multiples principle to resolve an overly large number of trajectories into smaller chunks that are easier to analyze. We describe how drill-down techniques can be used to create and store selections of the trajectories with desired properties, enabling the comparison of multiple datasets. In appropriately designed 2D and 3D views, biochemists can either observe individual trajectories or choose to aggregate the information into a functional boxplot or density visualization. Our solution is based on a tight collaboration with the domain experts, aiming to address their needs as much as possible. The usefulness of our novel approach is demonstrated by two case studies, conducted by the collaborating protein engineers.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization; Human-centered computing; Visualization; Visualization systems and toolkits", "link": "https://doi.org/10.1109/PacificVis.2019.00032", "refList": ["10.1021/acscatal.6b02081", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2010.44", "10.1007/s11634-013-0158-y", "10.1186/s12859-016-1445-3", "10.1111/cgf.12106", "10.1021/ci200227u", "10.1007/978-3-319-15976-8\\_1", "10.1039/c3fd00145h", "10.1109/tvcg.2014.2346455", "10.1080/13658816.2010.511223", "10.1002/jcc.21334", "10.1109/tvcg.2016.2598825", "10.1109/romoco.2017.8003911", "10.1093/bioinformatics/btx125", "10.1109/tvcg.2006.99", "10.1111/cgf.12928", "10.1038/nchembio.205", "10.1002/anie.201206708", "10.1002/prot.25177", "10.1198/jcgs.2009.08158", "10.1021/bi901900s", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/bti1017", "10.1016/s0065-3233(08)60520-3", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.2312/molva.20181102", "10.1021/ct9000685", "10.1074/jbc.ra117.000328", "10.2312/vcbm.20171235", "10.1111/cgf.13428"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}, {"doi": "10.1111/cgf.12928", "year": "2016", "title": "Visual Analysis of Biomolecular Cavities: State of the Art", "conferenceName": "EuroVis", "authors": "Michael Krone;Barbora Kozl{\\'{\\i}}kov{\\'{a}};Norbert Lindow;Marc Baaden;Daniel Baum;J{\\'{u}}lius Parulek;Hans{-}Christian Hege;Ivan Viola", "citationCount": "28", "affiliation": "Krone, M (Corresponding Author), Univ Stuttgart, Visualizat Res Ctr, Stuttgart, Germany.\nKrone, M., Univ Stuttgart, Visualizat Res Ctr, Stuttgart, Germany.\nKozlikova, B., Masaryk Univ, Fac Informat, CS-60177 Brno, Czech Republic.\nLindow, N.; Baum, D.; Hege, H. -C., Zuse Inst Berlin, Dept Visual Data Anal, Berlin, Germany.\nBaaden, M., CNRS, UPR 9080, Lab Biochim Theor, F-75700 Paris, France.\nParulek, J.; Viola, I., Univ Bergen, Dept Informat, N-5020 Bergen, Norway.\nViola, I., TU Wien, Inst Comp Graph \\& Algorithms, Vienna, Austria.", "countries": "France;Germany;Austria;Republic;Norway", "abstract": "In this report we review and structure the branch of molecular visualization that is concerned with the visual analysis of cavities in macromolecular protein structures. First the necessary background, the domain terminology, and the goals of analytical reasoning are introduced. Based on a comprehensive collection of relevant research works, we present a novel classification for cavity detection approaches and structure them into four distinct classes: grid-based, Voronoi-based, surface-based, and probe-based methods. The subclasses are then formed by their combinations. We match these approaches with corresponding visualization technologies starting with direct 3D visualization, followed with non-spatial visualization techniques that for example abstract the interactions between structures into a relational graph, straighten the cavity of interest to see its profile in one view, or aggregate the time sequence into a single contour plot. We also discuss the current state of methods for the visual analysis of cavities in dynamic data such as molecular dynamics simulations. Finally, we give an overview of the most common tools that are actively developed and used in the structural biology and biochemistry research. Our report is concluded by an outlook on future challenges in the field.", "keywords": "", "link": "https://doi.org/10.1111/cgf.12928", "refList": ["10.1016/j.jmb.2006.07.022", "10.1186/1471-2105-14-s19-s5", "10.1093/bioinformatics/bti315", "10.1186/1758-2946-5-39", "10.1021/ct500381c", "10.1016/j.str.2007.10.007", "10.1093/bioinformatics/btu822", "10.1016/s0968-0004(99)01412-7", "10.1093/nar/gkr825", "10.1016/j.bbapap.2010.01.017", "10.1002/(sici)1097-0282(199603)38:3", "10.1186/1471-2105-7-316", "10.1109/tvcg.2007.70578", "10.1016/j.jmgm.2011.02.003", "10.1016/j.biotechadv.2012.02.002", "10.1016/j.jmgm.2004.11.004", "10.1016/j.bbagen.2015.10.015", "10.1109/tvcg.2014.2346404", "10.1109/tcbb.2009.53", "10.1016/j.cagd.2006.02.003", "10.1016/0010-4655(95)00042-e", "10.1016/0263-7855(92)80074-n", "10.1371/journal.pcbi.1002708", "10.1091/mbc.e05-09-0824", "10.1145/37402.37422", "10.1006/jsbi.1996.0022", "10.1109/hicss.1995.375331", "10.1039/c3fd00138e", "10.1109/biovis.2012.6378599", "10.1007/s00894-009-0541-y", "10.1093/nar/gkt380", "10.2312/pe/eur0vissh0rt/eur0vissh0rt2012/067-071", "10.1023/a:1008124202956", "10.1021/ci800324m", "10.1039/c3fd00123g", "10.1002/(sici)1097-0134(19981001)33:1", "10.1109/tvcg.2014.2350479", "10.1111/cgf.12612", "10.1093/bioinformatics/btr550", "10.1074/mcp.m400159-mcp200", "10.2174/138945008786949432", "10.1529/biophysj.108.135970", "10.1107/s0907444993011333", "10.1371/journal.pone.0099408", "10.1109/tcbb.2010.23", "10.1016/s0006-3495(97)78760-5", "10.1111/j.1467-8659.2011.01916.x", "10.1371/journal.pcbi.1000440", "10.1093/bioinformatics/btu426", "10.1093/nar/gkp281", "10.1002/pro.5560070905", "10.1111/j.1467-8659.2009.01693.x", "10.1146/annurev-pharmtox-011613-140028", "10.1093/nar/gkp410", "10.1021/ci4000294", "10.1186/1471-2105-14-s19-s4", "10.1109/biovis.2011.6094043", "10.1111/cgf.12120", "10.1093/nar/gkq395", "10.1186/1471-2105-13-314", "10.1023/a:1016307520660", "10.1186/1471-2105-15-197", "10.1002/jcc.20084", "10.1016/j.str.2015.09.012", "10.1109/pacificvis.2016.7465258", "10.1093/nar/28.1.235", "10.1186/s12859-015-0545-9", "10.1109/tvcg.2011.259", "10.1093/nar/gkv493", "10.1016/j.jmgm.2014.10.011", "10.1016/0263-7855(89)80010-4", "10.1089/omi.2009.0045", "10.1109/ipdpsw.2010.5470898", "10.1002/prot.22052", "10.1109/tvcg.2006.115", "10.1093/nar/gkl282", "10.1007/pl00009412", "10.1002/cber.18940270364", "10.1111/cgf.12375", "10.1371/journal.pcbi.1000585", "10.1021/acs.jcim.5b00169", "10.1093/bioinformatics/btu364", "10.1109/pacificvis.2014.32", "10.1109/tvcg.2015.2467293", "10.1016/s0006-3495(93)81293-1", "10.1109/pacificvis.2012.6183593", "10.1016/0263-7855(96)00018-5", "10.1093/bioinformatics/btp599", "10.1016/j.jmgm.2010.10.007", "10.1073/pnas.0910016106", "10.1093/bioinformatics/btq720", "10.1101/gr.1239303", "10.1145/174462.156635", "10.1186/1472-6807-8-49", "10.1007/978-3-642-41905-8\\_7", "10.1109/tvcg.2015.2467434", "10.1021/cia00039a", "10.1002/prot.22639", "10.1016/j.jmgm.2015.09.013", "10.1093/bioinformatics/btm270", "10.2312/pe/eurovisshort/eurovisshort2012/067-071", "10.1016/0263-7855(95)00073-9", "10.1111/j.1747-0285.2007.00483.x", "10.1186/1752-153x-1-7", "10.1016/j.jmgm.2008.11.002", "10.1186/1472-6807-6-19", "10.1186/1471-2105-10-168", "10.1093/bioinformatics/bti1017", "10.2312/eurovisstar.20151112", "10.1021/ct401098b", "10.1002/cmdc.200700075", "10.1016/s0263-7855(97)00009-x", "10.1007/s008940050091", "10.1093/nar/gks363", "10.1002/jcc.540160303", "10.1007/s10766-014-0331-8", "10.1109/tvcg.2009.168", "10.1016/s1093-3263(98)00002-3", "10.1016/j.drudis.2014.02.005"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864851", "title": "Visualization of Large Molecular Trajectories", "year": "2018", "conferenceName": "SciVis", "authors": "David Duran;Pedro Hermosilla;Timo Ropinski;Barbora Kozlíková;Àlvar Vinacua;Pere-Pau Vázquez", "citationCount": "1", "affiliation": "Duran, D (Corresponding Author), UPC Barcelona, ViRVIG Grp, Barcelona, Spain. Duran, David; Vinacua, Alvar; Vazquez, Pere-Pau, UPC Barcelona, ViRVIG Grp, Barcelona, Spain. Hermosilla, Pedro; Ropinski, Timo, Univ Ulm, Visual Comp Grp, Ulm, Germany. Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.", "countries": "Spain;Germany;Republic", "abstract": "The analysis of protein-ligand interactions is a time-intensive task. Researchers have to analyze multiple physico-chemical properties of the protein at once and combine them to derive conclusions about the protein-ligand interplay. Typically, several charts are inspected, and 3D animations can be played side-by-side to obtain a deeper understanding of the data. With the advances in simulation techniques, larger and larger datasets are available, with up to hundreds of thousands of steps. Unfortunately, such large trajectories are very difficult to investigate with traditional approaches. Therefore, the need for special tools that facilitate inspection of these large trajectories becomes substantial. In this paper, we present a novel system for visual exploration of very large trajectories in an interactive and user-friendly way. Several visualization motifs are automatically derived from the data to give the user the information about interactions between protein and ligand. Our system offers specialized widgets to ease and accelerate data inspection and navigation to interesting parts of the simulation. The system is suitable also for simulations where multiple ligands are involved. We have tested the usefulness of our tool on a set of datasets obtained from protein engineers, and we describe the expert feedback.", "keywords": "Molecular visualization,simulation inspection,long trajectories", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864851", "refList": ["10.1109/tkde.2016.2557324", "10.1002/anie.199009921", "10.1145/2702123.2702419", "10.1109/mcse.2015.7", "10.1021/ci200227u", "10.1007/s10822-010-9352-6", "10.1016/j.sbi.2012.11.002", "10.1109/tvcg.2014.2350479", "10.3390/e16010233", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1038/nmeth.3258", "10.1109/tvcg.2016.2598797", "10.1109/tvcg.2016.2598825", "10.1186/1753-6561-8-s2-s3", "10.1021/ct400341p", "10.1016/0010-4655(95)00041-d", "10.1111/cgf.12928", "10.1145/1364782.1364802", "10.1109/tvcg.2016.2539960", "10.1109/tvcg.2012.225", "10.1093/bib/bbq089", "10.2312/eurovisshort.20171146", "10.1093/nar/gkv315", "10.1109/bigdata.2015.7363824", "10.1109/tits.2015.2436897", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1186/1753-6561-8-s2-s5", "10.1016/0263-7855(96)00018-5", "10.1093/comjnl/20.4.364", "10.2174/1874091x01610010001", "10.1214/ss/1076102418", "10.1145/2890478", "10.1109/biovis.2012.6378599", "10.1109/tvcg.2014.2346574", "10.1111/cgf.13208", "10.1016/j.sbi.2014.04.002"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934258", "title": "Scale-Space Splatting: Reforming Spacetime for Cross-Scale Exploration of Integral Measures in Molecular Dynamics", "year": "2019", "conferenceName": "SciVis", "authors": "Juraj Pálenik;Jan Byska;Stefan Bruckner;Helwig Hauser", "citationCount": "0", "affiliation": "Palenik, J (Corresponding Author), Univ Bergen, Bergen, Norway. Palenik, Juraj; Byska, Jan; Bruckner, Stefan; Hauser, Helwig, Univ Bergen, Bergen, Norway. Byska, Jan, Masaryk Univ, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "Understanding large amounts of spatiotemporal data from particle-based simulations, such as molecular dynamics, often relies on the computation and analysis of aggregate measures. These, however, by virtue of aggregation, hide structural information about the space/time localization of the studied phenomena. This leads to degenerate cases where the measures fail to capture distinct behaviour. In order to drill into these aggregate values, we propose a multi-scale visual exploration technique. Our novel representation, based on partial domain aggregation, enables the construction of a continuous scale-space for discrete datasets and the simultaneous exploration of scales in both space and time. We link these two scale-spaces in a scale-space space-time cube and model linked views as orthogonal slices through this cube, thus enabling the rapid identification of spatio-temporal patterns at multiple scales. To demonstrate the effectiveness of our approach, we showcase an advanced exploration of a protein-ligand simulation.", "keywords": "Scale space,time-series,scientific simulation,multi-scale analysis,space-time cube,molecular dynamics", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934258", "refList": ["10.1111/cgf.13445", "10.1109/tvcg.2012.191", "10.1201/b14876", "10.1145/827051.827056", "10.1080/07391102.2005.10531229", "10.1021/acs.jcim.7b00070", "10.1007/978-3-8348-9190-729", "10.1111/cgf.13427", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1016/0021-9991(82)90025-0", "10.1111/cgf.13177", "10.1007/978-1-4757-6465-9", "10.1145/1044588.1044615", "10.2307/2669996", "10.1109/tvcg.2018.2865049", "10.1007/978-3-540-70823-0\\_3", "10.1111/cgf.13640", "10.1109/tvcg.2010.253", "10.1109/tvcg.2009.177", "10.1016/j.csda.2018.03.014", "10.1109/tvcg.2009.200", "10.1109/visual.2003.1250353", "10.2312/eurovisshort.20171146", "10.1109/tvcg.2010.148", "10.1002/9780470316849", "10.1109/visual.1993.398859", "10.1007/978-1-4612-4026-6", "10.1016/j.jmb.2018.09.004", "10.1111/cgf.13415", "10.2312/molva.20181102", "10.1371/journal.pcbi.1002708", "10.1007/s10851-010-0242-2", "10.1016/0263-7855(96)00018-5", "10.1109/visual.2003.1250402", "10.1007/bf01936872", "10.1002/wics.79", "10.1111/j.1467-8659.2009.01684.x", "10.1109/tvcg.2018.2864510", "10.1111/cgf.12804", "10.1117/12.904668", "10.1002/jcc.20289", "10.1088/0965-0393/18/1/015012", "10.1109/34.56205", "10.1111/j.1435-5597.1970.tb01464.x", "10.1007/978-0-85729-079-3", "10.1007/s11263-005-1838-7"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}, {"doi": "10.1109/pacificvis.2019.00032", "year": "2019", "title": "Visual Analysis of Ligand Trajectories in Molecular Dynamics", "conferenceName": "PacificVis", "authors": "Adam Jurc{\\'{\\i}}k;Katar{\\'{\\i}}na Furmanov{\\'{a}};Jan Byska;Vojtech Von{\\'{a}}sek;Ondrej V{\\'{a}}vra;Pavol Ulbrich;Helwig Hauser;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nJurcik, Adam; Furmanova, Katarina; Byska, Jan; Vavra, Ondrej; Ulbrich, Pavol; Hauser, Helwig; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nByska, Jan, Univ Bergen, Bergen, Norway.\nVonasek, Vojtech, Czech Tech Univ, Prague, Czech Republic.\nVavra, Ondrej, FNUSA ICRC, Brno, Czech Republic.\nHauser, Helwig, MMIV, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "In many cases, protein reactions with other small molecules (ligands) occur in a deeply buried active site. When studying these types of reactions, it is crucial for biochemists to examine trajectories of ligand motion. These trajectories are predicted with in-silico methods that produce large ensembles of possible trajectories. In this paper, we propose a novel approach to the interactive visual exploration and analysis of large sets of ligand trajectories, enabling the domain experts to understand protein function based on the trajectory properties. The proposed solution is composed of multiple linked 2D and 3D views, enabling the interactive exploration and filtering of trajectories in an informed way. In the workflow, we focus on the practical aspects of the interactive visual analysis specific to ligand trajectories. We adapt the small multiples principle to resolve an overly large number of trajectories into smaller chunks that are easier to analyze. We describe how drill-down techniques can be used to create and store selections of the trajectories with desired properties, enabling the comparison of multiple datasets. In appropriately designed 2D and 3D views, biochemists can either observe individual trajectories or choose to aggregate the information into a functional boxplot or density visualization. Our solution is based on a tight collaboration with the domain experts, aiming to address their needs as much as possible. The usefulness of our novel approach is demonstrated by two case studies, conducted by the collaborating protein engineers.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization; Human-centered computing; Visualization; Visualization systems and toolkits", "link": "https://doi.org/10.1109/PacificVis.2019.00032", "refList": ["10.1021/acscatal.6b02081", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2010.44", "10.1007/s11634-013-0158-y", "10.1186/s12859-016-1445-3", "10.1111/cgf.12106", "10.1021/ci200227u", "10.1007/978-3-319-15976-8\\_1", "10.1039/c3fd00145h", "10.1109/tvcg.2014.2346455", "10.1080/13658816.2010.511223", "10.1002/jcc.21334", "10.1109/tvcg.2016.2598825", "10.1109/romoco.2017.8003911", "10.1093/bioinformatics/btx125", "10.1109/tvcg.2006.99", "10.1111/cgf.12928", "10.1038/nchembio.205", "10.1002/anie.201206708", "10.1002/prot.25177", "10.1198/jcgs.2009.08158", "10.1021/bi901900s", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/bti1017", "10.1016/s0065-3233(08)60520-3", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.2312/molva.20181102", "10.1021/ct9000685", "10.1074/jbc.ra117.000328", "10.2312/vcbm.20171235", "10.1111/cgf.13428"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13428", "year": "2018", "title": "Visual Analysis of protein-ligand interactions", "conferenceName": "EuroVis", "authors": "Pere{-}Pau V{\\'{a}}zquez;Pedro Hermosilla;Victor Guallar;Jorge Estrada;{\\`{A}}lvar Vinacua", "citationCount": "5", "affiliation": "Vazquez, P (Corresponding Author), Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nVazquez, P.; Vinacua, A., Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nHermosilla, P., Univ Ulm, Visual Comp Grp, Ulm, Germany.\nGuallar, V.; Estrada, J., Barcelona SuperComp Ctr, Barcelona, Spain.\nGuallar, V., ICREA, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "The analysis of protein-ligand interactions is complex because of the many factors at play. Most current methods for visual analysis provide this information in the form of simple 2D plots, which, besides being quite space hungry, often encode a low number of different properties. In this paper we present a system for compact 2D visualization of molecular simulations. It purposely omits most spatial information and presents physical information associated to single molecular components and their pairwise interactions through a set of 2D InfoVis tools with coordinated views, suitable interaction, and focus+context techniques to analyze large amounts of data. The system provides a wide range of motifs for elements such as protein secondary structures or hydrogen bond networks, and a set of tools for their interactive inspection, both for a single simulation and for comparing two different simulations. As a result, the analysis of protein-ligand interactions of Molecular Simulation trajectories is greatly facilitated.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13428", "refList": ["10.1186/1758-2946-4-17", "10.1021/ci200227u", "10.1021/ci049885e", "10.1109/tvcg.2014.2350479", "10.3390/e16010233", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1186/1471-2105-14-244", "10.1371/journal.pcbi.1003321", "10.1107/s0021889811038970", "10.1109/tvcg.2016.2598825", "10.2312/vcbm.20151209", "10.1107/s0021889808012016", "10.1111/cgf.12928", "10.1146/annurev.physchem.51.1.129", "10.1023/a:1008005918983", "10.1111/cgf.12375", "10.1109/tvcg.2007.70578", "10.1093/bioinformatics/btu364", "10.1093/nar/gkv315", "10.1109/tvcg.2015.2467293", "10.1107/s0907444905029604", "10.1073/pnas.95.11.5998", "10.1109/tvcg.2012.282", "10.1111/cgf.12373", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1093/bioinformatics/btl150", "10.1109/pacificvis.2009.4906853", "10.1111/cgf.12197", "10.1080/10611860400024078", "10.1186/1758-2946-5-40", "10.1006/jmbi.1998.2401", "10.1101/gr.092759.109", "10.1109/tvcg.2014.2346403", "10.1002/jcc.20292", "10.1007/s10822-011-9531-0", "10.1093/nar/gkw265", "10.1179/000870403235002042"], "wos": 1, "children": [{"doi": "10.1109/pacificvis.2019.00032", "year": "2019", "title": "Visual Analysis of Ligand Trajectories in Molecular Dynamics", "conferenceName": "PacificVis", "authors": "Adam Jurc{\\'{\\i}}k;Katar{\\'{\\i}}na Furmanov{\\'{a}};Jan Byska;Vojtech Von{\\'{a}}sek;Ondrej V{\\'{a}}vra;Pavol Ulbrich;Helwig Hauser;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nJurcik, Adam; Furmanova, Katarina; Byska, Jan; Vavra, Ondrej; Ulbrich, Pavol; Hauser, Helwig; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nByska, Jan, Univ Bergen, Bergen, Norway.\nVonasek, Vojtech, Czech Tech Univ, Prague, Czech Republic.\nVavra, Ondrej, FNUSA ICRC, Brno, Czech Republic.\nHauser, Helwig, MMIV, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "In many cases, protein reactions with other small molecules (ligands) occur in a deeply buried active site. When studying these types of reactions, it is crucial for biochemists to examine trajectories of ligand motion. These trajectories are predicted with in-silico methods that produce large ensembles of possible trajectories. In this paper, we propose a novel approach to the interactive visual exploration and analysis of large sets of ligand trajectories, enabling the domain experts to understand protein function based on the trajectory properties. The proposed solution is composed of multiple linked 2D and 3D views, enabling the interactive exploration and filtering of trajectories in an informed way. In the workflow, we focus on the practical aspects of the interactive visual analysis specific to ligand trajectories. We adapt the small multiples principle to resolve an overly large number of trajectories into smaller chunks that are easier to analyze. We describe how drill-down techniques can be used to create and store selections of the trajectories with desired properties, enabling the comparison of multiple datasets. In appropriately designed 2D and 3D views, biochemists can either observe individual trajectories or choose to aggregate the information into a functional boxplot or density visualization. Our solution is based on a tight collaboration with the domain experts, aiming to address their needs as much as possible. The usefulness of our novel approach is demonstrated by two case studies, conducted by the collaborating protein engineers.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization; Human-centered computing; Visualization; Visualization systems and toolkits", "link": "https://doi.org/10.1109/PacificVis.2019.00032", "refList": ["10.1021/acscatal.6b02081", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2010.44", "10.1007/s11634-013-0158-y", "10.1186/s12859-016-1445-3", "10.1111/cgf.12106", "10.1021/ci200227u", "10.1007/978-3-319-15976-8\\_1", "10.1039/c3fd00145h", "10.1109/tvcg.2014.2346455", "10.1080/13658816.2010.511223", "10.1002/jcc.21334", "10.1109/tvcg.2016.2598825", "10.1109/romoco.2017.8003911", "10.1093/bioinformatics/btx125", "10.1109/tvcg.2006.99", "10.1111/cgf.12928", "10.1038/nchembio.205", "10.1002/anie.201206708", "10.1002/prot.25177", "10.1198/jcgs.2009.08158", "10.1021/bi901900s", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/bti1017", "10.1016/s0065-3233(08)60520-3", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.2312/molva.20181102", "10.1021/ct9000685", "10.1074/jbc.ra117.000328", "10.2312/vcbm.20171235", "10.1111/cgf.13428"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 23}], "len": 57}, {"doi": "10.1109/tvcg.2016.2598825", "title": "Physics-Based Visual Characterization of Molecular Interaction Forces", "year": "2016", "conferenceName": "SciVis", "authors": "Pedro Hermosilla;Jorge Estrada;Victor Guallar;Timo Ropinski;Àlvar Vinacua;Pere-Pau Vázquez", "citationCount": "10", "affiliation": "Hermosilla, P (Corresponding Author), ViRVIG Grp, Barcelona, Spain. Hermosilla, P (Corresponding Author), Barcelona Supercomp Ctr, Barcelona, Spain. Hermosilla, Pedro, ViRVIG Grp, Barcelona, Spain. Hermosilla, Pedro; Estrada, Jorge; Guallar, Victor, Barcelona Supercomp Ctr, Barcelona, Spain. Ropinski, Timo, Univ Ulm, Visual Comp Grp, D-89069 Ulm, Germany. Vinacua, Alvar; Vazquez, Pere-Pau, UPC Barcelona, ViRVIG Grp, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "Molecular simulations are used in many areas of biotechnology, such as drug design and enzyme engineering. Despite the development of automatic computational protocols, analysis of molecular interactions is still a major aspect where human comprehension and intuition are key to accelerate, analyze, and propose modifications to the molecule of interest. Most visualization algorithms help the users by providing an accurate depiction of the spatial arrangement: the atoms involved in inter-molecular contacts. There are few tools that provide visual information on the forces governing molecular docking. However, these tools, commonly restricted to close interaction between atoms, do not consider whole simulation paths, long-range distances and, importantly, do not provide visual cues for a quick and intuitive comprehension of the energy functions (modeling intermolecular interactions) involved. In this paper, we propose visualizations designed to enable the characterization of interaction forces by taking into account several relevant variables such as molecule-ligand distance and the energy function, which is essential to understand binding affinities. We put emphasis on mapping molecular docking paths obtained from Molecular Dynamics or Monte Carlo simulations, and provide time-dependent visualizations for different energy components and particle resolutions: atoms, groups or residues. The presented visualizations have the potential to support domain experts in a more efficient drug or enzyme design process.", "keywords": "Molecular visualization;binding analysis", "link": "http://dx.doi.org/10.1109/TVCG.2016.2598825", "refList": ["10.1186/1472-6807-9-19", "10.1109/tvcg.2009.157", "10.1109/tvcg.2007.70517", "10.1186/1758-2946-4-17", "10.1016/j.str.2015.09.012", "10.1111/cgf.12374", "10.1006/jmbi.1996.0663", "10.1021/ci200227u", "10.2312/spbg/spbg06/059-065", "10.1021/ci049885e", "10.1006/jmbi.1998.2400", "10.1111/j.1467-8659.2009.01698.x", "10.1109/tvcg.2014.2350479", "10.1111/j.1467-8659.2012.03128.x", "10.1109/tvcg.2010.250", "10.1371/journal.pcbi.1003321", "10.1107/s0021889811038970", "10.1093/nar/gkt454", "10.1109/tvcg.2006.115", "10.1146/annurev-biophys-042910-155245", "10.1107/s0021889808012016", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12375", "10.1109/tvcg.2007.70578", "10.1021/acscatal.6b00028", "10.1093/bib/bbq089", "10.1093/nar/gkv315", "10.1109/tvcg.2015.2467293", "10.1109/tvcg.2012.282", "10.1111/cgf.12373", "10.1093/bioinformatics/btl150", "10.1109/mcg.2013.37", "10.1109/pacificvis.2009.4906853", "10.1109/pacificvis.2012.6183593", "10.1111/cgf.12197", "10.1186/1758-2946-5-40", "10.2312/eurovisstar.20151112", "10.1080/10611860400024078", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2014.2346403", "10.1007/s10822-011-9531-0", "10.1111/cgf.12370", "10.1109/tvcg.2009.168", "10.1016/j.sbi.2007.06.008"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864851", "title": "Visualization of Large Molecular Trajectories", "year": "2018", "conferenceName": "SciVis", "authors": "David Duran;Pedro Hermosilla;Timo Ropinski;Barbora Kozlíková;Àlvar Vinacua;Pere-Pau Vázquez", "citationCount": "1", "affiliation": "Duran, D (Corresponding Author), UPC Barcelona, ViRVIG Grp, Barcelona, Spain. Duran, David; Vinacua, Alvar; Vazquez, Pere-Pau, UPC Barcelona, ViRVIG Grp, Barcelona, Spain. Hermosilla, Pedro; Ropinski, Timo, Univ Ulm, Visual Comp Grp, Ulm, Germany. Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.", "countries": "Spain;Germany;Republic", "abstract": "The analysis of protein-ligand interactions is a time-intensive task. Researchers have to analyze multiple physico-chemical properties of the protein at once and combine them to derive conclusions about the protein-ligand interplay. Typically, several charts are inspected, and 3D animations can be played side-by-side to obtain a deeper understanding of the data. With the advances in simulation techniques, larger and larger datasets are available, with up to hundreds of thousands of steps. Unfortunately, such large trajectories are very difficult to investigate with traditional approaches. Therefore, the need for special tools that facilitate inspection of these large trajectories becomes substantial. In this paper, we present a novel system for visual exploration of very large trajectories in an interactive and user-friendly way. Several visualization motifs are automatically derived from the data to give the user the information about interactions between protein and ligand. Our system offers specialized widgets to ease and accelerate data inspection and navigation to interesting parts of the simulation. The system is suitable also for simulations where multiple ligands are involved. We have tested the usefulness of our tool on a set of datasets obtained from protein engineers, and we describe the expert feedback.", "keywords": "Molecular visualization,simulation inspection,long trajectories", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864851", "refList": ["10.1109/tkde.2016.2557324", "10.1002/anie.199009921", "10.1145/2702123.2702419", "10.1109/mcse.2015.7", "10.1021/ci200227u", "10.1007/s10822-010-9352-6", "10.1016/j.sbi.2012.11.002", "10.1109/tvcg.2014.2350479", "10.3390/e16010233", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1038/nmeth.3258", "10.1109/tvcg.2016.2598797", "10.1109/tvcg.2016.2598825", "10.1186/1753-6561-8-s2-s3", "10.1021/ct400341p", "10.1016/0010-4655(95)00041-d", "10.1111/cgf.12928", "10.1145/1364782.1364802", "10.1109/tvcg.2016.2539960", "10.1109/tvcg.2012.225", "10.1093/bib/bbq089", "10.2312/eurovisshort.20171146", "10.1093/nar/gkv315", "10.1109/bigdata.2015.7363824", "10.1109/tits.2015.2436897", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1186/1753-6561-8-s2-s5", "10.1016/0263-7855(96)00018-5", "10.1093/comjnl/20.4.364", "10.2174/1874091x01610010001", "10.1214/ss/1076102418", "10.1145/2890478", "10.1109/biovis.2012.6378599", "10.1109/tvcg.2014.2346574", "10.1111/cgf.13208", "10.1016/j.sbi.2014.04.002"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934258", "title": "Scale-Space Splatting: Reforming Spacetime for Cross-Scale Exploration of Integral Measures in Molecular Dynamics", "year": "2019", "conferenceName": "SciVis", "authors": "Juraj Pálenik;Jan Byska;Stefan Bruckner;Helwig Hauser", "citationCount": "0", "affiliation": "Palenik, J (Corresponding Author), Univ Bergen, Bergen, Norway. Palenik, Juraj; Byska, Jan; Bruckner, Stefan; Hauser, Helwig, Univ Bergen, Bergen, Norway. Byska, Jan, Masaryk Univ, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "Understanding large amounts of spatiotemporal data from particle-based simulations, such as molecular dynamics, often relies on the computation and analysis of aggregate measures. These, however, by virtue of aggregation, hide structural information about the space/time localization of the studied phenomena. This leads to degenerate cases where the measures fail to capture distinct behaviour. In order to drill into these aggregate values, we propose a multi-scale visual exploration technique. Our novel representation, based on partial domain aggregation, enables the construction of a continuous scale-space for discrete datasets and the simultaneous exploration of scales in both space and time. We link these two scale-spaces in a scale-space space-time cube and model linked views as orthogonal slices through this cube, thus enabling the rapid identification of spatio-temporal patterns at multiple scales. To demonstrate the effectiveness of our approach, we showcase an advanced exploration of a protein-ligand simulation.", "keywords": "Scale space,time-series,scientific simulation,multi-scale analysis,space-time cube,molecular dynamics", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934258", "refList": ["10.1111/cgf.13445", "10.1109/tvcg.2012.191", "10.1201/b14876", "10.1145/827051.827056", "10.1080/07391102.2005.10531229", "10.1021/acs.jcim.7b00070", "10.1007/978-3-8348-9190-729", "10.1111/cgf.13427", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1016/0021-9991(82)90025-0", "10.1111/cgf.13177", "10.1007/978-1-4757-6465-9", "10.1145/1044588.1044615", "10.2307/2669996", "10.1109/tvcg.2018.2865049", "10.1007/978-3-540-70823-0\\_3", "10.1111/cgf.13640", "10.1109/tvcg.2010.253", "10.1109/tvcg.2009.177", "10.1016/j.csda.2018.03.014", "10.1109/tvcg.2009.200", "10.1109/visual.2003.1250353", "10.2312/eurovisshort.20171146", "10.1109/tvcg.2010.148", "10.1002/9780470316849", "10.1109/visual.1993.398859", "10.1007/978-1-4612-4026-6", "10.1016/j.jmb.2018.09.004", "10.1111/cgf.13415", "10.2312/molva.20181102", "10.1371/journal.pcbi.1002708", "10.1007/s10851-010-0242-2", "10.1016/0263-7855(96)00018-5", "10.1109/visual.2003.1250402", "10.1007/bf01936872", "10.1002/wics.79", "10.1111/j.1467-8659.2009.01684.x", "10.1109/tvcg.2018.2864510", "10.1111/cgf.12804", "10.1117/12.904668", "10.1002/jcc.20289", "10.1088/0965-0393/18/1/015012", "10.1109/34.56205", "10.1111/j.1435-5597.1970.tb01464.x", "10.1007/978-0-85729-079-3", "10.1007/s11263-005-1838-7"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}, {"doi": "10.1109/pacificvis.2019.00032", "year": "2019", "title": "Visual Analysis of Ligand Trajectories in Molecular Dynamics", "conferenceName": "PacificVis", "authors": "Adam Jurc{\\'{\\i}}k;Katar{\\'{\\i}}na Furmanov{\\'{a}};Jan Byska;Vojtech Von{\\'{a}}sek;Ondrej V{\\'{a}}vra;Pavol Ulbrich;Helwig Hauser;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nJurcik, Adam; Furmanova, Katarina; Byska, Jan; Vavra, Ondrej; Ulbrich, Pavol; Hauser, Helwig; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nByska, Jan, Univ Bergen, Bergen, Norway.\nVonasek, Vojtech, Czech Tech Univ, Prague, Czech Republic.\nVavra, Ondrej, FNUSA ICRC, Brno, Czech Republic.\nHauser, Helwig, MMIV, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "In many cases, protein reactions with other small molecules (ligands) occur in a deeply buried active site. When studying these types of reactions, it is crucial for biochemists to examine trajectories of ligand motion. These trajectories are predicted with in-silico methods that produce large ensembles of possible trajectories. In this paper, we propose a novel approach to the interactive visual exploration and analysis of large sets of ligand trajectories, enabling the domain experts to understand protein function based on the trajectory properties. The proposed solution is composed of multiple linked 2D and 3D views, enabling the interactive exploration and filtering of trajectories in an informed way. In the workflow, we focus on the practical aspects of the interactive visual analysis specific to ligand trajectories. We adapt the small multiples principle to resolve an overly large number of trajectories into smaller chunks that are easier to analyze. We describe how drill-down techniques can be used to create and store selections of the trajectories with desired properties, enabling the comparison of multiple datasets. In appropriately designed 2D and 3D views, biochemists can either observe individual trajectories or choose to aggregate the information into a functional boxplot or density visualization. Our solution is based on a tight collaboration with the domain experts, aiming to address their needs as much as possible. The usefulness of our novel approach is demonstrated by two case studies, conducted by the collaborating protein engineers.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization; Human-centered computing; Visualization; Visualization systems and toolkits", "link": "https://doi.org/10.1109/PacificVis.2019.00032", "refList": ["10.1021/acscatal.6b02081", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2010.44", "10.1007/s11634-013-0158-y", "10.1186/s12859-016-1445-3", "10.1111/cgf.12106", "10.1021/ci200227u", "10.1007/978-3-319-15976-8\\_1", "10.1039/c3fd00145h", "10.1109/tvcg.2014.2346455", "10.1080/13658816.2010.511223", "10.1002/jcc.21334", "10.1109/tvcg.2016.2598825", "10.1109/romoco.2017.8003911", "10.1093/bioinformatics/btx125", "10.1109/tvcg.2006.99", "10.1111/cgf.12928", "10.1038/nchembio.205", "10.1002/anie.201206708", "10.1002/prot.25177", "10.1198/jcgs.2009.08158", "10.1021/bi901900s", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/bti1017", "10.1016/s0065-3233(08)60520-3", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.2312/molva.20181102", "10.1021/ct9000685", "10.1074/jbc.ra117.000328", "10.2312/vcbm.20171235", "10.1111/cgf.13428"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13428", "year": "2018", "title": "Visual Analysis of protein-ligand interactions", "conferenceName": "EuroVis", "authors": "Pere{-}Pau V{\\'{a}}zquez;Pedro Hermosilla;Victor Guallar;Jorge Estrada;{\\`{A}}lvar Vinacua", "citationCount": "5", "affiliation": "Vazquez, P (Corresponding Author), Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nVazquez, P.; Vinacua, A., Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nHermosilla, P., Univ Ulm, Visual Comp Grp, Ulm, Germany.\nGuallar, V.; Estrada, J., Barcelona SuperComp Ctr, Barcelona, Spain.\nGuallar, V., ICREA, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "The analysis of protein-ligand interactions is complex because of the many factors at play. Most current methods for visual analysis provide this information in the form of simple 2D plots, which, besides being quite space hungry, often encode a low number of different properties. In this paper we present a system for compact 2D visualization of molecular simulations. It purposely omits most spatial information and presents physical information associated to single molecular components and their pairwise interactions through a set of 2D InfoVis tools with coordinated views, suitable interaction, and focus+context techniques to analyze large amounts of data. The system provides a wide range of motifs for elements such as protein secondary structures or hydrogen bond networks, and a set of tools for their interactive inspection, both for a single simulation and for comparing two different simulations. As a result, the analysis of protein-ligand interactions of Molecular Simulation trajectories is greatly facilitated.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13428", "refList": ["10.1186/1758-2946-4-17", "10.1021/ci200227u", "10.1021/ci049885e", "10.1109/tvcg.2014.2350479", "10.3390/e16010233", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1186/1471-2105-14-244", "10.1371/journal.pcbi.1003321", "10.1107/s0021889811038970", "10.1109/tvcg.2016.2598825", "10.2312/vcbm.20151209", "10.1107/s0021889808012016", "10.1111/cgf.12928", "10.1146/annurev.physchem.51.1.129", "10.1023/a:1008005918983", "10.1111/cgf.12375", "10.1109/tvcg.2007.70578", "10.1093/bioinformatics/btu364", "10.1093/nar/gkv315", "10.1109/tvcg.2015.2467293", "10.1107/s0907444905029604", "10.1073/pnas.95.11.5998", "10.1109/tvcg.2012.282", "10.1111/cgf.12373", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1093/bioinformatics/btl150", "10.1109/pacificvis.2009.4906853", "10.1111/cgf.12197", "10.1080/10611860400024078", "10.1186/1758-2946-5-40", "10.1006/jmbi.1998.2401", "10.1101/gr.092759.109", "10.1109/tvcg.2014.2346403", "10.1002/jcc.20292", "10.1007/s10822-011-9531-0", "10.1093/nar/gkw265", "10.1179/000870403235002042"], "wos": 1, "children": [{"doi": "10.1109/pacificvis.2019.00032", "year": "2019", "title": "Visual Analysis of Ligand Trajectories in Molecular Dynamics", "conferenceName": "PacificVis", "authors": "Adam Jurc{\\'{\\i}}k;Katar{\\'{\\i}}na Furmanov{\\'{a}};Jan Byska;Vojtech Von{\\'{a}}sek;Ondrej V{\\'{a}}vra;Pavol Ulbrich;Helwig Hauser;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nJurcik, Adam; Furmanova, Katarina; Byska, Jan; Vavra, Ondrej; Ulbrich, Pavol; Hauser, Helwig; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nByska, Jan, Univ Bergen, Bergen, Norway.\nVonasek, Vojtech, Czech Tech Univ, Prague, Czech Republic.\nVavra, Ondrej, FNUSA ICRC, Brno, Czech Republic.\nHauser, Helwig, MMIV, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "In many cases, protein reactions with other small molecules (ligands) occur in a deeply buried active site. When studying these types of reactions, it is crucial for biochemists to examine trajectories of ligand motion. These trajectories are predicted with in-silico methods that produce large ensembles of possible trajectories. In this paper, we propose a novel approach to the interactive visual exploration and analysis of large sets of ligand trajectories, enabling the domain experts to understand protein function based on the trajectory properties. The proposed solution is composed of multiple linked 2D and 3D views, enabling the interactive exploration and filtering of trajectories in an informed way. In the workflow, we focus on the practical aspects of the interactive visual analysis specific to ligand trajectories. We adapt the small multiples principle to resolve an overly large number of trajectories into smaller chunks that are easier to analyze. We describe how drill-down techniques can be used to create and store selections of the trajectories with desired properties, enabling the comparison of multiple datasets. In appropriately designed 2D and 3D views, biochemists can either observe individual trajectories or choose to aggregate the information into a functional boxplot or density visualization. Our solution is based on a tight collaboration with the domain experts, aiming to address their needs as much as possible. The usefulness of our novel approach is demonstrated by two case studies, conducted by the collaborating protein engineers.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization; Human-centered computing; Visualization; Visualization systems and toolkits", "link": "https://doi.org/10.1109/PacificVis.2019.00032", "refList": ["10.1021/acscatal.6b02081", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2010.44", "10.1007/s11634-013-0158-y", "10.1186/s12859-016-1445-3", "10.1111/cgf.12106", "10.1021/ci200227u", "10.1007/978-3-319-15976-8\\_1", "10.1039/c3fd00145h", "10.1109/tvcg.2014.2346455", "10.1080/13658816.2010.511223", "10.1002/jcc.21334", "10.1109/tvcg.2016.2598825", "10.1109/romoco.2017.8003911", "10.1093/bioinformatics/btx125", "10.1109/tvcg.2006.99", "10.1111/cgf.12928", "10.1038/nchembio.205", "10.1002/anie.201206708", "10.1002/prot.25177", "10.1198/jcgs.2009.08158", "10.1021/bi901900s", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/bti1017", "10.1016/s0065-3233(08)60520-3", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.2312/molva.20181102", "10.1021/ct9000685", "10.1074/jbc.ra117.000328", "10.2312/vcbm.20171235", "10.1111/cgf.13428"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}], "len": 19}, {"doi": "10.1109/tvcg.2017.2744518", "title": "Visualization Multi-Pipeline for Communicating Biology", "year": "2017", "conferenceName": "SciVis", "authors": "Peter Mindek;David Kouril;Johannes Sorger;Daniel Toloudis;Blair Lyons;Graham Johnson;M. Eduard Gröller;Ivan Viola", "citationCount": "4", "affiliation": "Mindek, P (Corresponding Author), TU Wien, Vienna, Austria. Mindek, Peter; Kouril, David; Sorger, Johannes; Groeller, M. Eduard; Viola, Ivan, TU Wien, Vienna, Austria. Groeller, M. Eduard, VRVis Res Ctr, Vienna, Austria. Toloudis, Daniel; Lyons, Blair; Johnson, Graham, Allen Inst Cell Sci, Seattle, WA USA.", "countries": "USA;Austria", "abstract": "We propose a system to facilitate biology communication by developing a pipeline to support the instructional visualization of heterogeneous biological data on heterogeneous user-devices. Discoveries and concepts in biology are typically summarized with illustrations assembled manually from the interpretation and application of heterogenous data. The creation of such illustrations is time consuming, which makes it incompatible with frequent updates to the measured data as new discoveries are made. Illustrations are typically non-interactive, and when an illustration is updated, it still has to reach the user. Our system is designed to overcome these three obstacles. It supports the integration of heterogeneous datasets, reflecting the knowledge that is gained from different data sources in biology. After pre-processing the datasets, the system transforms them into visual representations as inspired by scientific illustrations. As opposed to traditional scientific illustration these representations are generated in real-time - they are interactive. The code generating the visualizations can be embedded in various software environments. To demonstrate this, we implemented both a desktop application and a remote-rendering server in which the pipeline is embedded. The remote-rendering server supports multi-threaded rendering and it is able to handle multiple users simultaneously. This scalability to different hardware environments, including multi-GPU setups, makes our system useful for efficient public dissemination of biological discoveries.", "keywords": "Biological visualization,remote rendering,public dissemination", "link": "http://dx.doi.org/10.1109/TVCG.2017.2744518", "refList": ["10.1007/11553595\\_41", "10.1145/1015706.1015782", "10.2312/eged.20161025", "10.1145/800064.801290", "10.1002/jcc.20084", "10.1111/j.1467-8659.2009.01464.x", "10.1145/2801040.2801057", "10.1007/s10278-004-1014-6", "10.1007/1155359541", "10.1109/tvcg.2014.2350479", "10.1145/1187112.1187183", "10.1111/j.1467-8659.2012.03128.x", "10.1016/j.tcb.2010.08.005", "10.2312/vcbm.20151209", "10.1016/b978-012387582-2/50038-1", "10.1109/tvcg.2007.29", "10.1016/bs.mcb.2014.10.003", "10.1039/c4fd00017j", "10.1145/2010425.2010450", "10.1038/nmeth.1431", "10.1038/nmeth.2019", "10.1002/mrd.22489", "10.1111/cgf.12370", "10.1109/visual.2000.885729", "10.1187/cbe.12-06-0091", "10.1038/nmeth.3204"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864491", "title": "Labels on Levels: Labeling of Multi-Scale Multi-Instance and Crowded 3D Biological Environments", "year": "2018", "conferenceName": "SciVis", "authors": "David Kouril;Ladislav Cmolík;Barbora Kozlíková;Hsiang-Yun Wu;Graham Johnson;David S. Goodsell;Arthur J. Olson;M. Eduard Gröller;Ivan Viola", "citationCount": "1", "affiliation": "Kouril, D (Corresponding Author), TU Wien, Vienna, Austria. Kouril, David; Wu, Hsiang-Yun; Groller, M. Eduard; Viola, Ivan, TU Wien, Vienna, Austria. Groller, M. Eduard, VRVis Res Ctr, Vienna, Austria. Cmolik, Ladislav, Czech Tech Univ, Fac Elect Engn, Prague, Czech Republic. Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic. Johnson, Graham, Allen Inst Cell Sci, Seattle, WA USA. Goodsell, David S.; Olson, Arthur, Scripps Res Inst, San Diego, CA USA.", "countries": "Republic;USA;Austria", "abstract": "Labeling is intrinsically important for exploring and understanding complex environments and models in a variety of domains. We present a method for interactive labeling of crowded 3D scenes containing very many instances of objects spanning multiple scales in size. In contrast to previous labeling methods, we target cases where many instances of dozens of types are present and where the hierarchical structure of the objects in the scene presents an opportunity to choose the most suitable level for each placed label. Our solution builds on and goes beyond labeling techniques in medical 3D visualization, cartography, and biological illustrations from books and prints. In contrast to these techniques, the main characteristics of our new technique are: 1) a novel way of labeling objects as part of a bigger structure when appropriate, 2) visual clutter reduction by labeling only representative instances for each type of an object, and a strategy of selecting those. The appropriate level of label is chosen by analyzing the scene's depth buffer and the scene objects' hierarchy tree. We address the topic of communicating the parent-children relationship between labels by employing visual hierarchy concepts adapted from graphic design. Selecting representative instances considers several criteria tailored to the character of the data and is combined with a greedy optimization approach. We demonstrate the usage of our method with models from mesoscale biology where these two characteristics-multi-scale and multi-instance-are abundant, along with the fact that these scenes are extraordinarily dense.", "keywords": "labeling,multi-scale data,multi-instance data", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864491", "refList": ["10.1145/1111411.1111431", "10.1002/jcc.20084", "10.1109/tvcg.2017.2744518", "10.1145/2557423", "10.1007/978-3-319-03611-3\\_17", "10.2312/vcbm.20141192", "10.1016/j.comgeo.2009.03.006", "10.1145/2024156.2024165", "10.1559/152304075784313304", "10.1057/palgrave.ivs.9500163", "10.1016/b978-155860915-0/50040-8", "10.2312/vcbm.20151209", "10.1016/j.cag.2010.05.002", "10.1145/1377980.1377986", "10.1109/tvcg.2008.168", "10.1039/c4fd00017j", "10.2312/vcbm.20131266", "10.1109/vr.2014.6802046", "10.1111/j.1467-8659.2005.00880.x", "10.1109/tvcg.2006.136", "10.1109/cadgraphics.2013.51", "10.1109/pacificvis.2010.5429592", "10.1007/978-3-319-57336-6\\_9", "10.1002/bmb.2006.494034042644", "10.1038/nmeth.3204", "10.1007/978-3-319-04657-0\\_7"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934334", "title": "Scale Trotter: Illustrative Visual Travels Across Negative Scales", "year": "2019", "conferenceName": "SciVis", "authors": "Sarkis Halladjian;Haichao Miao;David Kouril;M. Eduard Gröller;Ivan Viola;Tobias Isenberg", "citationCount": "1", "affiliation": "Halladjian, S (Corresponding Author), INRIA, Paris, France. Halladjian, S (Corresponding Author), Univ Paris Saclay, St Aubin, France. Halladjian, Sarkis; Isenberg, Tobias, INRIA, Paris, France. Halladjian, Sarkis, Univ Paris Saclay, St Aubin, France. Miao, Haichao; Kouril, David; Groller, M. Eduard, TU Wien, Vienna, Austria. Groller, M. Eduard, VRVis Res Ctr, Vienna, Austria. Viola, Ivan, King Abdullah Univ Sci \\& Technol, Thuwal, Saudi Arabia.", "countries": "Arabia;France;Austria", "abstract": "We present ScaleTrotter, a conceptual framework for an interactive, multi-scale visualization of biological mesoscale data and, specifically, genome data. ScaleTrotter allows viewers to smoothly transition from the nucleus of a cell to the atomistic composition of the DNA, while bridging several orders of magnitude in scale. The challenges in creating an interactive visualization of genome data are fundamentally different in several ways from those in other domains like astronomy that require a multi-scale representation as well. First, genome data has intertwined scale levels—the DNA is an extremely long, connected molecule that manifests itself at all scale levels. Second, elements of the DNA do not disappear as one zooms out—instead the scale levels at which they are observed group these elements differently. Third, we have detailed information and thus geometry for the entire dataset and for all scale levels, posing a challenge for interactive visual exploration. Finally, the conceptual scale levels for genome data are close in scale space, requiring us to find ways to visually embed a smaller scale into a coarser one. We address these challenges by creating a new multi-scale visualization concept. We use a scale-dependent camera model that controls the visual embedding of the scales into their respective parents, the rendering of a subset of the scale hierarchy, and the location, size, and scope of the view. In traversing the scales, ScaleTrotter is roaming between 2D and 3D visual representations that are depicted in integrated visuals. We discuss, specifically, how this form of multi-scale visualization follows from the specific characteristics of the genome data and describe its implementation. Finally, we discuss the implications of our work to the general illustrative depiction of multi-scale data.", "keywords": "Multi-scale visualization,scale transition,abstraction,human genome,DNA,Hi-C data", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934334", "refList": ["10.1126/science.291.5507.1177", "10.1038/nrneph.2010.55", "10.1016/j.jmb.2018.06.009", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2017.2743958", "10.1111/j.1467-8659.2012.03128.x", "10.1145/1507149.1507186", "10.1111/j.1467-8659.2012.03082.x", "10.1109/tvcg.2007.2", "10.1145/2024156.2024165", "10.1201/b17511", "10.1038/srep20802", "10.1145/1239451.1239482", "10.1109/mcg.2005.34", "10.1111/cgf.13429", "10.1186/1471-2105-11-444", "10.1109/tvcg.2015.2403323", "10.2312/vcbm.20151209", "10.1109/ldav.2016.7874310", "10.3791/1869", "10.1109/tvcg.2017.2747545", "10.1109/tvcg.2017.2743981", "10.1111/cgf.12892", "10.1126/science.aag0025", "10.1101/gr.213611.116", "10.2312/eurovisshort.20171146", "10.1109/mcg.2008.63", "10.1111/cgf.12349", "10.1017/s0890060411000230", "10.1109/tvcg.2007.70591", "10.1109/infvis.2004.12", "10.1111/cgf.13202", "10.2312/vissym/eurovis05/303-310", "10.1111/cgf.13072", "10.1016/j.jmb.2018.09.004", "10.1111/j.1467-8659.2011.01917.x", "10.1111/cgf.12197", "10.2312/eurovisstar.20151112", "10.1086/344286", "10.1093/nar/gks586", "10.2312/ega.20101005", "10.1186/s13059-018-1486-1", "10.1109/visual.2004.103", "10.1111/j.1467-8659.2009.01692.x", "10.1109/tvcg.2017.2744278", "10.1109/tvcg.2012.159", "10.1109/tvcg.2018.2864507", "10.1038/nrm1225", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030415", "title": "Modeling in the Time of COVID-19: Statistical and Rule-based Mesoscale Models", "year": "2020", "conferenceName": "SciVis", "authors": "Ngan Nguyen;Ondrej Strnad;Tobias Klein;Deng Luo;Ruwayda Alharbi;Peter Wonka;Martina Maritan;Peter Mindek;Ludovic Autin;David S. Goodsell;Ivan Viola", "citationCount": "0", "affiliation": "Nguyen, N (Corresponding Author), King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Nguyen, Ngan; Strnad, Ondrej; Luo, Deng; Alharbi, Ruwayda; Wonka, Peter; Viola, Ivan, King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Klein, Tobias; Mindek, Peter, TU Wien, Vienna, Austria. Klein, Tobias; Mindek, Peter, Nanographics GmbH, Vienna, Austria. Maritan, Martina; Autin, Ludovic; Goodsell, David S., Scripps Res Inst, La Jolla, CA 92037 USA.", "countries": "USA;Arabia;Austria", "abstract": "We present a new technique for the rapid modeling and construction of scientifically accurate mesoscale biological models. The resulting 3D models are based on a few 2D microscopy scans and the latest knowledge available about the biological entity, represented as a set of geometric relationships. Our new visual-programming technique is based on statistical and rule-based modeling approaches that are rapid to author, fast to construct, and easy to revise. From a few 2D microscopy scans, we determine the statistical properties of various structural aspects, such as the outer membrane shape, the spatial properties, and the distribution characteristics of the macromolecular elements on the membrane. This information is utilized in the construction of the 3D model. Once all the imaging evidence is incorporated into the model, additional information can be incorporated by interactively defining the rules that spatially characterize the rest of the biological entity, such as mutual interactions among macromolecules, and their distances and orientations relative to other structures. These rules are defined through an intuitive 3D interactive visualization as a visual-programming feedback loop. We demonstrate the applicability of our approach on a use case of the modeling procedure of the SARS-CoV-2 virion ultrastructure. This atomistic model, which we present here, can steer biological research to new promising directions in our efforts to fight the spread of the virus.", "keywords": "molecular visualization,mesoscale modeling", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030415", "refList": ["10.1145/2187836.2187957", "10.1109/tvcg.2009.157", "10.1099/0022-1317-39-3-545", "10.1007/978-3-319-73915-1\\_31", "10.1109/tvcg.2013.158", "10.1016/j.cag.2013.01.010", "10.1109/vast.2009.5333893", "10.1038/s41594-020-0468-7", "10.1145/174462.156635", "10.1038/nmeth.f.301", "10.1038/s41586-020-2008-3", "10.1016/j.jsb.2010.11.021", "10.7554/elife.57309", "10.1109/tvcg.2017.2744518", "10.1007/s00371-017-1397-2", "10.1109/tvcg.2017.2744258", "10.1111/cgf.13373", "10.1016/0022-5193(68)90079-9", "10.1111/j.1467-8659.2012.03128.x", "10.1145/2897824.2925951", "10.1007/978-3-319-28661-7\\_5", "10.1128/jvi.00645-06", "10.1016/bs.aivir.2016.08.005", "10.1007/978-3-319-50106-2\\_29", "10.1007/978-3-319-50106-2\\_30", "10.1107/s0907444910007493", "10.1093/gigascience/giz064", "10.1007/s11540-006-9010-5", "10.1111/cgf.13640", "10.1109/tvcg.2006.115", "10.1145/3130800.3130804", "10.1016/j.bbamem.2018.02.017", "10.1111/cgf.13816", "10.1021/acs.jctc.9b00453", "10.1016/j.jmgm.2016.07.008", "10.1126/science.abc6952", "10.1007/978-3-319-27261-0\\_16", "10.1007/978-3-319-73915-1\\_29", "10.1146/annurev.bb.06.060177.001055", "10.1002/(sici)1097-0282(199603)38:3", "10.1109/tvcg.2019.2934334", "10.1145/357306.357310", "10.1111/j.1467-8659.2009.01612.x", "10.3238/arztebl.2011.0087", "10.1093/bioinformatics/bty272", "10.1007/978-3-319-07121-35", "10.1107/s0021889883010985", "10.1101/2020.03.25.008904", "10.1126/science.abb9983", "10.1002/jcc.21861", "10.1111/cgf.12197", "10.1145/3197517.3201393", "10.1016/j.tibs.2020.02.010", "10.1007/s13238-016-0352-8", "10.1101/2020.06.26.173476", "10.1145/882262.882291", "10.1109/mcg.2018.2877076", "10.1093/nar/gkh468", "10.1038/nsb1203-980", "10.1007/978-3-319-07121-3\\_5", "10.1093/nar/gky427", "10.1111/cgf.12370", "10.1109/38.310720", "10.1038/nmeth.3204", "10.1109/tvcg.2016.2603178"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2020.3030415", "title": "Modeling in the Time of COVID-19: Statistical and Rule-based Mesoscale Models", "year": "2020", "conferenceName": "SciVis", "authors": "Ngan Nguyen;Ondrej Strnad;Tobias Klein;Deng Luo;Ruwayda Alharbi;Peter Wonka;Martina Maritan;Peter Mindek;Ludovic Autin;David S. Goodsell;Ivan Viola", "citationCount": "0", "affiliation": "Nguyen, N (Corresponding Author), King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Nguyen, Ngan; Strnad, Ondrej; Luo, Deng; Alharbi, Ruwayda; Wonka, Peter; Viola, Ivan, King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Klein, Tobias; Mindek, Peter, TU Wien, Vienna, Austria. Klein, Tobias; Mindek, Peter, Nanographics GmbH, Vienna, Austria. Maritan, Martina; Autin, Ludovic; Goodsell, David S., Scripps Res Inst, La Jolla, CA 92037 USA.", "countries": "USA;Arabia;Austria", "abstract": "We present a new technique for the rapid modeling and construction of scientifically accurate mesoscale biological models. The resulting 3D models are based on a few 2D microscopy scans and the latest knowledge available about the biological entity, represented as a set of geometric relationships. Our new visual-programming technique is based on statistical and rule-based modeling approaches that are rapid to author, fast to construct, and easy to revise. From a few 2D microscopy scans, we determine the statistical properties of various structural aspects, such as the outer membrane shape, the spatial properties, and the distribution characteristics of the macromolecular elements on the membrane. This information is utilized in the construction of the 3D model. Once all the imaging evidence is incorporated into the model, additional information can be incorporated by interactively defining the rules that spatially characterize the rest of the biological entity, such as mutual interactions among macromolecules, and their distances and orientations relative to other structures. These rules are defined through an intuitive 3D interactive visualization as a visual-programming feedback loop. We demonstrate the applicability of our approach on a use case of the modeling procedure of the SARS-CoV-2 virion ultrastructure. This atomistic model, which we present here, can steer biological research to new promising directions in our efforts to fight the spread of the virus.", "keywords": "molecular visualization,mesoscale modeling", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030415", "refList": ["10.1145/2187836.2187957", "10.1109/tvcg.2009.157", "10.1099/0022-1317-39-3-545", "10.1007/978-3-319-73915-1\\_31", "10.1109/tvcg.2013.158", "10.1016/j.cag.2013.01.010", "10.1109/vast.2009.5333893", "10.1038/s41594-020-0468-7", "10.1145/174462.156635", "10.1038/nmeth.f.301", "10.1038/s41586-020-2008-3", "10.1016/j.jsb.2010.11.021", "10.7554/elife.57309", "10.1109/tvcg.2017.2744518", "10.1007/s00371-017-1397-2", "10.1109/tvcg.2017.2744258", "10.1111/cgf.13373", "10.1016/0022-5193(68)90079-9", "10.1111/j.1467-8659.2012.03128.x", "10.1145/2897824.2925951", "10.1007/978-3-319-28661-7\\_5", "10.1128/jvi.00645-06", "10.1016/bs.aivir.2016.08.005", "10.1007/978-3-319-50106-2\\_29", "10.1007/978-3-319-50106-2\\_30", "10.1107/s0907444910007493", "10.1093/gigascience/giz064", "10.1007/s11540-006-9010-5", "10.1111/cgf.13640", "10.1109/tvcg.2006.115", "10.1145/3130800.3130804", "10.1016/j.bbamem.2018.02.017", "10.1111/cgf.13816", "10.1021/acs.jctc.9b00453", "10.1016/j.jmgm.2016.07.008", "10.1126/science.abc6952", "10.1007/978-3-319-27261-0\\_16", "10.1007/978-3-319-73915-1\\_29", "10.1146/annurev.bb.06.060177.001055", "10.1002/(sici)1097-0282(199603)38:3", "10.1109/tvcg.2019.2934334", "10.1145/357306.357310", "10.1111/j.1467-8659.2009.01612.x", "10.3238/arztebl.2011.0087", "10.1093/bioinformatics/bty272", "10.1007/978-3-319-07121-35", "10.1107/s0021889883010985", "10.1101/2020.03.25.008904", "10.1126/science.abb9983", "10.1002/jcc.21861", "10.1111/cgf.12197", "10.1145/3197517.3201393", "10.1016/j.tibs.2020.02.010", "10.1007/s13238-016-0352-8", "10.1101/2020.06.26.173476", "10.1145/882262.882291", "10.1109/mcg.2018.2877076", "10.1093/nar/gkh468", "10.1038/nsb1203-980", "10.1007/978-3-319-07121-3\\_5", "10.1093/nar/gky427", "10.1111/cgf.12370", "10.1109/38.310720", "10.1038/nmeth.3204", "10.1109/tvcg.2016.2603178"], "wos": 1, "children": [], "len": 1}], "len": 11}, {"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030415", "title": "Modeling in the Time of COVID-19: Statistical and Rule-based Mesoscale Models", "year": "2020", "conferenceName": "SciVis", "authors": "Ngan Nguyen;Ondrej Strnad;Tobias Klein;Deng Luo;Ruwayda Alharbi;Peter Wonka;Martina Maritan;Peter Mindek;Ludovic Autin;David S. Goodsell;Ivan Viola", "citationCount": "0", "affiliation": "Nguyen, N (Corresponding Author), King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Nguyen, Ngan; Strnad, Ondrej; Luo, Deng; Alharbi, Ruwayda; Wonka, Peter; Viola, Ivan, King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Klein, Tobias; Mindek, Peter, TU Wien, Vienna, Austria. Klein, Tobias; Mindek, Peter, Nanographics GmbH, Vienna, Austria. Maritan, Martina; Autin, Ludovic; Goodsell, David S., Scripps Res Inst, La Jolla, CA 92037 USA.", "countries": "USA;Arabia;Austria", "abstract": "We present a new technique for the rapid modeling and construction of scientifically accurate mesoscale biological models. The resulting 3D models are based on a few 2D microscopy scans and the latest knowledge available about the biological entity, represented as a set of geometric relationships. Our new visual-programming technique is based on statistical and rule-based modeling approaches that are rapid to author, fast to construct, and easy to revise. From a few 2D microscopy scans, we determine the statistical properties of various structural aspects, such as the outer membrane shape, the spatial properties, and the distribution characteristics of the macromolecular elements on the membrane. This information is utilized in the construction of the 3D model. Once all the imaging evidence is incorporated into the model, additional information can be incorporated by interactively defining the rules that spatially characterize the rest of the biological entity, such as mutual interactions among macromolecules, and their distances and orientations relative to other structures. These rules are defined through an intuitive 3D interactive visualization as a visual-programming feedback loop. We demonstrate the applicability of our approach on a use case of the modeling procedure of the SARS-CoV-2 virion ultrastructure. This atomistic model, which we present here, can steer biological research to new promising directions in our efforts to fight the spread of the virus.", "keywords": "molecular visualization,mesoscale modeling", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030415", "refList": ["10.1145/2187836.2187957", "10.1109/tvcg.2009.157", "10.1099/0022-1317-39-3-545", "10.1007/978-3-319-73915-1\\_31", "10.1109/tvcg.2013.158", "10.1016/j.cag.2013.01.010", "10.1109/vast.2009.5333893", "10.1038/s41594-020-0468-7", "10.1145/174462.156635", "10.1038/nmeth.f.301", "10.1038/s41586-020-2008-3", "10.1016/j.jsb.2010.11.021", "10.7554/elife.57309", "10.1109/tvcg.2017.2744518", "10.1007/s00371-017-1397-2", "10.1109/tvcg.2017.2744258", "10.1111/cgf.13373", "10.1016/0022-5193(68)90079-9", "10.1111/j.1467-8659.2012.03128.x", "10.1145/2897824.2925951", "10.1007/978-3-319-28661-7\\_5", "10.1128/jvi.00645-06", "10.1016/bs.aivir.2016.08.005", "10.1007/978-3-319-50106-2\\_29", "10.1007/978-3-319-50106-2\\_30", "10.1107/s0907444910007493", "10.1093/gigascience/giz064", "10.1007/s11540-006-9010-5", "10.1111/cgf.13640", "10.1109/tvcg.2006.115", "10.1145/3130800.3130804", "10.1016/j.bbamem.2018.02.017", "10.1111/cgf.13816", "10.1021/acs.jctc.9b00453", "10.1016/j.jmgm.2016.07.008", "10.1126/science.abc6952", "10.1007/978-3-319-27261-0\\_16", "10.1007/978-3-319-73915-1\\_29", "10.1146/annurev.bb.06.060177.001055", "10.1002/(sici)1097-0282(199603)38:3", "10.1109/tvcg.2019.2934334", "10.1145/357306.357310", "10.1111/j.1467-8659.2009.01612.x", "10.3238/arztebl.2011.0087", "10.1093/bioinformatics/bty272", "10.1007/978-3-319-07121-35", "10.1107/s0021889883010985", "10.1101/2020.03.25.008904", "10.1126/science.abb9983", "10.1002/jcc.21861", "10.1111/cgf.12197", "10.1145/3197517.3201393", "10.1016/j.tibs.2020.02.010", "10.1007/s13238-016-0352-8", "10.1101/2020.06.26.173476", "10.1145/882262.882291", "10.1109/mcg.2018.2877076", "10.1093/nar/gkh468", "10.1038/nsb1203-980", "10.1007/978-3-319-07121-3\\_5", "10.1093/nar/gky427", "10.1111/cgf.12370", "10.1109/38.310720", "10.1038/nmeth.3204", "10.1109/tvcg.2016.2603178"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13426", "year": "2018", "title": "A General Illumination Model for Molecular Visualization", "conferenceName": "EuroVis", "authors": "Pedro Hermosilla;Pere{-}Pau V{\\'{a}}zquez;{\\`{A}}lvar Vinacua;Timo Ropinski", "citationCount": "2", "affiliation": "Hermosilla, P (Corresponding Author), Ulm Univ, Visual Comp Grp, Ulm, Germany.\nHermosilla, P.; Ropinski, T., Ulm Univ, Visual Comp Grp, Ulm, Germany.\nVazquez, P.; Vinacua, A., Univ Politecn Cataluna, VIRVIG Grp, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "Several visual representations have been developed over the years to visualize molecular structures, and to enable a better understanding of their underlying chemical processes. Today, the most frequently used atom-based representations are the Space-filling, the Solvent Excluded Surface, the Balls-and-Sticks, and the Licorice models. While each of these representations has its individual benefits, when applied to large-scale models spatial arrangements can be difficult to interpret when employing current visualization techniques. In the past it has been shown that global illumination techniques improve the perception of molecular visualizations; unfortunately existing approaches are tailored towards a single visual representation. We propose a general illumination model for molecular visualization that is valid for different representations. With our illumination model, it becomes possible, for the first time, to achieve consistent illumination among all atom-based molecular representations. The proposed model can be further evaluated in real-time, as it employs an analytical solution to simulate diffuse light interactions between objects. To be able to derive such a solution for the rather complicated and diverse visual representations, we propose the use of regression analysis together with adapted parameter sampling strategies as well as shape parametrization guided sampling, which are applied to the geometric building blocks of the targeted visual representations. We will discuss the proposed sampling strategies, the derived illumination model, and demonstrate its capabilities when visualizing several dynamic molecules.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13426", "refList": ["10.1109/tvcg.2009.157", "10.1145/2461912.2462009", "10.1111/cgf.12374", "10.2312/spbg/spbg06/059-065", "10.1007/s00371-017-1397-2", "10.1109/tvcg.2006.115", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12627", "10.1002/(sici)1097-0282(199603)38:3", "10.1109/tvcg.2015.2467293", "10.1016/j.visres.2010.09.006", "10.1111/cgf.12349", "10.1111/j.1467-8659.2011.01917.x", "10.1111/j.1467-8659.2009.01693.x", "10.1111/cgf.12197", "10.1109/pacificvis.2012.6183593", "10.1109/icra.2015.7139702", "10.1007/978-90-481-2678-1\\_6", "10.1006/jsbi.1996.0022", "10.1109/biovis.2011.6094043", "10.1111/cgf.12370"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.12892", "year": "2016", "title": "Visibility Equalizer Cutaway Visualization of Mesoscopic Biological Models", "conferenceName": "EuroVis", "authors": "Mathieu Le Muzic;Peter Mindek;Johannes Sorger;Ludovic Autin;David S. Goodsell;Ivan Viola", "citationCount": "8", "affiliation": "Le Muzic, M; Mindek, P (Corresponding Author), TU Wien, Vienna, Austria.\nLe Muzic, M.; Mindek, P.; Sorger, J.; Viola, I., TU Wien, Vienna, Austria.\nSorger, J., VRVis Res Ctr, Vienna, Austria.\nAutin, L.; Goodsell, D. S., Scripps Res Inst, La Jolla, CA 92037 USA.", "countries": "USA;Austria", "abstract": "In scientific illustrations and visualization, cutaway views are often employed as an effective technique for occlusion management in densely packed scenes. We propose a novel method for authoring cutaway illustrations of mesoscopic biological models. In contrast to the existing cutaway algorithms, we take advantage of the specific nature of the biological models. These models consist of thousands of instances with a comparably smaller number of different types. Our method constitutes a two stage process. In the first step, clipping objects are placed in the scene, creating a cutaway visualization of the model. During this process, a hierarchical list of stacked bars inform the user about the instance visibility distribution of each individual molecular type in the scene. In the second step, the visibility of each molecular type is fine-tuned through these bars, which at this point act as interactive visibility equalizers. An evaluation of our technique with domain experts confirmed that our equalizer-based approach for visibility specification is valuable and effective for both, scientific and educational purposes.", "keywords": "", "link": "https://doi.org/10.1111/cgf.12892", "refList": ["10.1109/visual.2004.48", "10.1145/1111411.1111431", "10.2312/vissym/eurovis05/069-076", "10.1109/tvcg.2015.2467961", "10.1111/j.1467-8659.2012.03208.x", "10.1109/tvcg.2011.173", "10.1109/tvcg.2010.35", "10.1111/j.1467-8659.2012.03128.x", "10.1109/tvcg.2005.62", "10.2312/vcbm.20151209", "10.1007/bf01897116", "10.1111/1467-8659.t01-3-00700", "10.1111/j.1467-8659.2011.01930.x", "10.1111/cgf.12197", "10.1109/tvcg.2003.1207438", "10.1109/pacificvis.2012.6183590", "10.1145/2448531.2448537", "10.1111/cgf.12370", "10.1109/tvcg.2006.124", "10.1038/nmeth.3204"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934334", "title": "Scale Trotter: Illustrative Visual Travels Across Negative Scales", "year": "2019", "conferenceName": "SciVis", "authors": "Sarkis Halladjian;Haichao Miao;David Kouril;M. Eduard Gröller;Ivan Viola;Tobias Isenberg", "citationCount": "1", "affiliation": "Halladjian, S (Corresponding Author), INRIA, Paris, France. Halladjian, S (Corresponding Author), Univ Paris Saclay, St Aubin, France. Halladjian, Sarkis; Isenberg, Tobias, INRIA, Paris, France. Halladjian, Sarkis, Univ Paris Saclay, St Aubin, France. Miao, Haichao; Kouril, David; Groller, M. Eduard, TU Wien, Vienna, Austria. Groller, M. Eduard, VRVis Res Ctr, Vienna, Austria. Viola, Ivan, King Abdullah Univ Sci \\& Technol, Thuwal, Saudi Arabia.", "countries": "Arabia;France;Austria", "abstract": "We present ScaleTrotter, a conceptual framework for an interactive, multi-scale visualization of biological mesoscale data and, specifically, genome data. ScaleTrotter allows viewers to smoothly transition from the nucleus of a cell to the atomistic composition of the DNA, while bridging several orders of magnitude in scale. The challenges in creating an interactive visualization of genome data are fundamentally different in several ways from those in other domains like astronomy that require a multi-scale representation as well. First, genome data has intertwined scale levels—the DNA is an extremely long, connected molecule that manifests itself at all scale levels. Second, elements of the DNA do not disappear as one zooms out—instead the scale levels at which they are observed group these elements differently. Third, we have detailed information and thus geometry for the entire dataset and for all scale levels, posing a challenge for interactive visual exploration. Finally, the conceptual scale levels for genome data are close in scale space, requiring us to find ways to visually embed a smaller scale into a coarser one. We address these challenges by creating a new multi-scale visualization concept. We use a scale-dependent camera model that controls the visual embedding of the scales into their respective parents, the rendering of a subset of the scale hierarchy, and the location, size, and scope of the view. In traversing the scales, ScaleTrotter is roaming between 2D and 3D visual representations that are depicted in integrated visuals. We discuss, specifically, how this form of multi-scale visualization follows from the specific characteristics of the genome data and describe its implementation. Finally, we discuss the implications of our work to the general illustrative depiction of multi-scale data.", "keywords": "Multi-scale visualization,scale transition,abstraction,human genome,DNA,Hi-C data", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934334", "refList": ["10.1126/science.291.5507.1177", "10.1038/nrneph.2010.55", "10.1016/j.jmb.2018.06.009", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2017.2743958", "10.1111/j.1467-8659.2012.03128.x", "10.1145/1507149.1507186", "10.1111/j.1467-8659.2012.03082.x", "10.1109/tvcg.2007.2", "10.1145/2024156.2024165", "10.1201/b17511", "10.1038/srep20802", "10.1145/1239451.1239482", "10.1109/mcg.2005.34", "10.1111/cgf.13429", "10.1186/1471-2105-11-444", "10.1109/tvcg.2015.2403323", "10.2312/vcbm.20151209", "10.1109/ldav.2016.7874310", "10.3791/1869", "10.1109/tvcg.2017.2747545", "10.1109/tvcg.2017.2743981", "10.1111/cgf.12892", "10.1126/science.aag0025", "10.1101/gr.213611.116", "10.2312/eurovisshort.20171146", "10.1109/mcg.2008.63", "10.1111/cgf.12349", "10.1017/s0890060411000230", "10.1109/tvcg.2007.70591", "10.1109/infvis.2004.12", "10.1111/cgf.13202", "10.2312/vissym/eurovis05/303-310", "10.1111/cgf.13072", "10.1016/j.jmb.2018.09.004", "10.1111/j.1467-8659.2011.01917.x", "10.1111/cgf.12197", "10.2312/eurovisstar.20151112", "10.1086/344286", "10.1093/nar/gks586", "10.2312/ega.20101005", "10.1186/s13059-018-1486-1", "10.1109/visual.2004.103", "10.1111/j.1467-8659.2009.01692.x", "10.1109/tvcg.2017.2744278", "10.1109/tvcg.2012.159", "10.1109/tvcg.2018.2864507", "10.1038/nrm1225", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030415", "title": "Modeling in the Time of COVID-19: Statistical and Rule-based Mesoscale Models", "year": "2020", "conferenceName": "SciVis", "authors": "Ngan Nguyen;Ondrej Strnad;Tobias Klein;Deng Luo;Ruwayda Alharbi;Peter Wonka;Martina Maritan;Peter Mindek;Ludovic Autin;David S. Goodsell;Ivan Viola", "citationCount": "0", "affiliation": "Nguyen, N (Corresponding Author), King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Nguyen, Ngan; Strnad, Ondrej; Luo, Deng; Alharbi, Ruwayda; Wonka, Peter; Viola, Ivan, King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Klein, Tobias; Mindek, Peter, TU Wien, Vienna, Austria. Klein, Tobias; Mindek, Peter, Nanographics GmbH, Vienna, Austria. Maritan, Martina; Autin, Ludovic; Goodsell, David S., Scripps Res Inst, La Jolla, CA 92037 USA.", "countries": "USA;Arabia;Austria", "abstract": "We present a new technique for the rapid modeling and construction of scientifically accurate mesoscale biological models. The resulting 3D models are based on a few 2D microscopy scans and the latest knowledge available about the biological entity, represented as a set of geometric relationships. Our new visual-programming technique is based on statistical and rule-based modeling approaches that are rapid to author, fast to construct, and easy to revise. From a few 2D microscopy scans, we determine the statistical properties of various structural aspects, such as the outer membrane shape, the spatial properties, and the distribution characteristics of the macromolecular elements on the membrane. This information is utilized in the construction of the 3D model. Once all the imaging evidence is incorporated into the model, additional information can be incorporated by interactively defining the rules that spatially characterize the rest of the biological entity, such as mutual interactions among macromolecules, and their distances and orientations relative to other structures. These rules are defined through an intuitive 3D interactive visualization as a visual-programming feedback loop. We demonstrate the applicability of our approach on a use case of the modeling procedure of the SARS-CoV-2 virion ultrastructure. This atomistic model, which we present here, can steer biological research to new promising directions in our efforts to fight the spread of the virus.", "keywords": "molecular visualization,mesoscale modeling", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030415", "refList": ["10.1145/2187836.2187957", "10.1109/tvcg.2009.157", "10.1099/0022-1317-39-3-545", "10.1007/978-3-319-73915-1\\_31", "10.1109/tvcg.2013.158", "10.1016/j.cag.2013.01.010", "10.1109/vast.2009.5333893", "10.1038/s41594-020-0468-7", "10.1145/174462.156635", "10.1038/nmeth.f.301", "10.1038/s41586-020-2008-3", "10.1016/j.jsb.2010.11.021", "10.7554/elife.57309", "10.1109/tvcg.2017.2744518", "10.1007/s00371-017-1397-2", "10.1109/tvcg.2017.2744258", "10.1111/cgf.13373", "10.1016/0022-5193(68)90079-9", "10.1111/j.1467-8659.2012.03128.x", "10.1145/2897824.2925951", "10.1007/978-3-319-28661-7\\_5", "10.1128/jvi.00645-06", "10.1016/bs.aivir.2016.08.005", "10.1007/978-3-319-50106-2\\_29", "10.1007/978-3-319-50106-2\\_30", "10.1107/s0907444910007493", "10.1093/gigascience/giz064", "10.1007/s11540-006-9010-5", "10.1111/cgf.13640", "10.1109/tvcg.2006.115", "10.1145/3130800.3130804", "10.1016/j.bbamem.2018.02.017", "10.1111/cgf.13816", "10.1021/acs.jctc.9b00453", "10.1016/j.jmgm.2016.07.008", "10.1126/science.abc6952", "10.1007/978-3-319-27261-0\\_16", "10.1007/978-3-319-73915-1\\_29", "10.1146/annurev.bb.06.060177.001055", "10.1002/(sici)1097-0282(199603)38:3", "10.1109/tvcg.2019.2934334", "10.1145/357306.357310", "10.1111/j.1467-8659.2009.01612.x", "10.3238/arztebl.2011.0087", "10.1093/bioinformatics/bty272", "10.1007/978-3-319-07121-35", "10.1107/s0021889883010985", "10.1101/2020.03.25.008904", "10.1126/science.abb9983", "10.1002/jcc.21861", "10.1111/cgf.12197", "10.1145/3197517.3201393", "10.1016/j.tibs.2020.02.010", "10.1007/s13238-016-0352-8", "10.1101/2020.06.26.173476", "10.1145/882262.882291", "10.1109/mcg.2018.2877076", "10.1093/nar/gkh468", "10.1038/nsb1203-980", "10.1007/978-3-319-07121-3\\_5", "10.1093/nar/gky427", "10.1111/cgf.12370", "10.1109/38.310720", "10.1038/nmeth.3204", "10.1109/tvcg.2016.2603178"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/pacificvis.2018.00014", "year": "2018", "title": "Smart Surrogate Widgets for Direct Volume Manipulation", "conferenceName": "PacificVis", "authors": "Sergej Stoppel;Stefan Bruckner", "citationCount": "1", "affiliation": "Stoppel, S (Corresponding Author), Univ Bergen, Bergen, Norway.\nStoppel, Sergej; Bruckner, Stefan, Univ Bergen, Bergen, Norway.", "countries": "Norway", "abstract": "Interaction is an essential aspect in volume visualization, yet common manipulation tools such as bounding boxes or clipping plane widgets provide rather crude tools as they neglect the complex structure of the underlying data. In this paper, we introduce a novel volume interaction approach based on smart widgets that are automatically placed directly into the data in a visibility-driven manner. By adapting to what the user actually sees, they act as proxies that allow for goal-oriented modifications while still providing an intuitive set of simple operations that is easy to control. In particular, our method is well-suited for direct manipulation scenarios such as touch screens, where traditional user interface elements commonly exhibit limited utility. To evaluate out approach we conducted a qualitative user study with nine participants with various backgrounds.", "keywords": "{[}Human-centered computing]: Interaction design process and methods; User interface design", "link": "https://doi.org/10.1109/PacificVis.2018.00014", "refList": ["10.2312/vg/vg-pbg08/041-048", "10.2312/eurovisshort.20141164", "10.1109/tvcg.2008.59", "10.1109/tvcg.2015.2467202", "10.1109/visual.2001.964519", "10.1109/tvcg.2015.2467961", "10.1145/2492684", "10.1109/svv.1998.729584", "10.1109/tvcg.2005.62", "10.1109/2945.942692", "10.1145/1239451.1239482", "10.1109/tvcg.2006.140", "10.1111/cgf.12892", "10.1145/1053427.1053445", "10.1111/j.1467-8659.2012.03083.x", "10.1109/tvcg.2003.1207438", "10.2312/compaesth/compaesth05/209-216", "10.1109/tvcg.2006.152", "10.1016/j.cag.2011.10.006", "10.1109/tvcg.2010.157", "10.1109/tvcg.2006.96", "10.1109/tvcg.2012.292", "10.1145/358669.358692", "10.1109/tvcg.2011.261"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 11}], "len": 115}, "index": 1242, "embedding": [-2.190361261367798, 1.9102314710617065, -1.0404996871948242, -2.2971394062042236, -0.6897369623184204, 0.16650904715061188, 8.068887710571289, 5.059679985046387, 4.016256809234619, 3.0542807579040527, 3.3983380794525146, -0.7734220623970032, -0.1686236411333084, -1.6395978927612305, 5.968244552612305, 1.5872468948364258, -0.24749651551246643, 0.06877747178077698, -0.40280914306640625, 4.518904209136963, -0.06630208343267441, 9.435553550720215, 5.129918575286865, 5.902535915374756, 0.8646028637886047, 11.373394012451172, -0.5834015607833862, -0.21145495772361755, 2.1525111198425293, 2.0886106491088867, 0.4461178481578827, 2.8693439960479736], "projection": [0.7802053093910217, 10.79214096069336], "size": 58, "height": 6, "width": 17}