{"data": {"doi": "10.1111/cgf.12905", "year": "2016", "title": "Using Visualization to Explore Original and Anonymized LBSN Data", "conferenceName": "EuroVis", "authors": "Ebrahim Tarameshloo;M. Hosseinkhani Loorak;Philip W. L. Fong;Sheelagh Carpendale", "citationCount": "4", "affiliation": "Tarameshloo, E (Corresponding Author), Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nTarameshloo, E.; Loorak, M. Hosseinkhani; Fong, P. W. L.; Carpendale, S., Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.", "countries": "Canada", "abstract": "We present GSUVis, a visualization tool designed to provide better understanding of location-based social network (LBSN) data. LBSN data is one of the most important sources of information for transportation, marketing, health, and public safety. LBSN data consumers are interested in accessing and analysing data that is as complete and as accurate as possible. However, LBSN data contains sensitive information about individuals. Consequently, data anonymization is of critical importance if this data is to be made available to consumers. However, anonymization commonly reduces the utility of information available. Working with privacy experts, we designed GSUVis a visual analytic tool to help experts better understand the effects of anonymization techniques on LBSN data utility. One of GSUVis's primary goals is to make it possible for people to use LBSN data, without requiring them to gain deep knowledge about data anonymization. To inform the design of GSUVis, we interviewed privacy experts, and collected their tasks and system requirements. Based on this understanding, we designed and implemented GSUVis. It applies two anonymization algorithms for social and location trajectory data to a real-world LBSN dataset and visualizes the data both before and after anonymization. Through feedback from domain experts, we reflect on the effectiveness of GSUVis and the impact of anonymization using visualization.", "keywords": "", "link": "https://doi.org/10.1111/cgf.12905", "refList": ["10.1109/tvcg.2007.70582", "10.1007/s10115-014-0788-1", "10.1109/vast.2011.6102456", "10.1111/j.1467-8659.2011.01898.x", "10.1145/1376616.1376629", "10.1136/qshc.2004.010033", "10.5311/josis.2014.8.139", "10.1111/cgf.12395", "10.1007/978-1-4419-6045-0\\_14", "10.1145/1066116.1189037", "10.2312/conf/eg2013/stars/039-063", "10.1007/s00779-012-0633-z", "10.1109/infvis.2002.1173155", "10.1145/1749603.1749605", "10.1109/icde.2008.4497446", "10.1109/tvcg.2011.279", "10.1145/2020408.2020579", "10.1109/tnet.2012.2208983", "10.1109/tvcg.2012.265", "10.1007/s00779-008-0212-5", "10.1109/pacificvis.2011.5742384", "10.13140/2.1.1341.1520", "10.1145/2133601.2133637", "10.1109/tvcg.2007.70515", "10.1177/1473871611425872", "10.1109/2945.468391"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2016.2598586", "title": "Exploring the Possibilities of Embedding Heterogeneous Data Attributes in Familiar Visualizations", "year": "2016", "conferenceName": "InfoVis", "authors": "Mona Hosseinkhani Loorak;Charles Perin;Christopher Collins;Sheelagh Carpendale", "citationCount": "10", "affiliation": "Loorak, MH (Corresponding Author), Univ Calgary, Dept Comp Sci, Calgary, AB T2N 1N4, Canada. Loorak, Mona Hosseinkhani; Perin, Charles; Carpendale, Sheelagh, Univ Calgary, Dept Comp Sci, Calgary, AB T2N 1N4, Canada. Collins, Christopher, Univ Ontario, Dept Comp Sci, Oshawa, ON, Canada.", "countries": "Canada", "abstract": "Heterogeneous multi-dimensional data are now sufficiently common that they can be referred to as ubiquitous. The most frequent approach to visualizing these data has been to propose new visualizations for representing these data. These new solutions are often inventive but tend to be unfamiliar. We take a different approach. We explore the possibility of extending well-known and familiar visualizations through including Heterogeneous Embedded Data Attributes (HEDA) in order to make familiar visualizations more powerful. We demonstrate how HEDA is a generic, interactive visualization component that can extend common visualization techniques while respecting the structure of the familiar layout. HEDA is a tabular visualization building block that enables individuals to visually observe, explore, and query their familiar visualizations through manipulation of embedded multivariate data. We describe the design space of HEDA by exploring its application to familiar visualizations in the D3 gallery. We characterize these familiar visualizations by the extent to which HEDA can facilitate data queries based on attribute reordering.", "keywords": "Multi-dimensional data;Hybrid visualization", "link": "http://dx.doi.org/10.1109/TVCG.2016.2598586", "refList": ["10.1109/tvcg.2007.70582", "10.1109/tvcg.2013.76", "10.1109/tvcg.2013.227", "10.1111/j.1467-8659.2011.02087.x", "10.1109/tvcg.2014.2346260", "10.1109/2945.841121", "10.1109/tvcg.2011.185", "10.1109/tvcg.2013.167", "10.1109/tvcg.2013.192", "10.1109/cmv.2007.20", "10.1111/cgf.12395", "10.1109/infvis.2005.1532151", "10.1016/j.csda.2008.09.029", "10.1057/palgrave.ivs.9500072", "10.1214/ss/1177013104", "10.1109/visual.1990.146386", "10.2312/conf/eg2013/stars/039-063", "10.1109/tvcg.2009.122", "10.1109/tvcg.2014.2346279", "10.1109/iv.1999.781570", "10.1007/bf01898350", "10.1109/tvcg.2013.210", "10.1109/tvcg.2011.201", "10.1109/tvcg.2014.2346248", "10.1145/1963192.1963283", "10.1111/cgf.12905", "10.1007/978-3-540-78243-8\\_9", "10.1109/tvcg.2009.179", "10.1109/tvcg.2010.205", "10.1109/tvcg.2015.2467325", "10.1109/tvcg.2011.186", "10.2307/2284077", "10.1111/j.1467-8659.2009.01687.x", "10.1109/infvis.2005.1532129", "10.2307/2288711", "10.2312/vissym/eurovis05/053-060", "10.1109/38.310723", "10.1109/tvcg.2015.2413786"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2017.2744019", "title": "VisTiles: Coordinating and Combining Co-located Mobile Devices for Visual Data Exploration", "year": "2017", "conferenceName": "InfoVis", "authors": "Ricardo Langner;Tom Horak;Raimund Dachselt", "citationCount": "9", "affiliation": "Langner, R (Corresponding Author), Tech Univ Dresden, Interact Media Lab, Dresden, Germany. Langner, Ricardo; Horak, Tom; Dachselt, Raimund, Tech Univ Dresden, Interact Media Lab, Dresden, Germany.", "countries": "Germany", "abstract": "We present VisTiles, a conceptual framework that uses a set of mobile devices to distribute and coordinate visualization views for the exploration of multivariate data. In contrast to desktop-based interfaces for information visualization, mobile devices offer the potential to provide a dynamic and user-defined interface supporting co-located collaborative data exploration with different individual workflows. As part of our framework, we contribute concepts that enable users to interact with coordinated &amp; multiple views (CMV) that are distributed across several mobile devices. The major components of the framework are: (i) dynamic and flexible layouts for CMV focusing on the distribution of views and (ii) an interaction concept for smart adaptations and combinations of visualizations utilizing explicit side-by-side arrangements of devices. As a result, users can benefit from the possibility to combine devices and organize them in meaningful spatial layouts. Furthermore, we present a web-based prototype implementation as a specific instance of our concepts. This implementation provides a practical application case enabling users to explore a multivariate data collection. We also illustrate the design process including feedback from a preliminary user study, which informed the design of both the concepts and the final prototype.", "keywords": "Mobile devices,coordinated & multiple views,multi-display environment,cross-device interaction", "link": "http://dx.doi.org/10.1109/TVCG.2017.2744019", "refList": ["10.1109/mcg.2014.82", "10.1111/j.1467-8659.2009.01444.x", "10.1145/1936652.1936684", "10.1177/1473871611416549", "10.1145/1357054.1357245", "10.1145/1085777.1085799", "10.1007/978-3-319-22698-9\\_29", "10.1109/tvcg.2012.237", "10.1145/2669485.2669518", "10.1177/1473871611413180", "10.1109/tvcg.2007.70515", "10.1177/1473871611412817", "10.1109/vl.1996.545307", "10.1145/1978942.1979201", "10.1109/tvcg.2014.2346573", "10.1145/2396636.2396642", "10.1109/52.329404", "10.1145/2807442.2807475", "10.1109/cmv.2007.20", "10.1111/cgf.12013", "10.1145/2639189.2639237", "10.1117/12.2040011", "10.1145/2470654.2481318", "10.1109/tvcg.2016.2598586", "10.1109/tvcg.2009.162", "10.1145/2669485.2669500", "10.1145/2556288.2557028", "10.1109/rev.2016.7444433", "10.1145/2669485.2669526", "10.1111/cgf.12902", "10.1145/2393347.2393372", "10.1109/vast.2015.7347628", "10.1109/mc.2006.109", "10.1145/2598153.2598170", "10.1145/964696.964713", "10.1145/1226969.1226984", "10.1145/2702123.2702287", "10.1111/cgf.13206", "10.1145/2702613.2732909", "10.1016/0004-3702(94)00017-u", "10.1145/2598153.2598163", "10.1145/2491568.2491578", "10.1145/2525194.2525205", "10.1177/1473871612441874", "10.1109/pacificvis.2012.6183556", "10.1145/2785830.2785871", "10.1109/tvcg.2012.204", "10.1145/2396636.2396675", "10.1007/978-3-642-34292-9\\_23", "10.1145/1226969", "10.1145/2556288.2557170", "10.1145/2992154.2992157", "10.1145/2406367.2406397", "10.1109/tvcg.2007.70568"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2865144", "title": "Vistrates: A Component Model for Ubiquitous Analytics", "year": "2018", "conferenceName": "InfoVis", "authors": "Sriram Karthik Badam;Andreas Mathisen;Roman Rädle;Clemens Nylandsted Klokmose;Niklas Elmqvist", "citationCount": "6", "affiliation": "Badam, SK (Corresponding Author), Univ Maryland, College Pk, MD 20742 USA. Badam, Sriram Karthik; Elmqvist, Niklas, Univ Maryland, College Pk, MD 20742 USA. Mathisen, Andreas; Radle, Roman; Klokmose, Clemens N., Aarhus Univ, Aarhus, Denmark.", "countries": "USA;Denmark", "abstract": "Visualization tools are often specialized for specific tasks, which turns the user's analytical workflow into a fragmented process performed across many tools. In this paper, we present a component model design for data visualization to promote modular designs of visualization tools that enhance their analytical scope. Rather than fragmenting tasks across tools, the component model supports unification, where components-the building blocks of this model-can be assembled to support a wide range of tasks. Furthermore, the model also provides additional key properties, such as support for collaboration, sharing across multiple devices, and adaptive usage depending on expertise, from creating visualizations using dropdown menus, through instantiating components, to actually modifying components or creating entirely new ones from scratch using JavaScript or Python source code. To realize our model, we introduce Vistrates, a literate computing platform for developing, assembling, and sharing visualization components. From a visualization perspective, Vistrates features cross-cutting components for visual representations, interaction, collaboration, and device responsiveness maintained in a component repository. From a development perspective, Vistrates offers a collaborative programming environment where novices and experts alike can compose component pipelines for specific analytical activities. Finally, we present several Vistrates use cases that span the full range of the classic “anytime” and “anywhere” motto for ubiquitous analysis: from mobile and on-the-go usage, through office settings, to collaborative smart environments covering a variety of tasks and devices..", "keywords": "Components,literate computing,development,exploration,dissemination,collaboration,heterogeneous devices", "link": "http://dx.doi.org/10.1109/TVCG.2018.2865144", "refList": ["10.1109/tvcg.2016.2598647", "10.1109/tvcg.2008.137", "10.1111/j.1467-8659.2009.01444.x", "10.1109/mcg.2014.82", "10.1109/infvis.2000.885092", "10.1038/scientificamerican0991-94", "10.1109/tvcg.2017", "10.1145/2642918.2647360", "10.1111/cgf.12129", "10.1109/infvis.2000.885086", "10.1016/0020-7373(91)90039-a", "10.1145/2858036.2858435", "10.1145/3125571.3125602", "10.1145/2669485.2669518", "10.1109/tvcg.2011.185", "10.1145/3173574.3173593", "10.1109/tvcg.2017.2744019", "10.1177/1473871611412817", "10.1109/mcse.2007.53", "10.20380/gi2015.16", "10.1111/cgf.12392", "10.1108/eb026526", "10.1136/qshc.2004.010033", "10.1109/tvcg.2014.2346573", "10.1057/palgrave.ivs.9500167", "10.1109/tvcg.2017.2745278", "10.1109/cmv.2007.20", "10.1145/2807442.2807446", "10.1145/1118178.1118215", "10.1145/989863.989865", "10.1109/tvcg.2009.162", "10.1145/2858036.2858387", "10.1177/1473871617725907", "10.1109/tvcg.2013.200", "10.1109/tvcg.2013.197", "10.1145/27636.28056", "10.1109/tvcg.2017.2743990", "10.1145/3173574.3173973", "10.1007/s00779-013-0727-2", "10.1177/1473871617752910", "10.1111/cgf.13206", "10.2312/eurp.20171182", "10.1109/tvcg.2007.70589", "10.1109/tvcg.2007.70577", "10.1145/3170427.3188563", "10.1145/3126594.3126642", "10.1109/tvcg.2014.2346291", "10.1038/515151a", "10.1145/2396636.2396673", "10.1109/tvcg.2009.174", "10.1109/tvcg.2014.2337337", "10.1177/1473871612441874", "10.1109/tvcg.2013.191", "10.1109/mc.2013.147", "10.1109/tvcg.2012.204", "10.1145/3173574.3173697", "10.1109/tvcg.2017.2785807", "10.1109/tvcg.2014.2346574", "10.1145/3173574.3173797", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3028948", "title": "A Generic Framework and Library for Exploration of Small Multiples through Interactive Piling", "year": "2020", "conferenceName": "InfoVis", "authors": "Fritz Lekschas;Xinyi Zhou;Wei Chen;Nils Gehlenborg;Benjamin Bach;Hanspeter Pfister", "citationCount": "0", "affiliation": "Lekschas, F (Corresponding Author), Harvard Sch Engn \\& Appl Sci, Cambridge, MA 02138 USA. Lekschas, Fritz; Pfister, Hanspeter, Harvard Sch Engn \\& Appl Sci, Cambridge, MA 02138 USA. Zhou, Xinyi; Chen, Wei, Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Peoples R China. Bach, Benjamin, Univ Edinburgh, Edinburgh, Midlothian, Scotland. Gehlenborg, Nils, Harvard Med Sch, Boston, MA 02115 USA.", "countries": "Scotland;China;USA", "abstract": "Small multiples are miniature representations of visual information used generically across many domains. Handling large numbers of small multiples imposes challenges on many analytic tasks like inspection, comparison, navigation, or annotation. To address these challenges, we developed a framework and implemented a library called PILlNG.JS for designing interactive piling interfaces. Based on the piling metaphor, such interfaces afford flexible organization, exploration, and comparison of large numbers of small multiples by interactively aggregating visual objects into piles. Based on a systematic analysis of previous work, we present a structured design space to guide the design of visual piling interfaces. To enable designers to efficiently build their own visual piling interfaces, PILlNG.JS provides a declarative interface to avoid having to write low-level code and implements common aspects of the design space. An accompanying GUI additionally supports the dynamic configuration of the piling interface. We demonstrate the expressiveness of PILlNG.JS with examples from machine learning, immunofluorescence microscopy, genomics, and public health.", "keywords": "Information visualization,small multiples,interactive piling,visual aggregation,spatial organization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028948", "refList": ["10.1007/978-3-030-01388-28", "10.1111/j.1467-8659.2009.01444.x", "10.1145/3300961", "10.1145/289444.289469", "10.1109/3pgcic.2010.36", "10.1145/279227.279229", "10.1007/bf01782772", "10.1109/tvcg.2011.185", "10.1109/bigdata", "10.1145/142750.142828", "10.1109/tvcg.2017.2744019", "10.1177/1473871611412817", "10.1145/1518701.1518886", "10.2337/9781580404587", "10.1109/tvcg.2018.2865076", "10.1145/67544.66963", "10.1109/cmv.2007.20", "10.1145/2807442.2807446", "10.19173/irrodl.v9i3.523", "10.1002/(sici)1097-024x(199909)29:11", "10.5555/1973430.1973449", "10.1109/2.809253", "10.1145/97945.97975", "10.1109/tvcg", "10.1109/tvcg.2009.188", "10.1109/tse.1977.229904", "10.1109/bigdata.2014.7004282", "10.1108/09684880210416102", "10.1109/iv.2011.44", "10.1109/2.299409", "10.1145/1936652.1936694", "10.1109/vast", "10.1109/pvgs.1999.810138", "10.1111/j.1467-8659.2004.00754.x", "10.1109/tvcg.2007.70568", "10.1109/tvcg.2018.2865144"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13717", "year": "2019", "title": "InsideInsights: Integrating Data-Driven Reporting in Collaborative Visual Analytics", "conferenceName": "EuroVis", "authors": "Andreas Mathisen;Tom Horak;Clemens Nylandsted Klokmose;Kaj Gr{\\o}nb{\\ae}k;Niklas Elmqvist", "citationCount": "2", "affiliation": "Mathisen, A (Corresponding Author), Aarhus Univ, Dept Comp Sci, Aarhus, Denmark.\nMathisen, A.; Grdnbaek, K., Aarhus Univ, Dept Comp Sci, Aarhus, Denmark.\nHorak, T., Tech Univ Dresden, Interact Media Lab, Dresden, Germany.\nKlokmose, C. N., Aarhus Univ, Dept Digital Design \\& Informat Studies, Aarhus, Denmark.\nElmqvist, N., Univ Maryland, Coll Informat Studies, College Pk, MD 20742 USA.", "countries": "Germany;USA;Denmark", "abstract": "Analyzing complex data is a non-linear process that alternates between identifying discrete facts and developing overall assessments and conclusions. In addition, data analysis rarely occurs in solitude; multiple collaborators can be engaged in the same analysis, or intermediate results can be reported to stakeholders. However, current data-driven communication tools are detached from the analysis process and promote linear stories that forego the hierarchical and branching nature of data analysis, which leads to either too much or too little detail in the final report. We propose a conceptual design for integrated data-driven reporting that allows for iterative structuring of insights into hierarchies linked to analytic provenance and chosen analysis views. The hierarchies become dynamic and interactive reports where collaborators can review and modify the analysis at a desired level of detail. Our web-based InsideInsights system provides interaction techniques to annotate states of analytic components, structure annotations, and link them to appropriate presentation views. We demonstrate the generality and usefulness of our system with two use cases and a qualitative expert review.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13717", "refList": ["10.1016/j.intcom.2009.07.001", "10.1145/2642918.2647360", "10.1186/s13059-017-1205-3", "10.1145/3173574.3173606", "10.1145/2854946.2854958", "10.1109/visual.2005.1532788", "10.1145/2858036.2858435", "10.1007/978-3-540-70956-5\\_2", "10.1109/mcg.2005.102", "10.20380/gi2015.16", "10.1145/381641.381653", "10.1111/cgf.12392", "10.3233/978-1-61499-649-1-87", "10.1109/tvcg.2012.219", "10.1109/tvcg.2014.2346573", "10.1057/palgrave.ivs.9500167", "10.1145/2858036.2858529", "10.1145/2807442.2807446", "10.1109/visual.1993.398857", "10.1111/cgf.12925", "10.1057/ivs.2008.31", "10.1109/tvcg.2017.2723393", "10.1109/tvcg.2015.2467551", "10.1109/mcg.2015.99", "10.1147/sj.454.0801", "10.1109/tvcg.2013.119", "10.1093/comjnl/27.2.97", "10.1109/tvcg.2017.2743990", "10.1145/3173574.3173973", "10.1145/3242587.3242600", "10.1145/3025453.3025626", "10.1145/3290605.3300272", "10.1109/tvcg.2007.70577", "10.1145/3170427.3188563", "10.1145/3126594.3126642", "10.1007/s00146-010-0272-8", "10.1038/515151a", "10.1002/meet.2008.1450450234", "10.1109/tvcg.2017.2745279", "10.1109/mcg.2006.70", "10.1145/3173574.3173748", "10.1109/tvcg.2015.2467191", "10.1145/1435417.1435439", "10.1109/tvcg.2010.179", "10.1109/vds.2017.8573439", "10.1109/tvcg.2011.255", "10.1145/3274419", "10.1145/989863.989880", "10.1109/tvcg.2018.2864836", "10.1109/tvcg.2016.2599030", "10.1145/1376616.1376772", "10.1109/tvcg.2018.2865144"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030438", "title": "ChemVA: Interactive Visual Analysis of Chemical Compound Similarity in Virtual Screening", "year": "2020", "conferenceName": "SciVis", "authors": "María Virginia Sabando;Pavol Ulbrich;Matías N. Selzer;Jan Byska;Jan Mican;Ignacio Ponzoni;Axel J. Soto;Maria Luján Ganuza;Barbora Kozlíková", "citationCount": "0", "affiliation": "Sabando, MV (Corresponding Author), Univ Nacl Sur, Inst Comp Sci \\& Engn UNS CONICET, Bahia Blanca, Buenos Aires, Argentina. Sabando, MV (Corresponding Author), Univ Nacl Sur, Dept Comp Sci \\& Engn, Bahia Blanca, Buenos Aires, Argentina. Sabando, Maria Virginia; Selzer, Matias; Ponzoni, Ignacio; Soto, Axel J.; Ganuza, Maria Lujan, Univ Nacl Sur, Inst Comp Sci \\& Engn UNS CONICET, Bahia Blanca, Buenos Aires, Argentina. Sabando, Maria Virginia; Ponzoni, Ignacio; Soto, Axel J., Univ Nacl Sur, Dept Comp Sci \\& Engn, Bahia Blanca, Buenos Aires, Argentina. Ulbrich, Pavol; Byska, Jan; Kozlikova, Barbora, Masaryk Univ, Fac Informat, Visitlab, Brno, Czech Republic. Selzer, Matias; Ganuza, Maria Lujan, Univ Nacl Sur, VyGLab Res Lab UNS CICPBA, Dept Comp Sci \\& Engn, Bahia Blanca, Buenos Aires, Argentina. Mican, Jan, Masaryk Univ, Dept Expt Biol, Loschmidt Labs, Brno, Czech Republic. Mican, Jan, Masaryk Univ, RECETOX, Brno, Czech Republic. Mican, Jan, Masaryk Univ, Fac Med, Brno, Czech Republic.", "countries": "Argentina;Republic", "abstract": "In the modern drug discovery process, medicinal chemists deal with the complexity of analysis of large ensembles of candidate molecules. Computational tools, such as dimensionality reduction (DR) and classification, are commonly used to efficiently process the multidimensional space of features. These underlying calculations often hinder interpretability of results and prevent experts from assessing the impact of individual molecular features on the resulting representations. To provide a solution for scrutinizing such complex data, we introduce ChemVA, an interactive application for the visual exploration of large molecular ensembles and their features. Our tool consists of multiple coordinated views: Hexagonal view, Detail view, 3D view, Table view, and a newly proposed Difference view designed for the comparison of DR projections. These views display DR projections combined with biological activity, selected molecular features, and confidence scores for each of these projections. This conjunction of views allows the user to drill down through the dataset and to efficiently select candidate compounds. Our approach was evaluated on two case studies of finding structurally similar ligands with similar binding affinity to a target protein, as well as on an external qualitative evaluation. The results suggest that our system allows effective visual inspection and comparison of different high-dimensional molecular representations. Furthermore, ChemVA assists in the identification of candidate compounds while providing information on the certainty behind different molecular representations.", "keywords": "Virtual screening,visual analysis,dimensionality reduction,coordinated views,cheminformatics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030438", "refList": ["10.1109/tvcg.2008.137", "10.1057/ivs.2009.10", "10.2312/eurovisstar.20151110", "10.1109/eisic.2015.35", "10.1109/pacificvis.2014.44", "10.1145/1142473.1142574", "10.1109/tvcg.2013.223", "10.1109/tvcg.2014.2346573", "10.1109/tvcg.2019.2934539", "10.1111/cgf.13717", "10.1109/vizsec.2009.5375536", "10.1111/cgf.12925", "10.1109/tvcg.2015.2467551", "10.1109/mcg.2015.99", "10.1007/978-3-319", "10.1109/tvcg.2012.255", "10.1145/1064830.1064834", "10.1177/1473871611433713", "10.1207/s1532690xci0804\\_2", "10.1145/1168149.1168168", "10.1016/j.chb.2006.10.002", "10.1109/tvcg.2014.2346441", "10.1109/eisic.2017.15", "10.1111/1467-8721.00160", "10.1109/tvcg.2018.2865024", "10.1109/infvis.2004.2"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13997", "year": "2020", "title": "Resolving Conflicting Insights in Asynchronous Collaborative Visual Analysis", "conferenceName": "EuroVis", "authors": "Jianping Kelvin Li;Shenyu Xu;Yecong (Chris) Ye;Kwan{-}Liu Ma", "citationCount": "0", "affiliation": "Li, JK (Corresponding Author), Univ Calif Davis, Davis, CA 95616 USA.\nLi, Jianping Kelvin; Xu, Shenyu; Ye, Yecong (Chris); Ma, Kwan-Liu, Univ Calif Davis, Davis, CA 95616 USA.", "countries": "USA", "abstract": "Analyzing large and complex datasets for critical decision making can benefit from a collective effort involving a team of analysts. However, insights and findings from different analysts are often incomplete, disconnected, or even conflicting. Most existing analysis tools lack proper support for examining and resolving the conflicts among the findings in order to consolidate the results of collaborative data analysis. In this paper, we present CoVA, a visual analytics system incorporating conflict detection and resolution for supporting asynchronous collaborative data analysis. By using a declarative visualization language and graph representation for managing insights and insight provenance, CoVA effectively leverages distributed revision control workflow from software engineering to automatically detect and properly resolve conflicts in collaborative analysis results. In addition, CoVA provides an effective visual interface for resolving conflicts as well as combining the analysis results. We conduct a user study to evaluate CoVA for collaborative data analysis. The results show that CoVA allows better understanding and use of the findings from different analysts.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13997", "refList": ["10.1109/vast.2010.5652880", "10.1145/2642918.2647360", "10.1109/cluster.2017.26", "10.1145/1142473.1142574", "10.1109/vast.2011.6102438", "10.1145/2872332", "10.1145/2669485.2669518", "10.1177/1473871611412817", "10.1109/ms.2012.61", "10.3233/978-1-61499-649-1-87", "10.1109/tvcg.2014.2346573", "10.1057/palgrave.ivs.9500167", "10.1109/pacificvis.2009.4906837", "10.1109/visual.1993.398857", "10.1145/2207676.2208293", "10.1145/381641.381656", "10.1111/cgf.13717", "10.1111/cgf.13402", "10.1057/palgrave.ivs.9500131", "10.1109/vast.2011.6102447", "10.1109/tvcg.2015.2467551", "10.1109/vast.2008.4677358", "10.1177/104973239300300403", "10.1007/978-1-4419-5874-7\\_12", "10.1109/tst.2013.6509100", "10.1109/vast.2014.7042526", "10.1016/s0950-7051(00)00101-5", "10.1109/tvcg.2015.2467091", "10.1109/vast.2010.5652885", "10.1145/3126594.3126642", "10.1109/tvcg.2006.65", "10.1057/palgrave.ivs.9500180", "10.1109/vast.2008.4677365", "10.1109/vast.2009.5333878", "10.1109/tvcg.2016.2598543", "10.1145/1979742.1979570", "10.1109/tvcg.2003.1207445", "10.1109/mcg.2015.50", "10.1080/09546550701246817", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.14035", "year": "2020", "title": "Survey on the Analysis of User Interactions and Visualization Provenance", "conferenceName": "EuroVis", "authors": "Kai Xu;Alvitta Ottley;Conny Walchshofer;Marc Streit;Remco Chang;John E. Wenskovitch", "citationCount": "0", "affiliation": "Xu, K (Corresponding Author), Middlesex Univ, London, England.\nXu, Kai, Middlesex Univ, London, England.\nOttley, Alvitta, Washington Univ, St Louis, MO 63110 USA.\nWalchshofer, Conny; Streit, Marc, Johannes Kepler Univ Linz, Linz, Austria.\nChang, Remco, Tufts Univ, Medford, MA 02155 USA.\nWenskovitch, John, Virginia Tech, Blacksburg, VA USA.", "countries": "USA;England;Austria", "abstract": "There is fast-growing literature on provenance-related research, covering aspects such as its theoretical framework, use cases, and techniques for capturing, visualizing, and analyzing provenance data. As a result, there is an increasing need to identify and taxonomize the existing scholarship. Such an organization of the research landscape will provide a complete picture of the current state of inquiry and identify knowledge gaps or possible avenues for further investigation. In this STAR, we aim to produce a comprehensive survey of work in the data visualization and visual analytics field that focus on the analysis of user interaction and provenance data. We structure our survey around three primary questions: (1) WHY analyze provenance data, (2) WHAT provenance data to encode and how to encode it, and (3) HOW to analyze provenance data. A concluding discussion provides evidence-based guidelines and highlights concrete opportunities for future development in this emerging area. The survey and papers discussed can be explored online interactively at https://provenance-survey.caleydo.org.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14035", "refList": ["10.1145/3186266", "10.1145/3185524", "10.1109/tvcg.2014.2346575", "10.1109/tvcg.2016.2598471", "10.1109/tvcg.2016.2598446", "10.1145/2856767.2856779", "10.1109/tvcg.2017.2745278", "10.1109/tvcg.2015.2467871", "10.1109/tvcg.2019.2934668", "10.1145/3301275.3302307", "10.1145/2207676.2208293", "10.1111/cgf.13402", "10.1111/cgf.12895", "10.1145/1084805.1084812", "10.1145/2983923", "10.1007/978-1-4419-5874-7\\_12", "10.1109/mcg.2010.18", "10.1109/tvcg.2015.2467153", "10.1109/tvcg.2013.211", "10.1145/3172944.3172964", "10.1145/3290605.3300360", "10.1109/tvcg.2009.199", "10.1109/vast.2016.7883515", "10.1145/2207676.2208412", "10.1145/1979742.1979570", "10.1145/2207676.2208565", "10.1109/tvcg.2017.2745078", "10.1109/tvcg.2013.226", "10.1145/3301275.3302270", "10.1145/2882903.2882919", "10.1109/tvcg.2013.132", "10.1007/978-1-4614-3223-4\\_6", "10.1007/978-1-4899-7993-3\\_80747-1", "10.1145/2449396.2449439", "10.4230/dagrep.8.11.35", "10.1111/cgf.13424", "10.1109/tvcg.2015.2467613", "10.1109/mcse.2007.106", "10.1109/vast.2014.7042486", "10.1145/3126594.3126653", "10.1145/2591510", "10.1109/vast.2017.8585665", "10.1109/tvcg.2017.2744684", "10.1109/vast.2009.5333564", "10.1111/cgf.12631", "10.1145/2702123.2702262", "10.1111/cgf.13717", "10.2312/evs.20191181", "10.1111/cgf.12925", "10.1145/2702123.2702590", "10.1109/tvcg.2015.2467551", "10.1145/3025171.3025187", "10.1145/3316416.3316418", "10.1109/tvcg.2015.2468078", "10.1109/mcg.2014.73", "10.1109/tvcg.2017.2744479", "10.1109/tvcg.2018.2859969", "10.1109/tvcg.2014.2346321", "10.1109/tvcg.2007.70589", "10.1007/s13218-012-0167-6", "10.1111/cgf.13670", "10.1145/2807442.2807478", "10.1111/cgf.13715", "10.1109/tvcg.2012.23", "10.1109/tvcg.2017.2745279", "10.1109/tvcg.2013.164", "10.1109/vast.2008.4677365", "10.1145/3301275.3302291", "10.1109/tvcg.2012.260", "10.1109/tvcg.2010.177", "10.1109/tvcg.2018.2865024", "10.1109/mcg.2015.51", "10.1145/2240236.2240260", "10.1109/tvcg.2016.2599030.2", "10.1109/tvcg.2007.70515", "10.1109/tvcg.2012.175", "10.1109/mcg.2019.2941856", "10.1109/tvcg.2008.137", "10.1016/j.visinf.2018.09.003", "10.4304/jmm.9.5.635-643", "10.1109/tvcg.2017.2744843", "10.1111/cgf.13405", "10.1145/2633043", "10.1109/tvcg.2009.129", "10.1109/tvcg.2019.2934609", "10.1111/cgf.12924", "10.1145/2702123.2702376", "10.1109/vast.2017.8585669", "10.1145/1502650.1502695", "10.1111/cgf.13730", "10.1109/tvcg.2013.124", "10.1109/tvcg.2017.2744805", "10.1109/mcg.2009.49", "10.1109/vast.2015.7347625", "10.1145/3009973", "10.1145/2470654.2470723", "10.1109/vast.2016.7883520", "10.1109/vast.2014.7042492", "10.1145/2984511.2984588", "10.1111/cgf.12391", "10.1561/1900000006", "10.1007/s00778-017-0486-1", "10.1109/vast.2009.5333020", "10.1145/1926385.1926423", "10.1145/1057977.1057978", "10.1145/3290605.3300892", "10.1111/j.1467-8659.2011.01928.x", "10.1109/tvcg.2013.188", "10.1109/tvcg.2015.2467191", "10.1109/iccicct.2014.6993023", "10.1145/3290605.3300874", "10.1145/2557500.2557524", "10.1109/mcg.2015.91", "10.1109/vast.2012.6400494", "10.1109/tvcg.2013.220", "10.1109/mcg.2019.2945378", "10.1109/vast.2012.6400486", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2016.2598839", "10.1145/1142473.1142574", "10.1177/1555343416672782", "10.1109/vast.2011.6102449", "10.1111/cgf.12090", "10.1109/vast.2016.7883518", "10.1111/cgf.13678", "10.1109/mcg.2009.53", "10.1109/tvcg.2014.2346250", "10.1109/tvcg.2016.2598797", "10.1111/cgf.13400", "10.1109/tvcg.2014.2346573", "10.1080/01431160600746456", "10.1145/2642918.2647378", "10.1109/mcg.2019.2945720", "10.1145/2207676.2207741", "10.1145/3025171.3025189", "10.1145/634067.634292", "10.1109/tvcg.2015.2467611", "10.1109/tit.1982.1056489", "10.1109/tvcg.2018.2865117", "10.1109/vast.2009.5333023", "10.1145/3332165.3347866", "10.1109/mcg.2019.2933419", "10.1145/3184900", "10.1109/tvcg.2012.273", "10.1109/vast.2010.5652885", "10.1109/vast.2015.7347627", "10.1145/3290605.3300803", "10.1109/tvcg.2012.258", "10.1109/mcg.2009.87", "10.1109/tvcg.2019.2934556", "10.1145/1869397.1869399", "10.1109/mcg.2015.50", "10.1145/3172944.3172979", "10.1111/cgf.13208", "10.1111/cgf.12619", "10.1145/3290605.3300358", "10.1109/vast.2008.4677352", "10.1109/tvcg.2016.2598468", "10.1109/vast.2016.7883519", "10.1109/mcse.2008.79"], "wos": 1, "children": [], "len": 1}], "len": 7}], "len": 11}, {"doi": "10.1109/tvcg.2018.2865235", "title": "Multiple Coordinated Views at Large Displays for Multiple Users: Empirical Findings on User Behavior, Movements, and Distances", "year": "2018", "conferenceName": "InfoVis", "authors": "Ricardo Langner;Ulrike Kister;Raimund Dachselt", "citationCount": "5", "affiliation": "Langner, R (Corresponding Author), Tech Univ Dresden, Interact Media Lab, Dresden, Germany. Langner, Ricardo; Kister, Ulrike; Dachselt, Raimund, Tech Univ Dresden, Interact Media Lab, Dresden, Germany.", "countries": "Germany", "abstract": "Interactive wall-sized displays benefit data visualization. Due to their sheer display size, they make it possible to show large amounts of data in multiple coordinated views (MCV) and facilitate collaborative data analysis. In this work, we propose a set of important design considerations and contribute a fundamental input vocabulary and interaction mapping for MCV functionality. We also developed a fully functional application with more than 45 coordinated views visualizing a real-world, multivariate data set of crime activities, which we used in a comprehensive qualitative user study investigating how pairs of users behave. Most importantly, we found that flexible movement is essential and-depending on user goals-is connected to collaboration, perception, and interaction. Therefore, we argue that for future systems interaction from the distance is required and needs good support. We show that our consistent design for both direct touch at the large display and distant interaction using mobile phones enables the seamless exploration of large-scale MCV at wall-sized displays. Our MCV application builds on design aspects such as simplicity, flexibility, and visual consistency and, therefore, supports realistic workflows. We believe that in the future, many visual data analysis scenarios will benefit from wall-sized displays presenting numerous coordinated visualizations, for which our findings provide a valuable foundation.", "keywords": "Multiple coordinated views,wall-sized displays,mobile devices,distant interaction,physical navigation,user behavior,user movements,multi-user,collaborative data analysis", "link": "http://dx.doi.org/10.1109/TVCG.2018.2865235", "refList": ["10.1109/mcg.2014.82", "10.1111/j.1467-8659.2009.01444.x", "10.1016/j.cag.2007.01.029", "10.1109/vast.2010.5652880", "10.1109/tvcg.2013.166", "10.1145/3025453.3025594", "10.1109/tvcg.2012.275", "10.1145/2254556.2254652", "10.1145/1866029.1866034", "10.1145/1099203.1099209", "10.1145/2470654.2470695", "10.1109/tvcg.2017.2744019", "10.1109/tvcg.2012.237", "10.1145/3173574.3173593", "10.1109/tvcg.2013.134", "10.1109/vast.2016.7883506", "10.1145/2817721.2817735", "10.1145/2317956.2318025", "10.1111/cgf.12871", "10.1109/tvcg.2017.2744198", "10.1145/3025453.3026006", "10.1109/cmv.2007.20", "10.1145/2470654.2481318", "10.1145/2598153.2598195", "10.1109/tvcg.2009.162", "10.1145/3173574.3173747", "10.1145/2576099", "10.1145/2207676.2208691", "10.1145/2858036.2858039", "10.1145/2556288.2557231", "10.1145/2556288.2556956", "10.1109/tvcg.2017.2745219", "10.1177/1473871617725907", "10.1145/2557500.2557541", "10.1007/978-3-319-22698-9\\_31", "10.1145/2785830.2785849", "10.1145/2207676.2208690", "10.1007/s00779-013-0727-2", "10.1109/tvcg.2016.2592906", "10.1111/cgf.13206", "10.1145/2207676.2208639", "10.1145/2817721.2817726", "10.1145/2556288.2557020", "10.1145/2598153.2598163", "10.1145/2254556.2254708", "10.1145/2669485.2669507", "10.1109/tvcg.2006.184", "10.1109/tvcg.2017.2743859", "10.1109/tvcg.2012.204", "10.1145/2207676.2208297", "10.1145/1897239.1897250", "10.1145/2858036.2858118", "10.1145/2396636.2396675", "10.1145/1731903.1731926", "10.1145/2702123.2702406", "10.1109/tvcg.2012.251", "10.1145/2702123.2702312", "10.1145/1936652.1936693", "10.1177/1473871611415997", "10.1145/2556288.2557170", "10.1145/2992154.2992157", "10.1145/3206505.3206506", "10.1007/978-3-319-45853-3\\_5"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030338", "title": "Composition and Configuration Patterns in Multiple-View Visualizations", "year": "2020", "conferenceName": "InfoVis", "authors": "Xi Chen;Wei Zeng 0004;Yanna Lin;Hayder Al-Maneea;Jonathan Roberts 0002;Remco Chang", "citationCount": "0", "affiliation": "Zeng, W (Corresponding Author), Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. Chen, Xi; Zeng, Wei; Lin, Yanna, Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. AI-maneea, Hayder Mahdi; Roberts, Jonathan, Bangor Univ, Bangor, Gwynedd, Wales. Chang, Remco, Tufts Univ, Medford, MA 02155 USA.", "countries": "USA;Wales;China", "abstract": "Multiple-view visualization (MV) is a layout design technique often employed to help users see a large number of data attributes and values in a single cohesive representation. Because of its generalizability, the MV design has been widely adopted by the visualization community to help users examine and interact with large, complex, and high-dimensional data. However, although ubiquitous, there has been little work to categorize and analyze MVs in order to better understand its design space. As a result, there has been little to no guideline in how to use the MV design effectively. In this paper, we present an in-depth study of how MVs are designed in practice. We focus on two fundamental measures of multiple-view patterns: composition, which quantifies what view types and how many are there; and configuration, which characterizes spatial arrangement of view layouts in the display space. We build a new dataset containing 360 images of MVs collected from IEEE VIS, EuroVis, and PacificVis publications 2011 to 2019, and make fine-grained annotations of view types and layouts for these visualization images. From this data we conduct composition and configuration analyses using quantitative metrics of term frequency and layout topology. We identify common practices around MVs, including relationship of view types, popular view layouts, and correlation between view types and layouts. We combine the findings into a MV recommendation system, providing interactive tools to explore the design space, and support example-based design.", "keywords": "Multiple views,design pattern,quantitative analysis,example-based design", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030338", "refList": ["10.1109/tvcg.2018.2865235", "10.1109/tvcg.2016.2615308", "10.1145/2642918.2647398", "10.1177/1473871611416549", "10.1109/tvcg.2019.2934810", "10.1109/tvcg.2014.48", "10.1109/tvcg.2018.2864903", "10.1145/345513.345271", "10.1109/iv.1998.694193", "10.1109/tvcg.2007.70594", "10.1109/tvcg.2017.2744019", "10.1109/tvcg.2011.185", "10.1109/tvcg.2015.2467194", "10.1109/visual.1991.175815", "10.14778/2831360.2831371", "10.1109/mcg.2019.2924636", "10.1111/cgf.13673", "10.1111/cgf.12131", "10.1109/tvcg.2017.2744198", "10.1145/108360.108361", "10.1109/vl.1996.545307", "10.1109/tvcg.2017.2745140", "10.1109/cmv.2007.20", "10.1145/198366.198376", "10.1145/2508363.2508405", "10.1111/cgf.12114", "10.1109/icde.2018.00019", "10.1109/tvcg.2017.2787113", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13380", "10.1111/cgf.12902", "10.1109/vast.2015.7347628", "10.2307/2288400", "10.1109/infvis.2004.12", "10.1145/102377.115768", "10.1109/tvcg.2009.179", "10.1109/2945.981851", "10.1109/tvcg.2007.70521", "10.1109/pacificvis.2012.6183556", "10.1145/2213836", "10.1109/tvcg.2013.234", "10.1109/iv.2008.87"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030460", "title": "Personal Augmented Reality for Information Visualization on Large Interactive Displays", "year": "2020", "conferenceName": "InfoVis", "authors": "Patrick Reipschläger;Tamara Flemisch;Raimund Dachselt", "citationCount": "0", "affiliation": "Reipschlager, P (Corresponding Author), Tech Univ Dresden, Interact Media Lab, Dresden, Germany. Reipschlager, Patrick; Flemisch, Tamara; Dachselt, Raimund, Tech Univ Dresden, Interact Media Lab, Dresden, Germany. Dachselt, Raimund, Tech Univ Dresden, Ctr Tactile Internet CeTi, Dresden, Germany. Dachselt, Raimund, Tech Univ Dresden, Cluster Excellence Phys Life, Dresden, Germany.", "countries": "Germany", "abstract": "In this work we propose the combination of large interactive displays with personal head-mounted Augmented Reality (AR) for information visualization to facilitate data exploration and analysis. Even though large displays provide more display space, they are challenging with regard to perception, effective multi-user support, and managing data density and complexity. To address these issues and illustrate our proposed setup, we contribute an extensive design space comprising first, the spatial alignment of display, visualizations, and objects in AR space. Next, we discuss which parts of a visualization can be augmented. Finally, we analyze how AR can be used to display personal views in order to show additional information and to minimize the mutual disturbance of data analysts. Based on this conceptual foundation, we present a number of exemplary techniques for extending visualizations with AR and discuss their relation to our design space. We further describe how these techniques address typical visualization problems that we have identified during our literature research. To examine our concepts, we introduce a generic AR visualization framework as well as a prototype implementing several example techniques. In order to demonstrate their potential, we further present a use case walkthrough in which we analyze a movie data set. From these experiences, we conclude that the contributed techniques can be useful in exploring and understanding multivariate data. We are convinced that the extension of large displays with AR for information visualization has a great potential for data analysis and sense-making.", "keywords": "Augmented Reality,Information Visualization,InfoVis,Large Displays,Immersive Analytics,Physical Navigation,Multiple Coordinated Views", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030460", "refList": ["10.1109/tvcg.2008.153", "10.1109/tvcg.2013.166", "10.1109/tvcg.2012.275", "10.1109/tvcg.2019.2934803", "10.1177/1473871611412817", "10.1109/tvcg.2017.2745958", "10.1109/tvcg.2019.2934415", "10.1109/tvcg.2009.162", "10.1109/mcg.2019.2897927", "10.1109/tvcg.2017.2744199", "10.1145/3126594.3126613", "10.1145/3173574.3173759", "10.1145/3290605.3300360", "10.1145/2858036.2858158", "10.1145/642611.642695", "10.1145/2702123.2702312", "10.1109/3dui.2014.6798833", "10.1109/tvcg.2018.2865235", "10.1111/cgf.13213", "10.1109/mcg.2014.82", "10.1145/3343055.3359718", "10.1007/978-3-030-01388-2\\_1", "10.1145/2858036.2858524", "10.1145/3173574.3173610", "10.1145/2817721.2817735", "10.1145/1166253.1166280", "10.1109/vr46266.2020.1582298687237", "10.1145/2576099", "10.1145/3173574.3173664", "10.1109/infvis.2005.1532136", "10.1080/15384047.2020.1806642", "10.1023/a:1021271517844", "10.1109/tvcg.2019.2903956", "10.1177/1473871611415997", "10.1145/2817721.2823505", "10.1145/3290605.3300521", "10.1016/s1071-5819(03)00021-1", "10.1145/2470654.2466431", "10.1109/vr.2019.8797733", "10.1177/1473871611416549", "10.1109/tvcg.2011.287", "10.2312/eurp.20191136", "10.1111/cgf.12871", "10.1145/3290605.3300288", "10.1109/3dui.2014.6798842", "10.1145/302979.303113", "10.1145/3343055.3359709", "10.1109/tvcg.2013.197", "10.1007/s11071-020-05736-x", "10.1109/vr46266.2020.00-23", "10.1109/tvcg.2016.2592906", "10.1109/mcg.2019.2898856", "10.1109/tvcg.2016.2640960", "10.1109/tvcg.2017.2745258", "10.1145/2817721.2817726", "10.1109/tvcg.2018.2865192", "10.1109/bigdata.2018.8622521", "10.1109/tvcg.2012.204", "10.1080/07370024.2019.1697697", "10.1109/vr46266.2020.1581122519414", "10.1109/vr46266.2020.00-20", "10.1109/pacificvis.2019.00010", "10.1145/3359996.3364242", "10.1145/3173574.3173593", "10.1109/ismar-adjunct.2016.0030", "10.1145/2317956.2318025", "10.1109/cmv.2007.20", "10.1080/07370020902739429", "10.1109/visual.2019.8933673", "10.1109/tvcg.2016.2598608", "10.1145/2702123.2702331", "10.1109/tvcg.2017.2745941", "10.1145/1936652.1936676", "10.1117/12.2521648", "10.1145/3009939.3009945", "10.1111/cgf.13206", "10.1109/tvcg.2013.163", "10.1109/tvcg.2017.2744184", "10.1145/2785830.2785871", "10.1109/tvcg.2012.251"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030334", "title": "Uplift: A Tangible and Immersive Tabletop System for Casual Collaborative Visual Analytics", "year": "2020", "conferenceName": "VAST", "authors": "Barrett Ens;Sarah Goodwin;Arnaud Prouzeau;Fraser Anderson;Florence Y. Wang;Samuel Gratzl;Zac Lucarelli;Brendan Moyle;Jim Smiley;Tim Dwyer", "citationCount": "0", "affiliation": "Ens, B (Corresponding Author), Monash Univ, Clayton, Vic, Australia. Ens, Barrett; Goodwin, Sarah; Prouzeau, Arnaud; Wang, Florence Y.; Gratzl, Samuel; Lucarelli, Zac; Moyle, Brendan; Smiley, Jim; Dwyer, Tim, Monash Univ, Clayton, Vic, Australia. Anderson, Fraser, Autodesk Res, Toronto, ON, Canada.", "countries": "Canada;Australia", "abstract": "Collaborative visual analytics leverages social interaction to support data exploration and sensemaking. These processes are typically imagined as formalised, extended activities, between groups of dedicated experts, requiring expertise with sophisticated data analysis tools. However, there are many professional domains that benefit from support for short 'bursts' of data exploration between a subset of stakeholders with a diverse breadth of knowledge. Such 'casual collaborative’ scenarios will require engaging features to draw users' attention, with intuitive, 'walk-up and use’ interfaces. This paper presents Uplift, a novel prototype system to support 'casual collaborative visual analytics' for a campus microgrid, co-designed with local stakeholders. An elicitation workshop with key members of the building management team revealed relevant knowledge is distributed among multiple experts in their team, each using bespoke analysis tools. Uplift combines an engaging 3D model on a central tabletop display with intuitive tangible interaction, as well as augmented-reality, mid-air data visualisation, in order to support casual collaborative visual analytics for this complex domain. Evaluations with expert stakeholders from the building management and energy domains were conducted during and following our prototype development and indicate that Uplift is successful as an engaging backdrop for casual collaboration. Experts see high potential in such a system to bring together diverse knowledge holders and reveal complex interactions between structural, operational, and financial aspects of their domain. Such systems have further potential in other domains that require collaborative discussion or demonstration of models, forecasts, or cost-benefit analyses to high-level stakeholders.", "keywords": "Data visualisation,tangible and embedded interaction,augmented reality,immersive analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030334", "refList": ["10.1109/vr.2019.8797733", "10.1109/tvcg.2018.2865235", "10.1111/cgf.13213", "10.1109/mcg.2014.82", "10.1109/tvcg.2008.153", "10.1145/1240624.1240701", "10.1109/tvcg.2013.166", "10.1177/1473871611416549", "10.1145/3343055.3359718", "10.1109/pacificvis.2019.00010", "10.1109/tvcg.2012.275", "10.1109/vr46266.2020.00-20", "10.1109/tvcg.2011.287", "10.3788/co.20201301.0001", "10.1109/tvcg.2019.2934803", "10.1145/3173574.3173610", "10.1145/2858036.2858524", "10.1145/3359996.3364242", "10.1145/3173574.3173593", "10.1177/1473871611412817", "10.1109/tvcg.2017.2745958", "10.1111/cgf.12871", "10.1145/2817721.2817735", "10.1145/2317956.2318025", "10.1145/1166253.1166280", "10.1007/978-3-319-73207-7", "10.1109/tvcg.2019.2934415", "10.1109/cmv.2007.20", "10.1109/vr46266.2020.1582298687237", "10.1109/tvcg.2009.162", "10.1109/visual.2019.8933673", "10.1109/mcg.2019.2897927", "10.1145/2702123.2702331", "10.1145/2576099", "10.1145/3290605.3300288", "10.1145/3173574.3173664", "10.1109/infvis.2005.1532136", "10.1109/3dui.2014.6798842", "10.1145/302979.303113", "10.1145/3343055.3359709", "10.1109/tvcg.2016.2598608", "10.1109/tvcg.2017.2744199", "10.1145/1936652.1936676", "10.1117/12.2521648", "10.1080/15384047.2020.1806642", "10.1109/tvcg.2013.197", "10.1145/3009939.3009945", "10.1145/3126594.3126613", "10.1109/tvcg.2016.2592906", "10.1109/mcg.2019.2898856", "10.1111/cgf.13206", "10.1109/tvcg.2013.163", "10.1109/tvcg.2016.2640960", "10.1145/3173574.3173759", "10.1109/tvcg.2017.2744184", "10.1109/tvcg.2017.2745258", "10.1023/a:1021271517844", "10.1145/2817721.2817726", "10.1145/2858036.2858158", "10.1109/tvcg.2018.2865192", "10.1109/bigdata.2018.8622521", "10.1145/642611.642695", "10.1145/2785830.2785871", "10.1109/tvcg.2012.204", "10.1080/07370024.2019.1697697", "10.1109/tvcg.2019.2903956", "10.1109/tcyb.2020.2970556", "10.1109/tvcg.2012.251", "10.1145/2702123.2702312", "10.1177/1473871611415997", "10.1145/2817721.2823505", "10.1145/3290605.3300521", "10.2312/eurp", "10.1145/2470654.2466431"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13995", "year": "2020", "title": "GTMapLens: Interactive Lens for Geo-Text Data Browsing on Map", "conferenceName": "EuroVis", "authors": "Chao Ma;Ye Zhao;Shamal Al{-}Dohuki;Jing Yang;Xinyue Ye;Farah Kamw;Md. Amiruzzaman", "citationCount": "0", "affiliation": "Zhao, Y (Corresponding Author), Kent State Univ, Kent, OH 44240 USA.\nMa, Chao; Zhao, Ye; Amiruzzaman, Md, Kent State Univ, Kent, OH 44240 USA.\nAl-Dohuki, Shamal, Univ Duhok, Duhok, Iraq.\nYang, Jing, Univ N Carolina, Charlotte, NC USA.\nYe, Xinyue, New Jersey Inst Technol, Newark, NJ 07102 USA.\nKamw, Farah, Concordia Univ, Ann Arbor, MI USA.", "countries": "USA;Iraq", "abstract": "Data containing geospatial semantics, such as geotagged tweets, travel blogs, and crime reports, associates natural language texts with geographical locations. This paper presents a lens-based visual interaction technique, GTMapLens, to flexibly browse the geo-text data on a map. It allows users to perform dynamic focus+context exploration by using movable lenses to browse geographical regions, find locations of interest, and perform comparative and drill-down studies. Geo-text data is visualized in a way that users can easily perceive the underlying geospatial semantics along with lens moving. Based on a requirement analysis with a cohort of multidisciplinary domain experts, a set of lens interaction techniques are developed including keywords control, path management, context visualization, and snapshot anchors. They allow users to achieve a guided and controllable exploration of geo-text data. A hierarchical data model enables the interactive lens operations by accelerated data retrieval from a geo-text database. Evaluation with real-world datasets is presented to show the usability and effectiveness of GTMapLens.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13995", "refList": ["10.1109/tvcg.2018.2865235", "10.1145/1936652.1936673", "10.1145/2598153.2598200", "10.1145/1456650.1456652", "10.1109/vast.2011.6102456", "10.1145/3290605.3300864", "10.1177/1473871611413180", "10.1109/iv.2011.43", "10.1109/tvcg.2015.2467971", "10.1109/iv.2016.62", "10.1080/13658816.2017.1325488", "10.1111/cgf.12871", "10.1111/cgf.12132", "10.1109/mc.2012.430", "10.1109/tvcg.2016.2598585", "10.1109/tvcg.2011.195", "10.1109/tvcg.2015.2467619", "10.1109/pacificvis.2013.6596122", "10.13140/rg.2.2.36636.59521", "10.1145/3170427.3188506", "10.1016/b978-155860915-0/50040-8", "10.1109/infvis.2003.1249008", "10.1109/tvcg.2018.2850781", "10.1016/j.datak.2006.01.013", "10.1109/tvcg.2015.2467991", "10.1111/gec3.12404", "10.1109/tvcg.2008.149", "10.1109/visual.1998.745317", "10.1109/pacificvis.2012.6183572", "10.1109/tvcg.2011.176", "10.1016/j.visinf.2018.04.006.2", "10.1111/cgf.13264", "10.1080/13658816.2010.508043", "10.1007/s41651-017-0002-6", "10.1109/tvcg.2009.65", "10.1109/vast.2011.6102498", "10.1145/3025453.3025777", "10.1109/tvcg.2006.138"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13979", "year": "2020", "title": "Short-Contact Touch-Manipulation of Scatterplot Matrices on Wall Displays", "conferenceName": "EuroVis", "authors": "Patrick Riehmann;Gabriela Molina Le{\\'{o}}n;Joshua Reibert;Florian Echtler;Bernd Fr{\\\"{o}}hlich", "citationCount": "0", "affiliation": "Riehmann, P (Corresponding Author), Bauhaus Univ Weimar, Weimar, Germany.\nRiehmann, P.; Leon, G. Molina; Reibert, J.; Echtler, F.; Froehlich, B., Bauhaus Univ Weimar, Weimar, Germany.\nReibert, J., German Aerosp Ctr DLR, Inst Data Sci, Jena, Germany.\nLeon, G. Molina, Univ Bremen, Bremen, Germany.", "countries": "Germany", "abstract": "This paper presents a short-contact multitouch vocabulary for interacting with scatterplot matrices (SPLOMs) on wall-sized displays. Fling-based gestures overcome central interaction challenges of such large displays by avoiding long swipes on the typically blunt surfaces, frequent physical navigation by walking for accessing screen areas beyond arm's reach in the horizontal direction and uncomfortable postures for accessing screen areas in the vertical direction. Furthermore, we make use of the display's high resolution and large size by supporting the efficient specification of two-tiered focus + context regions which are consistently propagated across the SPLOM. These techniques are complemented by axis-centered and lasso-based selection techniques for specifying subsets of the data. An expert review as well as a user study confirmed the potential and general usability of our seamlessly integrated multitouch interaction techniques for SPLOMs on large vertical displays.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13979", "refList": ["10.1109/tvcg.2018.2865235", "10.1145/3152832.3152852", "10.1109/tvcg.2008.153", "10.1016/j.cag.2007.01.029", "10.1145/3025453.3025594", "10.1109/vast.2009.5332595", "10.1145/2971485.2971503", "10.1145/3173574.3173593", "10.1145/2817721.2817735", "10.1145/2670444.2670445", "10.1145/2470654.2481318", "10.1109/mcg.2005.88", "10.1145/1936652.1936707", "10.1145/2556288.2557231", "10.1111/cgf.12902", "10.1201/9781498710411", "10.1109/tvcg.2016.2592906", "10.1111/cgf.13206", "10.1145/1520340.1520467", "10.1109/tvcg.2010.130", "10.1145/2598153.2598163", "10.1145/2909132.2909258", "10.1002/hbm.20701", "10.1145/2396636.2396675", "10.1145/2702123.2702406", "10.1109/tvcg.2012.251", "10.2312/eurovisshort.20181088", "10.1145/2702123.2702312", "10.1177/1473871611415997", "10.1145/22339.22342", "10.1109/mcg.2013.24", "10.1145/2669485.2669507"], "wos": 1, "children": [], "len": 1}], "len": 11}, {"doi": "10.1109/tvcg.2019.2934282", "title": "Designing for Mobile and Immersive Visual Analytics in the Field", "year": "2019", "conferenceName": "InfoVis", "authors": "Matt Whitlock;Keke Wu;Danielle Albers Szafir", "citationCount": "0", "affiliation": "Whitlock, M (Corresponding Author), Univ Colorado, Boulder, CO 80309 USA. Whitlock, Matt; Wu, Keke; Szafir, Danielle, Univ Colorado, Boulder, CO 80309 USA.", "countries": "USA", "abstract": "Data collection and analysis in the field is critical for operations in domains such as environmental science and public safety. However, field workers currently face data- and platform-oriented issues in efficient data collection and analysis in the field, such as limited connectivity, screen space, and attentional resources. In this paper, we explore how visual analytics tools might transform field practices by more deeply integrating data into these operations. We use a design probe coupling mobile, cloud, and immersive analytics components to guide interviews with ten experts from five domains to explore how visual analytics could support data collection and analysis needs in the field. The results identify shortcomings of current approaches and target scenarios and design considerations for future field analysis systems. We embody these findings in FieldView, an extensible, open-source prototype designed to support critical use cases for situated field analysis. Our findings suggest the potential for integrating mobile and immersive technologies to enhance data's utility for various field operations and new directions for visual analytics tools to transform fieldwork.", "keywords": "Immersive Analytics,Augmented Reality,Mobile Visualization,Outdoor Visualization,Emergency Response", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934282", "refList": ["10.1007/978-3-319-45853-3\\_15", "10.1145/355324.355329", "10.1186/1472-6947-9-51", "10.1007/978-3-540-69878-4\\_12", "10.1109/tvcg.2018.2868584", "10.1007/978-3-319-45853-315", "10.1007/s10606-015-9235-4", "10.1109/futuretech.2010.5482712", "10.1016/s0001-4575(99)00018-4", "10.1130/ges00503.1", "10.1109/tvcg.2017.2744019", "10.1145/3173574.3173593", "10.1109/mcom.2011.6069707", "10.1145/2750858.2804266", "10.1145/2785830.2785876", "10.1109/tvcg.2018.2865234", "10.1016/s0097-8493(01)00090-5", "10.1109/tvcg.2016.2598608", "10.1145/2851581.2892322", "10.1109/tvcg.2007.70535", "10.1109/tvcg.2017.2745941", "10.1518/155534308x284381", "10.1057/palgrave.ivs.9500168", "10.1144/0016-764905-017", "10.3390/mti1040029", "10.1007/978-3-319-40397-7\\_2", "10.1109/mc.2006.109", "10.1145/2535597.2535608", "10.1109/mcom.2010.5560598", "10.1518/001872095779049543", "10.1145/3025453.3025860", "10.1145/3025453.3025752", "10.1016/b978-0-12-809477-8.00009-1", "10.1126/science.aag2579", "10.1109/mc.2013.147", "10.1145/1050491.1050499", "10.1186/s41039-016-0028-2", "10.1007/978-3-030-01388-22", "10.1002/esp.1417", "10.1177/0193841x02250527", "10.1111/1467-9671.00157", "10.1007/s11069-017-2929-9", "10.1109/tvcg.2018.2864914", "10.1016/j.autcon.2012.09.002"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3028948", "title": "A Generic Framework and Library for Exploration of Small Multiples through Interactive Piling", "year": "2020", "conferenceName": "InfoVis", "authors": "Fritz Lekschas;Xinyi Zhou;Wei Chen;Nils Gehlenborg;Benjamin Bach;Hanspeter Pfister", "citationCount": "0", "affiliation": "Lekschas, F (Corresponding Author), Harvard Sch Engn \\& Appl Sci, Cambridge, MA 02138 USA. Lekschas, Fritz; Pfister, Hanspeter, Harvard Sch Engn \\& Appl Sci, Cambridge, MA 02138 USA. Zhou, Xinyi; Chen, Wei, Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Peoples R China. Bach, Benjamin, Univ Edinburgh, Edinburgh, Midlothian, Scotland. Gehlenborg, Nils, Harvard Med Sch, Boston, MA 02115 USA.", "countries": "Scotland;China;USA", "abstract": "Small multiples are miniature representations of visual information used generically across many domains. Handling large numbers of small multiples imposes challenges on many analytic tasks like inspection, comparison, navigation, or annotation. To address these challenges, we developed a framework and implemented a library called PILlNG.JS for designing interactive piling interfaces. Based on the piling metaphor, such interfaces afford flexible organization, exploration, and comparison of large numbers of small multiples by interactively aggregating visual objects into piles. Based on a systematic analysis of previous work, we present a structured design space to guide the design of visual piling interfaces. To enable designers to efficiently build their own visual piling interfaces, PILlNG.JS provides a declarative interface to avoid having to write low-level code and implements common aspects of the design space. An accompanying GUI additionally supports the dynamic configuration of the piling interface. We demonstrate the expressiveness of PILlNG.JS with examples from machine learning, immunofluorescence microscopy, genomics, and public health.", "keywords": "Information visualization,small multiples,interactive piling,visual aggregation,spatial organization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028948", "refList": ["10.1007/978-3-030-01388-28", "10.1111/j.1467-8659.2009.01444.x", "10.1145/3300961", "10.1145/289444.289469", "10.1109/3pgcic.2010.36", "10.1145/279227.279229", "10.1007/bf01782772", "10.1109/tvcg.2011.185", "10.1109/bigdata", "10.1145/142750.142828", "10.1109/tvcg.2017.2744019", "10.1177/1473871611412817", "10.1145/1518701.1518886", "10.2337/9781580404587", "10.1109/tvcg.2018.2865076", "10.1145/67544.66963", "10.1109/cmv.2007.20", "10.1145/2807442.2807446", "10.19173/irrodl.v9i3.523", "10.1002/(sici)1097-024x(199909)29:11", "10.5555/1973430.1973449", "10.1109/2.809253", "10.1145/97945.97975", "10.1109/tvcg", "10.1109/tvcg.2009.188", "10.1109/tse.1977.229904", "10.1109/bigdata.2014.7004282", "10.1108/09684880210416102", "10.1109/iv.2011.44", "10.1109/2.299409", "10.1145/1936652.1936694", "10.1109/vast", "10.1109/pvgs.1999.810138", "10.1111/j.1467-8659.2004.00754.x", "10.1109/tvcg.2007.70568", "10.1109/tvcg.2018.2865144"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030338", "title": "Composition and Configuration Patterns in Multiple-View Visualizations", "year": "2020", "conferenceName": "InfoVis", "authors": "Xi Chen;Wei Zeng 0004;Yanna Lin;Hayder Al-Maneea;Jonathan Roberts 0002;Remco Chang", "citationCount": "0", "affiliation": "Zeng, W (Corresponding Author), Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. Chen, Xi; Zeng, Wei; Lin, Yanna, Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. AI-maneea, Hayder Mahdi; Roberts, Jonathan, Bangor Univ, Bangor, Gwynedd, Wales. Chang, Remco, Tufts Univ, Medford, MA 02155 USA.", "countries": "USA;Wales;China", "abstract": "Multiple-view visualization (MV) is a layout design technique often employed to help users see a large number of data attributes and values in a single cohesive representation. Because of its generalizability, the MV design has been widely adopted by the visualization community to help users examine and interact with large, complex, and high-dimensional data. However, although ubiquitous, there has been little work to categorize and analyze MVs in order to better understand its design space. As a result, there has been little to no guideline in how to use the MV design effectively. In this paper, we present an in-depth study of how MVs are designed in practice. We focus on two fundamental measures of multiple-view patterns: composition, which quantifies what view types and how many are there; and configuration, which characterizes spatial arrangement of view layouts in the display space. We build a new dataset containing 360 images of MVs collected from IEEE VIS, EuroVis, and PacificVis publications 2011 to 2019, and make fine-grained annotations of view types and layouts for these visualization images. From this data we conduct composition and configuration analyses using quantitative metrics of term frequency and layout topology. We identify common practices around MVs, including relationship of view types, popular view layouts, and correlation between view types and layouts. We combine the findings into a MV recommendation system, providing interactive tools to explore the design space, and support example-based design.", "keywords": "Multiple views,design pattern,quantitative analysis,example-based design", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030338", "refList": ["10.1109/tvcg.2018.2865235", "10.1109/tvcg.2016.2615308", "10.1145/2642918.2647398", "10.1177/1473871611416549", "10.1109/tvcg.2019.2934810", "10.1109/tvcg.2014.48", "10.1109/tvcg.2018.2864903", "10.1145/345513.345271", "10.1109/iv.1998.694193", "10.1109/tvcg.2007.70594", "10.1109/tvcg.2017.2744019", "10.1109/tvcg.2011.185", "10.1109/tvcg.2015.2467194", "10.1109/visual.1991.175815", "10.14778/2831360.2831371", "10.1109/mcg.2019.2924636", "10.1111/cgf.13673", "10.1111/cgf.12131", "10.1109/tvcg.2017.2744198", "10.1145/108360.108361", "10.1109/vl.1996.545307", "10.1109/tvcg.2017.2745140", "10.1109/cmv.2007.20", "10.1145/198366.198376", "10.1145/2508363.2508405", "10.1111/cgf.12114", "10.1109/icde.2018.00019", "10.1109/tvcg.2017.2787113", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13380", "10.1111/cgf.12902", "10.1109/vast.2015.7347628", "10.2307/2288400", "10.1109/infvis.2004.12", "10.1145/102377.115768", "10.1109/tvcg.2009.179", "10.1109/2945.981851", "10.1109/tvcg.2007.70521", "10.1109/pacificvis.2012.6183556", "10.1145/2213836", "10.1109/tvcg.2013.234", "10.1109/iv.2008.87"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13716", "year": "2019", "title": "Augmenting Tactile 3D Data Navigation With Pressure Sensing", "conferenceName": "EuroVis", "authors": "Xiyao Wang;Lonni Besan{\\c{c}}on;Mehdi Ammi;Tobias Isenberg", "citationCount": "1", "affiliation": "Wang, XY (Corresponding Author), INRIA, Rocquencourt, France.\nWang, XY (Corresponding Author), Univ Paris Saclay, St Aubin, France.\nWang, Xiyao; Isenberg, Tobias, INRIA, Rocquencourt, France.\nWang, Xiyao, Univ Paris Saclay, St Aubin, France.\nBesancon, Lonni, Linkoping Univ, Norrkoping, Sweden.\nAmmi, Mehdi, Univ Paris 08, St Denis, France.", "countries": "Sweden;France", "abstract": "We present a pressure-augmented tactile 3D data navigation technique, specifically designed for small devices, motivated by the need to support the interactive visualization beyond traditional workstations. While touch input has been studied extensively on large screens, current techniques do not scale to small and portable devices. We use phone-based pressure sensing with a binary mapping to separate interaction degrees of freedom (DOF) and thus allow users to easily select different manipulation schemes (e. g., users first perform only rotation and then with a simple pressure input to switch to translation). We compare our technique to traditional 3D-RST (rotation, scaling, translation) using a docking task in a controlled experiment. The results show that our technique increases the accuracy of interaction, with limited impact on speed. We discuss the implications for 3D interaction design and verify that our results extend to older devices with pseudo pressure and are valid in realistic phone usage scenarios.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13716", "refList": ["10.1145/2207676.2208589", "10.1145/2788940.2788950", "10.1109/38.974511", "10.1145/1731903.1731930", "10.1038/nature.2016.19503", "10.1145/2559206.2578881", "10.1145/985692.985754", "10.1145/1851600.1851631", "10.1145/1124772.1124801", "10.1145/1643928.1643942", "10.1177/0956797613504966", "10.1109/mc.2013.178", "10.1109/mcg.2010.30", "10.1109/tvcg.2017.2744019", "10.1109/tvcg.2015.2440233", "10.1145/2992154.2996779", "10.1007/978-3-030-01388-2\\_4", "10.1145/3025453.3025565", "10.1109/tvcg.2016.2599217", "10.4108/icst.mobiquitous.2014.257919", "10.1109/tvcg.2004.1260759", "10.1207/s15327051hci0702\\_1", "10.1201/b17511", "10.7717/peerj.3544", "10.1016/b978-0-08-051574-8.50051-0", "10.1145/964696.964721", "10.1007/978-3-319-45853-3\\_6", "10.3390/s150101022", "10.1145/2642918.2647392", "10.1145/2207676.2208691", "10.1109/mcg.2004.20", "10.1145/2037373.2037393", "10.1145/2702123.2702371", "10.1145/3290607.3310432", "10.1145/2702123.2702300", "10.1145/1979742.1979895", "10.1111/j.1467-8659.2012.03197.x", "10.1145/2858036.2858095", "10.1109/3dui.2011.5759220", "10.1145/2493190.2493193", "10.1145/302979.302983", "10.1145/2541016.2541024", "10.1145/1054972.1055055", "10.1162/105474602317343640", "10.1145/2414536.2414572", "10.1145/2468356.2468578", "10.1038/nmeth.2659", "10.1109/tvcg.2011.283", "10.1016/0022-1031(71)90078-3", "10.1145/1868914.1868958", "10.1109/tvcg.2018.2865142", "10.1145/3025453.3025890", "10.1145/1140491.1140502", "10.1177/154193120605000909", "10.1109/tvcg.2018.2848906", "10.1145/2993148.2993152", "10.1007/s00779-018-1147-0", "10.4324/9780203807002", "10.1145/3027063.3053151", "10.1145/2371574.2371582", "10.1145/2396636.2396674", "10.1145/1088463.1088507", "10.1145/300523.300546", "10.1145/3025453.3025863", "10.1109/tvcg.2012.251", "10.1109/tridui.2006.1618267", "10.1109/tvcg.2011.224", "10.1080/01973533.2015.1060240", "10.1007/978-3-319-26633-6\\_13", "10.1145/1889863.1889888", "10.1109/tvcg.2010.157", "10.1109/tvcg.2007.70515", "10.1109/tabletop.2006.26", "10.1145/965139.807392", "10.1145/2983310.2985750", "10.20380/gi2009.23"], "wos": 1, "children": [], "len": 1}], "len": 33}, {"doi": "10.1111/cgf.13400", "year": "2018", "title": "ChangeCatcher: Increasing Inter-author Awareness for Visualization Development", "conferenceName": "EuroVis", "authors": "Mona Hosseinkhani Loorak;Melanie Tory;Sheelagh Carpendale", "citationCount": "1", "affiliation": "Loorak, M (Corresponding Author), Autodesk Res, Calgary, AB, Canada.\nLoorak, M., Autodesk Res, Calgary, AB, Canada.\nCarpendale, S., Univ Calgary, Calgary, AB, Canada.", "countries": "Canada", "abstract": "We introduce an approach for explicitly revealing changes between versions of a visualization workbook to support version comparison tasks. Visualization authors may need to understand version changes for a variety of reasons, analogous to document editing. An author who has been away for a while may need to catch up on the changes made by their co-author, or a person responsible for formatting compliance may need to check formatting changes that occurred since the last time they reviewed the work. We introduce ChangeCatcher, a prototype tool to help people find and understand changes in a visualization workbook, specifically, a Tableau workbook. Our design is based on interviews we conducted with experts to investigate user needs and practices around version comparison. ChangeCatcher provides an overview of changes across six categories, and employs a multi-level details-on-demand approach to progressively reveal details. Our qualitative study showed that ChangeCatcher's methods for explicitly revealing and categorizing version changes were helpful in version comparison tasks.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13400", "refList": ["10.1109/tvcg.2008.137", "10.1177/1473871611416549", "10.1097/00006324-199104000-00013", "10.1109/tvcg.2011.185", "10.20380/gi2015.16", "10.1007/978-3-642-23768-3\\_22", "10.1002/spe.4380150703", "10.1109/icde.2003.1260818", "10.1109/tvcg.2016.2598586", "10.1109/tvcg.2013.124", "10.1145/1166253.1166263", "10.1145/1101908.1101919", "10.1109/tvcg.2015.2467551", "10.1136/amiajnl-2012-001351", "10.1109/32.177365", "10.1145/1101908.1101940", "10.1007/978-3-540-70956-5\\_5", "10.1145/1056018.1056025", "10.1002/meet.2008.1450450234", "10.1109/tvcg.2017.2745279", "10.1109/32.895984", "10.1109/mcg.2015.50"], "wos": 1, "children": [{"doi": "10.1111/cgf.14035", "year": "2020", "title": "Survey on the Analysis of User Interactions and Visualization Provenance", "conferenceName": "EuroVis", "authors": "Kai Xu;Alvitta Ottley;Conny Walchshofer;Marc Streit;Remco Chang;John E. Wenskovitch", "citationCount": "0", "affiliation": "Xu, K (Corresponding Author), Middlesex Univ, London, England.\nXu, Kai, Middlesex Univ, London, England.\nOttley, Alvitta, Washington Univ, St Louis, MO 63110 USA.\nWalchshofer, Conny; Streit, Marc, Johannes Kepler Univ Linz, Linz, Austria.\nChang, Remco, Tufts Univ, Medford, MA 02155 USA.\nWenskovitch, John, Virginia Tech, Blacksburg, VA USA.", "countries": "USA;England;Austria", "abstract": "There is fast-growing literature on provenance-related research, covering aspects such as its theoretical framework, use cases, and techniques for capturing, visualizing, and analyzing provenance data. As a result, there is an increasing need to identify and taxonomize the existing scholarship. Such an organization of the research landscape will provide a complete picture of the current state of inquiry and identify knowledge gaps or possible avenues for further investigation. In this STAR, we aim to produce a comprehensive survey of work in the data visualization and visual analytics field that focus on the analysis of user interaction and provenance data. We structure our survey around three primary questions: (1) WHY analyze provenance data, (2) WHAT provenance data to encode and how to encode it, and (3) HOW to analyze provenance data. A concluding discussion provides evidence-based guidelines and highlights concrete opportunities for future development in this emerging area. The survey and papers discussed can be explored online interactively at https://provenance-survey.caleydo.org.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14035", "refList": ["10.1145/3186266", "10.1145/3185524", "10.1109/tvcg.2014.2346575", "10.1109/tvcg.2016.2598471", "10.1109/tvcg.2016.2598446", "10.1145/2856767.2856779", "10.1109/tvcg.2017.2745278", "10.1109/tvcg.2015.2467871", "10.1109/tvcg.2019.2934668", "10.1145/3301275.3302307", "10.1145/2207676.2208293", "10.1111/cgf.13402", "10.1111/cgf.12895", "10.1145/1084805.1084812", "10.1145/2983923", "10.1007/978-1-4419-5874-7\\_12", "10.1109/mcg.2010.18", "10.1109/tvcg.2015.2467153", "10.1109/tvcg.2013.211", "10.1145/3172944.3172964", "10.1145/3290605.3300360", "10.1109/tvcg.2009.199", "10.1109/vast.2016.7883515", "10.1145/2207676.2208412", "10.1145/1979742.1979570", "10.1145/2207676.2208565", "10.1109/tvcg.2017.2745078", "10.1109/tvcg.2013.226", "10.1145/3301275.3302270", "10.1145/2882903.2882919", "10.1109/tvcg.2013.132", "10.1007/978-1-4614-3223-4\\_6", "10.1007/978-1-4899-7993-3\\_80747-1", "10.1145/2449396.2449439", "10.4230/dagrep.8.11.35", "10.1111/cgf.13424", "10.1109/tvcg.2015.2467613", "10.1109/mcse.2007.106", "10.1109/vast.2014.7042486", "10.1145/3126594.3126653", "10.1145/2591510", "10.1109/vast.2017.8585665", "10.1109/tvcg.2017.2744684", "10.1109/vast.2009.5333564", "10.1111/cgf.12631", "10.1145/2702123.2702262", "10.1111/cgf.13717", "10.2312/evs.20191181", "10.1111/cgf.12925", "10.1145/2702123.2702590", "10.1109/tvcg.2015.2467551", "10.1145/3025171.3025187", "10.1145/3316416.3316418", "10.1109/tvcg.2015.2468078", "10.1109/mcg.2014.73", "10.1109/tvcg.2017.2744479", "10.1109/tvcg.2018.2859969", "10.1109/tvcg.2014.2346321", "10.1109/tvcg.2007.70589", "10.1007/s13218-012-0167-6", "10.1111/cgf.13670", "10.1145/2807442.2807478", "10.1111/cgf.13715", "10.1109/tvcg.2012.23", "10.1109/tvcg.2017.2745279", "10.1109/tvcg.2013.164", "10.1109/vast.2008.4677365", "10.1145/3301275.3302291", "10.1109/tvcg.2012.260", "10.1109/tvcg.2010.177", "10.1109/tvcg.2018.2865024", "10.1109/mcg.2015.51", "10.1145/2240236.2240260", "10.1109/tvcg.2016.2599030.2", "10.1109/tvcg.2007.70515", "10.1109/tvcg.2012.175", "10.1109/mcg.2019.2941856", "10.1109/tvcg.2008.137", "10.1016/j.visinf.2018.09.003", "10.4304/jmm.9.5.635-643", "10.1109/tvcg.2017.2744843", "10.1111/cgf.13405", "10.1145/2633043", "10.1109/tvcg.2009.129", "10.1109/tvcg.2019.2934609", "10.1111/cgf.12924", "10.1145/2702123.2702376", "10.1109/vast.2017.8585669", "10.1145/1502650.1502695", "10.1111/cgf.13730", "10.1109/tvcg.2013.124", "10.1109/tvcg.2017.2744805", "10.1109/mcg.2009.49", "10.1109/vast.2015.7347625", "10.1145/3009973", "10.1145/2470654.2470723", "10.1109/vast.2016.7883520", "10.1109/vast.2014.7042492", "10.1145/2984511.2984588", "10.1111/cgf.12391", "10.1561/1900000006", "10.1007/s00778-017-0486-1", "10.1109/vast.2009.5333020", "10.1145/1926385.1926423", "10.1145/1057977.1057978", "10.1145/3290605.3300892", "10.1111/j.1467-8659.2011.01928.x", "10.1109/tvcg.2013.188", "10.1109/tvcg.2015.2467191", "10.1109/iccicct.2014.6993023", "10.1145/3290605.3300874", "10.1145/2557500.2557524", "10.1109/mcg.2015.91", "10.1109/vast.2012.6400494", "10.1109/tvcg.2013.220", "10.1109/mcg.2019.2945378", "10.1109/vast.2012.6400486", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2016.2598839", "10.1145/1142473.1142574", "10.1177/1555343416672782", "10.1109/vast.2011.6102449", "10.1111/cgf.12090", "10.1109/vast.2016.7883518", "10.1111/cgf.13678", "10.1109/mcg.2009.53", "10.1109/tvcg.2014.2346250", "10.1109/tvcg.2016.2598797", "10.1111/cgf.13400", "10.1109/tvcg.2014.2346573", "10.1080/01431160600746456", "10.1145/2642918.2647378", "10.1109/mcg.2019.2945720", "10.1145/2207676.2207741", "10.1145/3025171.3025189", "10.1145/634067.634292", "10.1109/tvcg.2015.2467611", "10.1109/tit.1982.1056489", "10.1109/tvcg.2018.2865117", "10.1109/vast.2009.5333023", "10.1145/3332165.3347866", "10.1109/mcg.2019.2933419", "10.1145/3184900", "10.1109/tvcg.2012.273", "10.1109/vast.2010.5652885", "10.1109/vast.2015.7347627", "10.1145/3290605.3300803", "10.1109/tvcg.2012.258", "10.1109/mcg.2009.87", "10.1109/tvcg.2019.2934556", "10.1145/1869397.1869399", "10.1109/mcg.2015.50", "10.1145/3172944.3172979", "10.1111/cgf.13208", "10.1111/cgf.12619", "10.1145/3290605.3300358", "10.1109/vast.2008.4677352", "10.1109/tvcg.2016.2598468", "10.1109/vast.2016.7883519", "10.1109/mcse.2008.79"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 39}], "len": 41}, "index": 1350, "embedding": [-2.125394344329834, -0.23828700184822083, -1.030107021331787, -1.1256049871444702, -0.08363610506057739, 0.16650904715061188, 3.957038402557373, 1.813097357749939, 7.022189617156982, -0.5184375643730164, 2.72483229637146, -0.7234958410263062, 1.1079052686691284, 2.400529146194458, -0.804432213306427, -0.5232402086257935, -0.2333013266324997, 0.07072390615940094, -0.019604088738560677, 1.397369623184204, -0.06630208343267441, 0.954501748085022, 0.04193119704723358, 0.05790624022483826, -2.0101747512817383, 3.3668296337127686, -0.5452967882156372, -0.19688554108142853, -0.3430904448032379, -2.657630681991577, 0.6110643148422241, -0.7191439867019653], "projection": [3.3843326568603516, 25.159725189208984], "size": 21, "height": 6, "width": 7}