{"data": {"doi": "10.1109/pacificvis.2014.16", "year": "2014", "title": "Moment Invariants for 2D Flow Fields Using Normalization", "conferenceName": "PacificVis", "authors": "Roxana Bujack;Ingrid Hotz;Gerik Scheuermann;Eckhard Hitzer", "citationCount": "12", "affiliation": "Bujack, R (Corresponding Author), Univ Leipzig, D-04109 Leipzig, Germany.\nBujack, Roxana; Scheuermann, Gerik, Univ Leipzig, D-04109 Leipzig, Germany.\nHotz, Ingrid, German Aerosp Ctr, Cologne, Germany.\nHitzer, Eckhard, Int Christian Univ, Mitaka, Tokyo, Japan.", "countries": "Japan;Germany", "abstract": "The analysis of 2D flow data is often guided by the search for characteristic structures with semantic meaning. One way to approach this question is to identify structures of interest by a human observer. The challenge then, is to find similar structures in the same or other datasets on different scales and orientations. In this paper, we propose to use moment invariants as pattern descriptors for flow fields. Moment invariants are one of the most popular techniques for the description of objects in the field of image recognition. They have recently also been applied to identify 2D vector patterns limited to the directional properties of flow fields. In contrast to previous work, we follow the intuitive approach of moment normalization, which results in a complete and independent set of translation, rotation, and scaling invariant flow field descriptors. They also allow to distinguish flow features with different velocity profiles. We apply the moment invariants in a pattern recognition algorithm to a real world dataset and show that the theoretic results can be extended to discrete functions in a robust way.", "keywords": "I. 4.7 {[}Image Processing and Computer Vision]: Feature Measurement -Moments; I. 5.2 {[}Pattern Recognition]: Design Methodology-Classifier design and evaluation", "link": "https://doi.org/10.1109/PacificVis.2014.16", "refList": ["10.1109/tvcg.2007.70579", "10.1109/tvcg.2011.249", "10.1109/visual.2004.128", "10.1109/tpami.1984.4767594", "10.1016/s0031-3203(99)00127-2", "10.1007/978-3-540-70823-0\\_1", "10.1109/tsp.2003.812734", "10.1109/tvcg.2008.143", "10.1109/34.3913", "10.1109/tvcg.2003.1207439", "10.1017/s0022112095000462", "10.1109/tvcg.2007.1053", "10.1109/tvcg.2010.170", "10.1364/josa.70.000920", "10.1109/tit.1962.1057692", "10.2312/conf/eg2012/stars/075-094"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2015.2467292", "title": "Multi-field Pattern Matching based on Sparse Feature Sampling", "year": "2015", "conferenceName": "SciVis", "authors": "Zhongjie Wang;Hans-Peter Seidel;Tino Weinkauf", "citationCount": "5", "affiliation": "Wang, ZJ (Corresponding Author), MPI Informat, Saarbrucken, Germany. Wang, Zhongjie; Seidel, Hans-Peter, MPI Informat, Saarbrucken, Germany. Weinkauf, Tino, KTH Royal Inst Technol, Stockholm, Sweden.", "countries": "Sweden;Germany", "abstract": "We present an approach to pattern matching in 3D multi-field scalar data. Existing pattern matching algorithms work on single scalar or vector fields only, yet many numerical simulations output multi-field data where only a joint analysis of multiple fields describes the underlying phenomenon fully. Our method takes this into account by bundling information from multiple fields into the description of a pattern. First, we extract a sparse set of features for each 3D scalar field using the 3D SIFT algorithm (Scale-Invariant Feature Transform). This allows for a memory-saving description of prominent features in the data with invariance to translation, rotation, and scaling. Second, the user defines a pattern as a set of SIFT features in multiple fields by e.g. brushing a region of interest. Third, we locate and rank matching patterns in the entire data set. Experiments show that our algorithm is efficient in terms of required memory and computational efforts.", "keywords": "Pattern matching, multi-field visualization", "link": "http://dx.doi.org/10.1109/TVCG.2015.2467292", "refList": ["10.1109/tvcg.2013.269", "10.1109/tvcg.2014.2346332", "10.1109/iccv.1999.790410", "10.1111/j.1467-8659.2012.03063.x", "10.1016/j.patrec.2010.04.004", "10.1109/tvcg.2003.1207439", "10.1145/1291233.1291311", "10.1109/pacificvis.2014.16", "10.1109/isbi.2007.356953", "10.1109/tvcg.2011.236", "10.1111/cgf.12360", "10.1023/b:visi.0000029664.99615.94", "10.1109/visual.2003.1250372", "10.1109/iciap.2007.4362878", "10.1109/tvcg.2011.78", "10.1016/b978-0-12-397918-6.00001-x", "10.1007/978-3-642-33765-9\\_33", "10.1109/tvcg.2006.165", "10.1007/s11263-006-0002-3", "10.1109/tip.2006.884913", "10.1111/cgf.12121", "10.1109/tvcg.2007.70579", "10.1049/el:20082477", "10.1103/physreve.84.016406", "10.1017/s0022112095000462"], "wos": 1, "children": [{"doi": "10.1109/pacificvis.2017.8031586", "year": "2017", "title": "Efficient distribution-based feature search in multi-field datasets", "conferenceName": "PacificVis", "authors": "Tzu{-}Hsuan Wei;Chun{-}Ming Chen;Jonathan Woodring;Huijie Zhang;Han{-}Wei Shen", "citationCount": "5", "affiliation": "Wei, TH (Corresponding Author), Ohio State Univ, Columbus, OH 43210 USA.\nWei, Tzu-Hsuan; Chen, Chun-Ming; Shen, Han-Wei, Ohio State Univ, Columbus, OH 43210 USA.\nWoodring, Jonathan, Los Alamos Natl Lab, Los Alamos, NM USA.\nShen, Han-Wei, Northeast Normal Univ, Changchun, Jilin, Peoples R China.", "countries": "China;USA", "abstract": "Local distribution search is used in query-driven visualization for identifying salient features. Due to the high computational and storage costs, local distribution search in multi-field datasets is challenging. In this paper, we introduce two high performance, memory efficient algorithms for searching for local distributions that are characterized by marginal and joint features in multi-field datasets. They leverage bitmap indexing and local voting to efficiently extract regions that match a target distribution, by first approximating search results and refining to generate the final result. The first algorithm, merged-bin-comparison (MBC), reduces the computation of histogram dissimilarity measures by clustering bins. The second algorithm, sampled-active voxels (SAV), adopts stratified sampling to reduce the workload for searching local distributions with large spatial neighborhoods. The efficiency and efficacy of our algorithms are demonstrated in multiple experiments.", "keywords": "", "link": "https://doi.org/10.1109/PACIFICVIS.2017.8031586", "refList": ["10.1109/tvcg.2007.70615", "10.1109/42.668696", "10.1109/tip.2007.902329", "10.1111/j.1467-8659.2011.01959.x", "10.1109/tvcg.2009.25", "10.1145/1291233.1291311", "10.1111/cgf.12620", "10.1115/1.2836727", "10.1109/isbi.2007.356953", "10.1023/b:visi.0000029664.99615.94", "10.1109/svv.1998.729588", "10.1109/tpami.2002.1017616", "10.1007/s10586-014-0360-5", "10.1109/tassp.1979.1163188", "10.1109/icpp.2012.33", "10.1109/tvcg.2015.2467292", "10.1109/tvcg.2006.165", "10.1109/ssdm.2002.1029710", "10.1086/524400", "10.1109/pacificvis.2011.5742378", "10.1007/s005300050125", "10.1109/tvcg.2015.2467952", "10.1109/tvcg.2013.152", "10.1109/tvcg.2006.164", "10.1109/cvpr.2008.4587654", "10.1109/tvcg.2006.100", "10.1115/1.2812968", "10.1109/cvpr.2005.188", "10.1109/tvcg.2015.2467436"], "wos": 1, "children": [{"doi": "10.1109/pacificvis.2018.00016", "year": "2018", "title": "Information Guided Data Sampling and Recovery Using Bitmap Indexing", "conferenceName": "PacificVis", "authors": "Tzu{-}Hsuan Wei;Soumya Dutta;Han{-}Wei Shen", "citationCount": "9", "affiliation": "Wei, TH (Corresponding Author), Ohio State Univ, Columbus, OH 43210 USA.\nWei, Tzu-Hsuan; Dutta, Soumya; Shen, Han-Wei, Ohio State Univ, Columbus, OH 43210 USA.", "countries": "USA", "abstract": "Creating a data representation is a common approach for efficient and effective data management and exploration. The compressed bitmap indexing is one of the emerging data representation used for large-scale data exploration. Performing sampling on the bitmap-indexing based data representation allows further reduction of storage overhead and be more flexible to meet the requirements of different applications. In this paper, we propose two approaches to solve two potential limitations when exploring and visualizing the data using sampling-based bitmap indexing data representation. First, we propose an adaptive sampling approach called information guided stratified sampling (IGStS) for creating compact sampled datasets that preserves the important characteristics of the raw data. Furthermore, we propose a novel data recovery approach to reconstruct the irregular subsampled dataset into a volume dataset with regular grid structure for qualitative post-hoc data exploration and visualization. The quantitative and visual efficacy of our proposed data sampling and recovery approaches are demonstrated through multiple experiments and applications.", "keywords": "", "link": "https://doi.org/10.1109/PacificVis.2018.00016", "refList": ["10.1002/j.1538-7305.1951.tb01366.x", "10.1109/ldav.2011.6092313", "10.1109/tvcg.2009.25", "10.1111/cgf.12620", "10.1109/pacificvis.2017.8031585", "10.1109/tvcg.2016.2534560", "10.1111/j.1467-8659.2011.01964.x", "10.1109/tvcg.2010.132", "10.1109/pacificvis.2017.8031586", "10.1109/tvcg.2010.80", "10.1109/tvcg.2016.2598604", "10.1007/s10586-014-0360-5", "10.1109/icpp.2012.33", "10.1109/pacificvis.2014.60", "10.1002/nav.3800020109", "10.1109/tvcg.2011.246", "10.1109/ssdm.2002.1029710", "10.1109/dcc.1995.515586", "10.1109/mcse.2007.42", "10.1109/pacificvis.2017.8031590", "10.1111/j.1467-8659.2012.03097.x", "10.1109/ldav.2011.6092314", "10.1109/tvcg.2013.152", "10.1145/2462902.2462906", "10.1137/0105003", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2006.100", "10.1115/1.2812968"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934335", "title": "Void-and-Cluster Sampling of Large Scattered Data and Trajectories", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "3", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "We propose a data reduction technique for scattered data based on statistical sampling. Our void-and-cluster sampling technique finds a representative subset that is optimally distributed in the spatial domain with respect to the blue noise property. In addition, it can adapt to a given density function, which we use to sample regions of high complexity in the multivariate value domain more densely. Moreover, our sampling technique implicitly defines an ordering on the samples that enables progressive data loading and a continuous level-of-detail representation. We extend our technique to sample time-dependent trajectories, for example pathlines in a time interval, using an efficient and iterative approach. Furthermore, we introduce a local and continuous error measure to quantify how well a set of samples represents the original dataset. We apply this error measure during sampling to guide the number of samples that are taken. Finally, we use this error measure and other quantities to evaluate the quality, performance, and scalability of our algorithm.", "keywords": "Data reduction,sampling,blue noise,entropy-based sampling,scattered data,pathlines", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934335", "refList": ["10.1145/3281464.3281467", "10.1109/ldav.2014.7013206", "10.1137/0903027", "10.1109/ldav.2011.6092313", "10.1111/cgf.13336", "10.1117/12.152707", "10.1109/tvcg.2014.2350479", "10.1109/pacificvis.2017.8031585", "10.1111/j.1467-8659.2011.01964.x", "10.1145/1556262.1556289", "10.1109/iv.2017.20", "10.1109/tvcg.2016.2598604", "10.1109/tvcg.2010.227", "10.1007/s10586-014-0360-5", "10.1109/tvcg.2018.2864801", "10.1145/1531326.1531392", "10.1145/1278780.1278807", "10.1109/tvcg.2010.148", "10.1016/j.jfluidstructs.2013.08.007", "10.1109/tvcg.2016.2620975", "10.1146/annurev.aa.30.090192.002551", "10.1109/pacificvis.2011.5742372", "10.1109/tvcg.2014.2346324", "10.1109/5.3288", "10.1109/pacificvis.2017.8031590", "10.1109/pacificvis.2018.00016", "10.1109/bigdata.2013.6691717"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/pacificvis48177.2020.1186", "year": "2020", "title": "Distribution-based Particle Data Reduction for In-situ Analysis and Visualization of Large-scale N-body Cosmological Simulations", "conferenceName": "PacificVis", "authors": "Guan Li;Jiayi Xu;Tianchi Zhang;Guihua Shan;Han{-}Wei Shen;Ko{-}Chih Wang;Shihong Liao;Zhonghua Lu", "citationCount": "0", "affiliation": "Shan, GH (Corresponding Author), Chinese Acad Sci, Comp Network Informat Ctr, Beijing, Peoples R China.\nLi, Guan; Shan, Guihua; Lu, Zhonghua, Chinese Acad Sci, Comp Network Informat Ctr, Beijing, Peoples R China.\nLi, Guan; Zhang, Tianchi, Univ Chinese Acad Sci, Beijing, Peoples R China.\nXu, Jiayi; Shen, Han-Wei, Ohio State Univ, Columbus, OH 43210 USA.\nZhang, Tianchi; Liao, Shihong, Chinese Acad Sci, Natl Astron Observ, Beijing, Peoples R China.\nWang, Ko-Chih, Natl Taiwan Normal Univ, Taipei, Taiwan.", "countries": "USA;Taiwan;China", "abstract": "Cosmological N-body simulation is an important tool for scientists to study the evolution of the universe. With the increase of computing power, billions of particles of high space-time fidelity can be simulated by supercomputers. However, limited computer storage can only hold a small subset of the simulation output for analysis, which makes the understanding of the underlying cosmological phenomena difficult. To alleviate the problem, we design an in-situ data reduction method for large-scale unstructured particle data. During the data generation phase, we use a combined k-dimensional partitioning and Gaussian mixture model approach to reduce the data by utilizing probability distributions. We offer a model evaluation criterion to examine the quality of the probabilistic distribution models, which allows us to identify and improve low-quality models. After the in-situ processing, the particle data size is greatly reduced, which satisfies the requirements from the domain experts. By comparing the astronomical attributes and visualizations of the reconstructed data with the raw data, we demonstrate the effectiveness of our in-situ particle data reduction technique.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization", "link": "https://doi.org/10.1109/PacificVis48177.2020.1186", "refList": ["10.1016/j.cag.2003.10.018", "10.1109/tvcg.2010.215", "10.1109/tvcg.2015.2467411", "10.1109/mcg.2009.120", "10.1111/j.2517-6161.1977.tb01600.x", "10.1109/pacificvis.2016.7465273", "10.1051/0004-6361/201321591", "10.1109/pacificvis.2017.8031585", "10.1109/tvcg.2016.2534560", "10.1109/ipdps.2016.11", "10.1111/j.1467-8659.2011.01964.x", "10.1109/pacificvis.2018.00013", "10.1145/3144769.3144776", "10.1186/s40668-017-0021-1", "10.1111/j.1365-2966.2005.09655.x", "10.1145/3139295.3139297", "10.1145/361002.361007", "10.1109/tvcg.2016.2598604", "10.1109/visual.2001.964520", "10.1109/mcg.2010.55", "10.1038/nature03597", "10.1214/aoms/1177728352", "10.1086/152650", "10.1080/10635150490522304", "10.1109/pacificvis.2018.00017", "10.1109/ldav.2012.6378978", "10.1109/pacificvis.2018.00016", "10.1109/ldav.2011.6092178", "10.1109/pacificvis.2015.7156380"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030473", "title": "Data-Driven Space-Filling Curves", "year": "2020", "conferenceName": "SciVis", "authors": "Liang Zhou;Christopher R. Johnson;Daniel Weiskopf", "citationCount": "0", "affiliation": "Zhou, L (Corresponding Author), Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang, Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang; Johnson, Chris R., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Visualizat Res Ctr VLSUS, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "Abstract-We propose a data-driven space-filling curve method for 2D and 3D visualization. Our flexible curve traverses the data elements in the spatial domain in a way that the resulting linearization better preserves features in space compared to existing methods. We achieve such data coherency by calculating a Hamiltonian path that approximately minimizes an objective function that describes the similarity of data values and location coherency in a neighborhood. Our extended variant even supports multiscale data via quadtrees and octrees. Our method is useful in many areas of visualization including multivariate or comparative visualization ensemble visualization of 2D and 3D data on regular grids or multiscale visual analysis of particle simulations. The effectiveness of our method is evaluated with numerical comparisons to existing techniques and through examples of ensemble and multivariate datasets.", "keywords": "Space-filling curves,comparative visualization,ensemble visualization,multivariate visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030473", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1467-8659.2011.01914.x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.1109/tvcg.2019", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2010.176", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 5}, {"doi": "10.1109/pacificvis.2019.00043", "year": "2019", "title": "Statistical Super Resolution for Data Analysis and Visualization of Large Scale Cosmological Simulations", "conferenceName": "PacificVis", "authors": "Ko{-}Chih Wang;Jiayi Xu;Jonathan Woodring;Han{-}Wei Shen", "citationCount": "0", "affiliation": "Wang, KC (Corresponding Author), Ohio State Univ, Columbus, OH 43210 USA.\nWang, Ko-Chih; Xu, Jiayi; Shen, Han-Wei, Ohio State Univ, Columbus, OH 43210 USA.\nWoodring, Jonathan, Los Alamos Natl Lab, Los Alamos, NM USA.", "countries": "USA", "abstract": "Cosmologists build simulations for the evolution of the universe using different initial parameters. By exploring the datasets from different simulation runs, cosmologists can understand the evolution of our universe and approach its initial conditions. A cosmological simulation nowadays can generate datasets on the order of petabytes. Moving datasets from the supercomputers to post data analysis machines is infeasible. We propose a novel approach called statistical super-resolution to tackle the big data problem for cosmological data analysis and visualization. It uses datasets from a few simulation runs to create a prior knowledge, which captures the relation between low- and high-resolution data. We apply in situ statistical down-sampling to datasets generated from simulation runs to minimize the requirements of I/O bandwidth and storage. High-resolution datasets are reconstructed from the statistical down-sampled data by using the prior knowledge for scientists to perform advanced data analysis and render high-quality visualizations.", "keywords": "", "link": "https://doi.org/10.1109/PacificVis.2019.00043", "refList": ["10.1109/visual.2004.110", "10.1016/j.cag.2003.10.018", "10.1109/tvcg.2010.215", "10.1111/cgf.13336", "10.1109/mcg.2009.120", "10.1109/pacificvis.2017.8031585", "10.1109/ipdps.2016.11", "10.1109/pacificvis.2018.00013", "10.1109/pvgs.2003.1249044", "10.1109/chicc.2014.6896189", "10.1016/j.parco.2015.10.005", "10.1109/tip.2010.2050625", "10.1088/0004-637x/765/1/39", "10.1109/tvcg.2016.2598604", "10.1086/163168", "10.1109/visual.2001.964520", "10.1109/tvcg.2014.2346324", "10.1109/pacificvis.2017.8031590", "10.1109/sc.2014.40", "10.1109/pacificvis.2018.00017", "10.1109/ldav.2012.6378978", "10.1016/j.apm.2017.11.036", "10.1109/mcg.2016.48", "10.1002/cpe.2887", "10.1186/s40668-016-0017-2", "10.1109/pacificvis.2018.00016", "10.1109/pacificvis.2015.7156380", "10.1111/j.1467-8659.2009.01690.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030473", "title": "Data-Driven Space-Filling Curves", "year": "2020", "conferenceName": "SciVis", "authors": "Liang Zhou;Christopher R. Johnson;Daniel Weiskopf", "citationCount": "0", "affiliation": "Zhou, L (Corresponding Author), Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang, Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang; Johnson, Chris R., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Visualizat Res Ctr VLSUS, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "Abstract-We propose a data-driven space-filling curve method for 2D and 3D visualization. Our flexible curve traverses the data elements in the spatial domain in a way that the resulting linearization better preserves features in space compared to existing methods. We achieve such data coherency by calculating a Hamiltonian path that approximately minimizes an objective function that describes the similarity of data values and location coherency in a neighborhood. Our extended variant even supports multiscale data via quadtrees and octrees. Our method is useful in many areas of visualization including multivariate or comparative visualization ensemble visualization of 2D and 3D data on regular grids or multiscale visual analysis of particle simulations. The effectiveness of our method is evaluated with numerical comparisons to existing techniques and through examples of ensemble and multivariate datasets.", "keywords": "Space-filling curves,comparative visualization,ensemble visualization,multivariate visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030473", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1467-8659.2011.01914.x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.1109/tvcg.2019", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2010.176", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 5}], "len": 17}], "len": 19}], "len": 21}, {"doi": "10.1111/cgf.13163", "year": "2017", "title": "Global Feature Tracking and Similarity Estimation in Time-Dependent Scalar Fields", "conferenceName": "EuroVis", "authors": "Himangshu Saikia;Tino Weinkauf", "citationCount": "8", "affiliation": "Saikia, H (Corresponding Author), KTH Royal Inst Technol, Stockholm, Sweden.\nSaikia, H.; Weinkauf, T., KTH Royal Inst Technol, Stockholm, Sweden.", "countries": "Sweden", "abstract": "We present an algorithm for tracking regions in time-dependent scalar fields that uses global knowledge from all time steps for determining the tracks. The regions are defined using merge trees, thereby representing a hierarchical segmentation of the data in each time step. The similarity of regions of two consecutive time steps is measured using their volumetric overlap and a histogram difference. The main ingredient of our method is a directed acyclic graph that records all relevant similarity information as follows: the regions of all time steps are the nodes of the graph, the edges represent possible short feature tracks between consecutive time steps, and the edge weights are given by the similarity of the connected regions. We compute a feature track as the global solution of a shortest path problem in the graph. We use these results to steer the - to the best of our knowledge - first algorithm for spatio-temporal feature similarity estimation. Our algorithm works for 2D and 3D time-dependent scalar fields. We compare our results to previous work, showcase its robustness to noise, and exemplify its utility using several real-world data sets.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13163", "refList": ["10.1109/tvcg.2014.2346332", "10.1017/s1743921311007496", "10.1007/s00454-002-2885-2", "10.1111/j.1467-8659.2012.03063.x", "10.1109/tvcg.2003.1207439", "10.1109/iccv.2009.5459199", "10.1109/pacificvis.2014.16", "10.1109/tvcg.2006.16", "10.1155/2016/9875298", "10.1109/tvcg.2011.236", "10.1111/cgf.12360", "10.1023/b:visi.0000029664.99615.94", "10.1109/visual.2003.1250372", "10.1109/2.299407", "10.1111/cgf.12010", "10.1016/j.comgeo.2007.11.001", "10.1016/j.comgeo.2014.10.009", "10.1109/ldav.2015.7348066", "10.1111/1467-8659.00625", "10.1109/2945.597796", "10.1109/ldav.2012.6378962", "10.1111/cgf.12109", "10.1109/tvcg.2011.269", "10.1109/pacificvis.2009.4906833", "10.1109/tvcg.2013.117", "10.1109/tvcg.2010.93", "10.1145/375360.375365", "10.1109/tvcg.2010.198", "10.1109/visual.2004.107", "10.1109/tvcg.2007.70545", "10.1007/978-3-642-15552-9\\_54", "10.1109/tvcg.2007.1053", "10.1109/tvcg.2015.2467436", "10.1109/tvcg.2013.148"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864901", "title": "Visual Analysis of the Temporal Evolution of Ensemble Forecast Sensitivities", "year": "2018", "conferenceName": "VAST", "authors": "Alexander Kumpf;Marc Rautenhaus;Michael Riemer;Rüdiger Westermann", "citationCount": "1", "affiliation": "Kumpf, A (Corresponding Author), Tech Univ Munich, Comp Graph \\& Visualizat Grp, Garching, Germany. Kumpf, Alexander; Rautenhaus, Marc; Westermann, Ruediger, Tech Univ Munich, Comp Graph \\& Visualizat Grp, Garching, Germany. Rautenhaus, Marc, Univ Hamburg, Reg Comp Ctr, Hamburg, Germany. Riemer, Michael, Johannes Gutenberg Univ Mainz, Inst Atmospher Phys, Mainz, Germany.", "countries": "Germany", "abstract": "Ensemble sensitivity analysis (ESA) has been established in the atmospheric sciences as a correlation-based approach to determine the sensitivity of a scalar forecast quantity computed by a numerical weather prediction model to changes in another model variable at a different model state. Its applications include determining the origin of forecast errors and placing targeted observations to improve future forecasts. We - a team of visualization scientists and meteorologists - present a visual analysis framework to improve upon current practice of ESA. We support the user in selecting regions to compute a meaningful target forecast quantity by embedding correlation-based grid-point clustering to obtain statistically coherent regions. The evolution of sensitivity features computed via ESA are then traced through time, by integrating a quantitative measure of feature matching into optical-flow-based feature assignment, and displayed by means of a swipe-path showing the geo-spatial evolution of the sensitivities. Visualization of the internal correlation structure of computed features guides the user towards those features robustly predicting a certain weather event. We demonstrate the use of our method by application to real-world 2D and 3D cases that occurred during the 2016 NAWDEX field campaign, showing the interactive generation of hypothesis chains to explore how atmospheric processes sensitive to each other are interrelated.", "keywords": "Correlation,clustering,tracking,ensemble visualization", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864901", "refList": ["10.1007/3-540-45103-x\\_50", "10.1016/0004-3702(81)90024-2", "10.1109/tvcg.2017.2745178", "10.1002/joc.4408", "10.1175/mwr-d-17-0027.1", "10.1175/bams-d-13-00191.1", "10.1111/cgf.13396", "10.1145/1268517.1268563", "10.1109/tvcg.2006.16", "10.1111/cgf.13163", "10.1109/2.299407", "10.1109/tvcg.2010.253", "10.1109/pacificvis.2009.4906852", "10.1023/b:mach.0000033116.57574.95", "10.1111/j.1467-8659.2012.03095.x", "10.1615/int.j.uncertaintyquantification.2012003934", "10.1175/2007mwr2132.1", "10.1109/ldav.2012.6378962", "10.1109/2945.597796", "10.1007/pl00013399", "10.1109/tvcg.2006.165", "10.1175/1520-0493(2000)129", "10.1109/tvcg.2018.2810068", "10.1109/pacificvis.2009.4906833", "10.1016/j.jcp.2007.02.014", "10.1109/hpdc.2004.1323531", "10.1109/visual.2004.46", "10.1109/tvcg.2017.2779501", "10.1109/pacificvis.2011.5742369", "10.1175/bams-d-14-00259.1", "10.1175/mwr-d-14-00086.1", "10.1175/jas3766.1", "10.1109/tvcg.2017.2743989", "10.1109/tvcg.2015.2498554", "10.1109/tgrs.2012.2227762", "10.5194/gmd-8-2329-2015", "10.1109/tvcg.2013.131", "10.1175/2007mwr1904.1", "10.1109/access.2016.2549182", "10.1175/waf-d-12-00132.1", "10.1175/bams-d-17-0003.1", "10.1002/qj.948", "10.1007/978-3-319-44684-47", "10.1002/qj.3072"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030333", "title": "Interactive Visualization of Atmospheric Effects for Celestial Bodies", "year": "2020", "conferenceName": "SciVis", "authors": "Jonathas Costa;Alexander Bock;Carter Emmart;Charles D. Hansen;Anders Ynnerman;Cláudio T. Silva", "citationCount": "0", "affiliation": "Costa, J (Corresponding Author), NYU, New York, NY 10003 USA. Costa, Jonathas; Silva, Claudio, NYU, New York, NY 10003 USA. Bock, Alexander; Ynnerman, Anders, Linkoping Univ, Linkoping, Sweden. Bock, Alexander; Hansen, Charles; Ynnerman, Anders, Univ Utah, Salt Lake City, UT 84112 USA. Emmart, Carter, Amer Museum Nat Hist, New York, NY 10024 USA.", "countries": "Sweden;USA", "abstract": "We present an atmospheric model tailored for the interactive visualization of planetary surfaces. As the exploration of the solar system is progressing with increasingly accurate missions and instruments, the faithful visualization of planetary environments is gaining increasing interest in space research, mission planning, and science communication and education. Atmospheric effects are crucial in data analysis and to provide contextual information for planetary data. Our model correctly accounts for the non-linear path of the light inside the atmosphere (in Earth's case), the light absorption effects by molecules and dust particles, such as the ozone layer and the Martian dust, and a wavelength-dependent phase function for Mie scattering. The mode focuses on interactivity, versatility, and customization, and a comprehensive set of interactive controls make it possible to adapt its appearance dynamically. We demonstrate our results using Earth and Mars as examples. However, it can be readily adapted for the exploration of other atmospheres found on, for example, of exoplanets. For Earth's atmosphere, we visually compare our results with pictures taken from the International Space Station and against the CIE clear sky model. The Martian atmosphere is reproduced based on available scientific data, feedback from domain experts, and is compared to images taken by the Curiosity rover. The work presented here has been implemented in the OpenSpace system, which enables interactive parameter setting and real-time feedback visualization targeting presentations in a wide range of environments, from immersive dome theaters to virtual reality headsets.", "keywords": "Physical & Environmental Sciences,Engineering,Mathematics,Computer Graphics Techniques", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030333", "refList": ["10.1109/tvcg.2014.2346578", "10.1201/b15025", "10.1109/tvcg.2010.190", "10.1109/vast.2011.6102450", "10.1111/j.0033-0124.1952.45\\_19", "10.1109/afrcon", "10.2312/pe/eurovast/eurova11/045-048", "10.1016/j.paerosci.2005.02.001", "10.1002/grl.50944", "10.1109/tvcg.2013.125", "10.2514/6.2006-7117", "10.1109/mcse.2007.55", "10.1109/tvcg.2018.2864901", "10.1109/mcg.2010.100", "10.1175/1520-0450(1977)016", "10.2307/1269769", "10.5065/d6ww7g29", "10.1109/tvcg.2012.190", "10.1109/ispdc.2012.35", "10.2312/pe/pg/pg2011short/099-103", "10.1109/visual.1993.398859", "10.1111/j.1467-8659.2012.03054.x", "10.1109/tvcg.2014.2346321", "10.1109/afrcon.2013.6757594", "10.1109/tvcg.2017.2779501", "10.1111/j.1467-8659.2012.03184.x", "10.1111/j.0033-0124", "10.2312/pe/pg/pg2011short", "10.1109/tvcg.2014.2346744", "10.25080/majora-92bf1922-00a", "10.1080/13658816.2010.510800", "10.1109/tvcg.2009.170", "10.1109/vast.2009.5333431", "10.1109/tvcg.2008.139", "10.1145/3068335", "10.1111/cgf.13177", "10.1007/s00158-001-0160-4"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030389", "title": "IsoTrotter: Visually Guided Empirical Modelling of Atmospheric Convection", "year": "2020", "conferenceName": "SciVis", "authors": "Juraj Pálenik;Thomas Spengler;Helwig Hauser", "citationCount": "0", "affiliation": "Palenik, J (Corresponding Author), Univ Bergen, Bergen, Norway. Palenik, Juraj; Spengler, Thomas; Hauser, Helwig, Univ Bergen, Bergen, Norway.", "countries": "Norway", "abstract": "Empirical models, fitted to data from observations, are often used in natural sciences to describe physical behaviour and support discoveries. However, with more complex models, the regression of parameters quickly becomes insufficient, requiring a visual parameter space analysis to understand and optimize the models. In this work, we present a design study for building a model describing atmospheric convection. We present a mixed-initiative approach to visually guided modelling, integrating an interactive visual parameter space analysis with partial automatic parameter optimization. Our approach includes a new, semi-automatic technique called IsoTrotting, where we optimize the procedure by navigating along isocontours of the model. We evaluate the model with unique observational data of atmospheric convection based on flight trajectories of paragliders.", "keywords": "visual parameter space exploration,scientific modelling,atmospheric convection", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030389", "refList": ["10.1109/tvcg.2014.2346578", "10.1109/tvcg.2010.190", "10.1109/afrcon", "10.1016/j.actaastro.2013.08.020", "10.1016/j.paerosci.2005.02.001", "10.1002/grl.50944", "10.1109/tvcg.2013.125", "10.1109/mcse.2007.55", "10.1007/s11214-014-0079-x", "10.1109/tvcg.2018.2864901", "10.1109/mcg.2010.100", "10.1175/1520-0450(1977)016", "10.1111/cgf.12933", "10.2307/1269769", "10.5065/d6ww7g29", "10.1109/tvcg.2012.190", "10.1016/s0167-2789(00)00199-8", "10.1109/visual.1993.398859", "10.1111/j.1467-8659.2012.03054.x", "10.1109/tvcg.2014.2346321", "10.1109/afrcon.2013.6757594", "10.1007/978-3-540-88606-8\\_11", "10.1109/tvcg.2017.2779501", "10.1111/j.1467-8659.2012.03184.x", "10.1016/j.actaastro.2013.11.019", "10.25080/majora-92bf1922-00a", "10.1016/j.actaastro.2017.11.004", "10.1080/13658816.2010.510800", "10.1109/tvcg.2009.170", "10.1109/tvcg.2008.139", "10.2312/pe/eur0vas", "10.1145/3068335", "10.1111/cgf.13177", "10.1007/s00158-001-0160-4"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13731", "year": "2019", "title": "The State of the Art in Visual Analysis Approaches for Ocean and Atmospheric Datasets", "conferenceName": "EuroVis", "authors": "Shehzad Afzal;Mohamad Mazen Hittawe;Sohaib Ghani;Tahira Jamil;Omar M. Knio;Markus Hadwiger;Kevin I.{-}J. Ho", "citationCount": "0", "affiliation": "Afzal, S (Corresponding Author), King Abdullah Univ Sci \\& Technol, Thuwal, Saudi Arabia.\nAfzal, S.; Hittawe, M. M.; Ghani, S.; Jamil, T.; Knio, O.; Hadwiger, M.; Hoteit, I, King Abdullah Univ Sci \\& Technol, Thuwal, Saudi Arabia.", "countries": "Arabia", "abstract": "The analysis of ocean and atmospheric datasets offers a unique set of challenges to scientists working in different application areas. These challenges include dealing with extremely large volumes of multidimensional data, supporting interactive visual analysis, ensembles exploration and visualization, exploring model sensitivities to inputs, mesoscale ocean features analysis, predictive analytics, heterogeneity and complexity of observational data, representing uncertainty, and many more. Researchers across disciplines collaborate to address such challenges, which led to significant research and development advances in ocean and atmospheric sciences, and also in several relevant areas such as visualization and visual analytics, big data analytics, machine learning and statistics. In this report, we perform an extensive survey of research advances in the visual analysis of ocean and atmospheric datasets. First, we survey the task requirements by conducting interviews with researchers, domain experts, and end users working with these datasets on a spectrum of analytics problems in the domain of ocean and atmospheric sciences. We then discuss existing models and frameworks related to data analysis, sense-making, and knowledge discovery for visual analytics applications. We categorize the techniques, systems, and tools presented in the literature based on the taxonomies of task requirements, interaction methods, visualization techniques, machine learning and statistical methods, evaluation methods, data types, data dimensions and size, spatial scale and application areas. We then evaluate the task requirements identified based on our interviews with domain experts in the context of categorized research based on our taxonomies, and existing models and frameworks of visual analytics to determine the extent to which they fulfill these task requirements, and identify the gaps in current research. In the last part of this report, we summarize the trends, challenges, and opportunities for future research in this area. (see http://www.acm.org/about/class/class/2012) )", "keywords": "", "link": "https://doi.org/10.1111/cgf.13731", "refList": ["10.1111/cgf.12898", "10.1109/icdmw.2009.55", "10.1109/tvcg.2013.144", "10.1109/tvcg.2015.2467754", "10.1109/tvcg.2015.2507569", "10.1109/tvcg.2014.2346455", "10.1111/cgf.12901", "10.1109/tvcg.2008.184", "10.1109/mc.2013.119", "10.1111/j.1467-8659.2009.01697.x", "10.1109/tvcg.2009.200", "10.1111/cgf.12649", "10.1109/2945.981847", "10.1109/tvcg.2014.2346481", "10.1109/tvcg.2012.190", "10.1109/mis.2006.75", "10.1109/iv.2015.13", "10.1111/cgf.12135", "10.1109/vast.2009.5332586", "10.1109/pacificvis.2011.5742369", "10.1109/tvcg.2008.131", "10.1109/tvcg.2013.131", "10.1109/tvcg.2010.82", "10.1109/pacificvis.2015.7156374", "10.1111/cgf.12886", "10.1109/tvcg.2016.2598869", "10.1109/vast.2012.6400553", "10.1109/pacificvis.2013.6596144", "10.1109/tvcg.2017.2745178", "10.1109/tvcg.2015.2410278", "10.1111/cgf.12931", "10.1109/tvcg.2009.155", "10.1109/pacificvis.2015.7156366", "10.1109/mcg.2015.121", "10.1007/978-1-4471-2804-5\\_6", "10.1109/ldav.2015.7348068", "10.1007/978-1-4471-6497-5\\_1", "10.1109/pacificvis.2009.4906852", "10.1111/cgf.12646", "10.1109/tvcg.2016.2607204", "10.1109/tvcg.2011.162", "10.1177/1473871612465214", "10.1109/mcg.2017.3621228", "10.1109/tvcg.2012.110", "10.1109/sc.2014.40", "10.5194/gmd-8-2329-2015", "10.1109/tvcg.2012.80", "10.1109/tvcg.2014.2346448", "10.1109/ldav.2012.6378978", "10.1007/s10915-011-9501-7", "10.1109/tvcg.2016.2598830", "10.1109/tvcg.2007.70515", "10.1109/vast.2011.6102460", "10.1109/pacificvis.2017.8031584", "10.1109/tvcg.2016.2637904", "10.1175/2009jtecha1374.1", "10.1109/tvcg.2015.2467591", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2008.59", "10.1109/tvcg.2013.143", "10.1109/tvcg.2008.119", "10.1109/tvcg.2015.2467411", "10.1109/icdmw.2009.91", "10.1109/tvcg.2016.2598868", "10.1109/tvcg.2017.2661309", "10.1109/vl.1996.545307", "10.1109/tvcg.2007.70523", "10.1109/tvcg.2008.140", "10.1109/icra.2012.6224689", "10.1109/tvcg.2010.80", "10.1167/tvst.7.1.16", "10.1109/pacificvis.2018.00037", "10.1111/cgf.13210", "10.1109/tvcg.2017.2698041", "10.1109/iv.2010.51", "10.1109/tvcg.2016.2640960", "10.1109/tvcg.2010.170", "10.1103/physrevd.71.077102", "10.5194/npg-22-545-2015", "10.1109/tvcg.2014.2307892", "10.1111/cgf.12650", "10.1109/iv.2009.38", "10.2312/pe.envirvis.envirvis13.053-057", "10.1145/3122948.3122952", "10.1109/ldav.2014.7013208", "10.1038/nature14956", "10.1109/vast.2015.7347671", "10.1109/vast.2015.7347634", "10.1109/tvcg.2014.2346755", "10.1177/1473871613481692", "10.1109/ldav.2017.8231849", "10.1109/tvcg.2017.2773071", "10.1109/iv.2011.79", "10.1109/tvcg.2013.10", "10.1109/tvcg.2008.157", "10.1111/j.1467-8659.2009.01664.x", "10.1109/pacificvis.2016.7465251", "10.1109/vast.2014.7042489", "10.1109/mis.2006.100", "10.1109/tvcg.2010.247", "10.1109/tvcg.2016.2534560", "10.1109/tvcg.2010.181", "10.1109/tvcg.2018.2864817", "10.1109/vast.2015.7347635", "10.1109/tvcg.2018.2864901", "10.1109/hicss.2016.183", "10.1109/iv.2010.32", "10.1111/j.1467-8659.2011.01948.x", "10.1109/tvcg.2017.2743989", "10.1109/pacificvis.2016.7465272", "10.1109/tvcg.2008.69", "10.1109/tvcg.2008.139", "10.1109/iv.2011.12", "10.1111/cgf.12520"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030466", "title": "Uncertainty in Continuous Scatterplots, Continuous Parallel Coordinates, and Fibers", "year": "2020", "conferenceName": "SciVis", "authors": "Boyan Zheng;Filip Sadlo", "citationCount": "0", "affiliation": "Zheng, BY (Corresponding Author), Heidelberg Univ, Heidelberg, Germany. Zheng, Boyan; Sadlo, Filip, Heidelberg Univ, Heidelberg, Germany.", "countries": "Germany", "abstract": "In this paper, we introduce uncertainty to continuous scatterplots and continuous parallel coordinates. We derive respective models, validate them with sampling-based brute-force schemes, and present acceleration strategies for their computation. At the same time, we show that our approach lends itself as well for introducing uncertainty into the definition of fibers in bivariate data. Finally, we demonstrate the properties and the utility of our approach using specifically designed synthetic cases and simulated data.", "keywords": "Multivariate data,uncertainty visualization,uncertain continuous scatterplots,uncertain continuous parallel coordinates,uncertain fibers", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030466", "refList": ["10.1109/tvcg.2018.2865193", "10.1109/tvcg.2013.143", "10.1109/tvcg.2015.2467204", "10.1109/pacificvis.2013.6596144", "10.1109/tvcg.2017.2745178", "10.1109/tmm.2016.2614227", "10.1109/scivis.2015.7429488", "10.1111/cgf.12100", "10.1109/pacificvis.2016.7465251", "10.1111/cgf.12898", "10.1109/tvcg.2015.2410278", "10.1109/icdmw.2009.55", "10.1109/tvcg.2015.2467754", "10.1109/tvcg.2010.247", "10.1109/tvcg.2019.2934312", "10.1111/cgf.13397", "10.1109/tvcg.2016.2598868", "10.1111/j.1467-8659.2011.01944.x", "10.1109/tvcg.2015.2507569", "10.1109/tvcg.2013.92", "10.1145/1268517.1268563", "10.1109/tvcg.2014.2346455", "10.1109/tvcg.2010.181", "10.1109/tvcg.2018.2853721", "10.1109/tvcg.2008.140", "10.1007/s12650-015-0341-7", "10.1109/mcg.2014.52", "10.1109/tvcg.2018.2864815", "10.1111/j.1467-8659.2012.03095.x", "10.1109/tvcg.2013.138", "10.1109/tvcg.2019.2934242", "10.3390/e20070540", "10.1016/j.jcp.2007.02.014", "10.1111/cgf.13999", "10.1109/tvcg.2017.2779501", "10.1111/cgf.12390", "10.1109/tvcg.2014.2307892", "10.1111/cgf.13531", "10.1109/tvcg.2013.152", "10.1038/nature14956", "10.1007/978-3-540-88606-8\\_4", "10.1109/mcg.2005.71", "10.1111/j.1467-8659.2011.01942.x", "10.1109/tvcg.2019.2934800", "10.1109/tvcg.2016.2598830", "10.1109/cvpr.2005.188", "10.1109/tvcg.2011.261", "10.1111/cgf.13731", "10.1109/tvcg.2017.2754480"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 9}, {"doi": "10.1109/tvcg.2019.2934310", "title": "Extraction and Visual Analysis of Potential Vorticity Banners around the Alps", "year": "2019", "conferenceName": "SciVis", "authors": "Robin Bader;Michael Sprenger;Nikolina Ban;Stefan Rüdisühli;Christoph Schär;Tobias Günther", "citationCount": "0", "affiliation": "Bader, R (Corresponding Author), Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland. Bader, Robin; Guenther, Tobias, Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland. Sprenger, Michael; Ban, Nikolina; Ruedisuehli, Stefan; Schaer, Christoph, Swiss Fed Inst Technol, Inst Atmospher \\& Climate Sci, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "Potential vorticity is among the most important scalar quantities in atmospheric dynamics. For instance, potential vorticity plays a key role in particularly strong wind peaks in extratropical cyclones and it is able to explain the occurrence of frontal rain bands. Potential vorticity combines the key quantities of atmospheric dynamics, namely rotation and stratification. Under suitable wind conditions elongated banners of potential vorticity appear in the lee of mountains. Their role in atmospheric dynamics has recently raised considerable interest in the meteorological community for instance due to their influence in aviation wind hazards and maritime transport. In order to support meteorologists and climatologists in the analysis of these structures, we developed an extraction algorithm and a visual exploration framework consisting of multiple linked views. For the extraction we apply a predictor-corrector algorithm that follows streamlines and realigns them with extremal lines of potential vorticity. Using the agglomerative hierarchical clustering algorithm, we group banners from different sources based on their proximity. To visually analyze the time-dependent banner geometry, we provide interactive overviews and enable the query for detail on demand, including the analysis of different time steps, potentially correlated scalar quantities, and the wind vector field. In particular, we study the relationship between relative humidity and the banners for their potential in indicating the development of precipitation. Working with our method, the collaborating meteorologists gained a deeper understanding of the three-dimensional processes, which may spur follow-up research in the future.", "keywords": "Scientific Visualization,potential vorticity,meteorology,feature extraction", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934310", "refList": ["10.1002/qj.49710042520", "10.1111/j.1467-8659.2009.01702.x", "10.1111/cgf.13319", "10.1175/1520-0469(1998)055", "10.1007/bf01475602", "10.1143/jpsj.66.1331", "10.1109/tvcg.2013.2297914", "10.1007/978-3-540-88606-8\\_6", "10.1175/1520-0477(2001)082", "10.1175/mwr-d-16-0042.1", "10.1007/s00703-001-0592-9", "10.1002/qj.49710544615", "10.1111/cgf.13163", "10.1007/bf01446807", "10.1109/visual.1994.346327", "10.1109/visual.1999.809896", "10.1109/tvcg.2011.78", "10.1109/tvcg.2015.2467200", "10.2514/2.744", "10.1145/1013208.1013209", "10.1007/978-3", "10.1111/cgf.12933", "10.1175/1520-0477(2002)083", "10.1007/978-94-015-8765-5", "10.1175/2011mwr3504.1", "10.1007/s007030170008", "10.5194/gmd-9-3393-2016", "10.1175/bams-d-15-00299.1", "10.1002/2014gl062588", "10.1256/smsqj.47001", "10.1175/2010mwr3334.1", "10.1109/tvcg.2017.2779501", "10.1256/qj.02.47", "10.1111/cgf.13439", "10.5194/gmd-2017-230", "10.1109/visual.2003.1250376", "10.14529/jsfi140103", "10.1109/tvcg.2017.2743989", "10.1109/tvcg.2007.70545", "10.1111/j.1467-8659.2003.00723.x", "10.1109/tvcg.2007.1053", "10.1002/qj.828", "10.1002/2016jd026013", "10.1007/bf01450097"], "wos": 1, "children": [], "len": 1}], "len": 13}], "len": 37}, "index": 14, "embedding": [-1.3444408178329468, 0.2651815116405487, -1.0434188842773438, -0.2674911320209503, -0.5313926935195923, 0.16650904715061188, 2.6441094875335693, 1.6173484325408936, 3.8647820949554443, 0.20739415287971497, 1.8849369287490845, -0.8463419675827026, 0.9658738970756531, 2.739932060241699, -0.9109163880348206, 0.2315310686826706, -0.24351109564304352, 0.05552856996655464, -0.17125335335731506, 3.562692403793335, -0.06630208343267441, 1.7651766538619995, 0.5887921452522278, 0.9949700832366943, -2.3623714447021484, 4.162659645080566, -0.5581337213516235, -0.20058391988277435, 0.14583046734333038, -2.818840503692627, 0.4475787580013275, 0.19792440533638], "projection": [-8.241235733032227, 22.71095085144043], "size": 19, "height": 6, "width": 5}