{"data": {"doi": "10.1109/pacificvis.2016.7465279", "year": "2016", "title": "A design study of personal bibliographic data visualization", "conferenceName": "PacificVis", "authors": "Tsai{-}Ling Fung;Jia{-}Kai Chou;Kwan{-}Liu Ma", "citationCount": "4", "affiliation": "Fung, TL (Corresponding Author), Univ Calif Davis, Davis, CA 95616 USA.\nFung, Tsai-Ling; Chou, Jia-Kai; Ma, Kwan-Liu, Univ Calif Davis, Davis, CA 95616 USA.", "countries": "USA", "abstract": "This paper presents a comparative study on personal visualizations of bibliographic data. We consider three designs for egocentric visualization: node-link diagrams, adjacency matrices, and botanical trees to depict one's academic career in terms of his/her publication records. Case studies are conducted to compare the effectiveness of resulting visualizations for conveying particular aspect of a researcher's bibliographic records. Based on our study, we find that node-link diagrams are better at revealing the overall distribution of certain attributes; adjacency matrices can convey more information with less clutter; and botanical trees are visually attractive and provide the best at a glance characterization of the mapped data, but mapping data to tree features must be carefully done to derive expressive visualization.", "keywords": "", "link": "https://doi.org/10.1109/PACIFICVIS.2016.7465279", "refList": ["10.1109/tvcg.2007.70582", "10.1111/j.1467-8659.2011.01921.x", "10.1109/infvis.2001.963285", "10.1109/tvcg.2006.160", "10.1057/palgrave.ivs.9500049", "10.1145/1979742.1979882", "10.1109/cadcg.2009.5246813", "10.1007/3-540-44541-2\\_18", "10.1109/visual.1999.809927", "10.1371/journal.pone.0146368", "10.1109/mcg.2015.51", "10.1109/mcg.2015.71", "10.1145/2207676.2208600", "10.1109/mcg.2015.74", "10.1109/infvis.2004.1"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2865022", "title": "VIS Author Profiles: Interactive Descriptions of Publication Records Combining Text and Visualization", "year": "2018", "conferenceName": "VAST", "authors": "Shahid Latif;Fabian Beck", "citationCount": "5", "affiliation": "Latif, S (Corresponding Author), Univ Duisburg Essen, Paluno, Duisburg, Germany. Latif, Shahid; Beck, Fabian, Univ Duisburg Essen, Paluno, Duisburg, Germany.", "countries": "Germany", "abstract": "Publication records and collaboration networks are important for assessing the expertise and experience of researchers. Existing digital libraries show the raw publication lists in author profiles, whereas visualization techniques focus on specific subproblems. Instead, we look at publication records from various perspectives mixing low-level publication data with high-level abstractions and background information. This work presents VIS Author Profiles, a novel approach to generate integrated textual and visual descriptions to highlight patterns in publication records. We leverage template-based natural language generation to summarize notable publication statistics, evolution of research topics, and collaboration relationships. Seamlessly integrated visualizations augment the textual description and are interactively connected with each other and the text. The underlying publication data and detailed explanations of the analysis are available on demand. We compare our approach to existing systems by taking into account information needs of users and demonstrate its usefulness in two realistic application examples.", "keywords": "Natural language generation,document visualization,interactive documents,sparklines,digital libraries", "link": "http://dx.doi.org/10.1109/TVCG.2018.2865022", "refList": ["10.1109/tvcg.2007.70582", "10.1109/tvcg.2014.2346435", "10.4304/jetwi.4.1.3-14", "10.1109/tvcg.2015.2467757", "10.1109/tvcg.2016.2610422", "10.1057/palgrave.ivs.9500156", "10.1016/0004-3702(93)90022-4", "10.1109/tvcg.2013.167", "10.3138/chr.694", "10.1109/tvcg.2012.252", "10.1007/978-94-009-7798-3\\_15", "10.1109/tvcg.2015.2468151", "10.1109/vissoft.2017.11", "10.1109/pacificvis.2016.7465279", "10.1109/tvcg.2017.2674958", "10.1109/icvrv.2016.88", "10.1109/tvcg.2015.2465151", "10.1145/2470654.2481374", "10.1613/jair.5477", "10.1109/tfuzz.2014.2328011", "10.1145/3025453.3025631", "10.1007/978-3-642-59830-2", "10.1109/tvcg.2014.2383380", "10.1162/coli\\_a\\_00091", "10.1063/1.4975416", "10.1109/cgiv.2006.20", "10.1002/int.21835", "10.1109/vast.2015.7347632", "10.1145/642611.642681", "10.1145/3173574.3174012", "10.2312/eurovisshort.20181084"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934669", "title": "Exploranative Code Quality Documents", "year": "2019", "conferenceName": "VAST", "authors": "Haris Mumtaz;Shahid Latif;Fabian Beck;Daniel Weiskopf", "citationCount": "0", "affiliation": "Mumtaz, H (Corresponding Author), Univ Stuttgart, VISUS, Stuttgart, Germany. Mumtaz, Haris; Weiskopf, Daniel, Univ Stuttgart, VISUS, Stuttgart, Germany. Latif, Shahid; Beck, Fabian, Univ Duisburg Essen, Paluno, Duisburg, Germany.", "countries": "Germany", "abstract": "Good code quality is a prerequisite for efficiently developing maintainable software. In this paper, we present a novel approach to generate exploranative (explanatory and exploratory) data-driven documents that report code quality in an interactive, exploratory environment. We employ a template-based natural language generation method to create textual explanations about the code quality, dependent on data from software metrics. The interactive document is enriched by different kinds of visualization, including parallel coordinates plots and scatterplots for data exploration and graphics embedded into text. We devise an interaction model that allows users to explore code quality with consistent linking between text and visualizations; through integrated explanatory text, users are taught background knowledge about code quality aspects. Our approach to interactive documents was developed in a design study process that included software engineering and visual analytics experts. Although the solution is specific to the software engineering scenario, we discuss how the concept could generalize to multivariate data and report lessons learned in a broader scope.", "keywords": "Code quality,interactive documents,natural language generation,sparklines", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934669", "refList": ["10.1109/tvcg.2014.2346435", "10.1109/tvcg.2018.2865022", "10.1016/j.jvlc.2018.10.001", "10.1002/smr.521", "10.1109/tvcg.2006.69", "10.1016/0004-3702(93)90022-4", "10.1145/3173574.3174106", "10.1007/s10648-010-9136-5", "10.3115/974557.974594", "10.1109/vl.1996.545307", "10.1109/tse.1976.233837", "10.1109/vissoft.2018.00010", "10.2312/vissym/vissym04/261-266", "10.1046/j.1365-2575.2002.00117.x", "10.1109/wcre.2002.1173068", "10.1109/icpc.2013.6613830", "10.1145/1985362.1985365", "10.3115/v1/w14-4401", "10.1007/s00766-007-0054-0", "10.1109/vissoft.2017.11", "10.1007/s10515-011-0098-8", "10.1109/vissof.2011", "10.1109/tvcg.2017.2674958", "10.1002/smr.404", "10.1109/32.979986", "10.1016/b978-0-12-397174-6.00010-6", "10.1145/3242587.3242617", "10.1109/mcg.2018.032421649", "10.1613/jair.5477", "10.1109/tfuzz.2014.2328011", "10.1145/2095654.2095665", "10.1109/icpc.2013.6613834", "10.1109/tvcg.2018.2865145", "10.1145/2597008.2597149", "10.1109/live.2013.6617345", "10.1145/1985793.1985868", "10.1002/int.21835", "10.1145/3139295.3139312", "10.1109/32.295895", "10.1109/scam.2014.14", "10.5281/zenodo.3336019", "10.1016/j.visinf.2019.03.004", "10.1109/aswec.2010.18", "10.2312/eurovisshort.20181084"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934667", "title": "Galex: Exploring the Evolution and Intersection of Disciplines", "year": "2019", "conferenceName": "VAST", "authors": "Zeyu Li;Changhong Zhang;Shichao Jia;Jiawan Zhang", "citationCount": "0", "affiliation": "Zhang, JW (Corresponding Author), Tianjin Univ, Coll Intelligence \\& Comp, Tianjin, Peoples R China. Zhang, JW (Corresponding Author), State Adm Cultural Heritage, Tianjin Cultural Heritage Conservat \\& Inheritance, Beijing, Peoples R China. Zhang, JW (Corresponding Author), State Adm Cultural Heritage, Key Res Ctr Surface Monitoring \\& Anal Rel, Beijing, Peoples R China. Li, Zeyu; Zhang, Changhong; Jia, Shichao; Zhang, Jiawan, Tianjin Univ, Coll Intelligence \\& Comp, Tianjin, Peoples R China. Zhang, Jiawan, State Adm Cultural Heritage, Tianjin Cultural Heritage Conservat \\& Inheritance, Beijing, Peoples R China. Zhang, Jiawan, State Adm Cultural Heritage, Key Res Ctr Surface Monitoring \\& Anal Rel, Beijing, Peoples R China.", "countries": "China", "abstract": "Revealing the evolution of science and the intersections among its sub-fields is extremely important to understand the characteristics of disciplines, discover new topics, and predict the future. The current work focuses on either building the skeleton of science, lacking interaction, detailed exploration and interpretation or on the lower topic level, missing high-level macro-perspective. To fill this gap, we design and implement Galaxy Evolution Explorer (Galex), a hierarchical visual analysis system, in combination with advanced text mining technologies, that could help analysts to comprehend the evolution and intersection of one discipline rapidly. We divide Galex into three progressively fine-grained levels: discipline, area, and institution levels. The combination of interactions enables analysts to explore an arbitrary piece of history and an arbitrary part of the knowledge space of one discipline. Using a flexible spotlight component, analysts could freely select and quickly understand an exploration region. A tree metaphor allows analysts to perceive the expansion, decline, and intersection of topics intuitively. A synchronous spotlight interaction aids in comparing research contents among institutions easily. Three cases demonstrate the effectiveness of our system.", "keywords": "Science evolution,science mapping,interdisciplinary,knowledge domain visualization,visual analysis", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934667", "refList": ["10.1109/pacificvis.2010.5429590", "10.1109/tvcg.2016.2615308", "10.1007/s11192-005-0255-6", "10.1109/tvcg.2018.2865022", "10.1109/vast.2016.7883507", "10.1145/1456650.1456652", "10.1109/vast.2009.5333443", "10.1002/asi.20991", "10.1109/pacificvis.2014.47", "10.1111/cgf.12376", "10.1371/journal.pone.0018209", "10.1007/s11192-011-0428-4", "10.1109/tvcg.2016.2610422", "10.1016/0306-4573(88)90021-0", "10.1016/j.respol.2014.02.005", "10.1002/asi.20317", "10.1109/visual.1996.568118", "10.14778/2735508.2735519", "10.1007/s11192-009-0146-3", "10.1109/tvcg.2013.167", "10.1007/978-3-642-37456-2\\_14", "10.1109/tvcg.2015.2467621", "10.1145/2089094.2089101", "10.1109/vl.1996.545307", "10.1111/cgf.12871", "10.1002/asi.22652", "10.1109/mcg.2011.91", "10.1371/journal.pone.0008694", "10.1145/1056808.1057069", "10.1126/science.1237825", "10.1145/2207676.2207738", "10.1023/a:1008690008856", "10.1073/pnas.0307654100", "10.1109/tvcg.2013.162", "10.1109/tvcg.2016.2598827", "10.1109/tvcg.2011.239", "10.1145/2740908.2742760", "10.1109/icdm.2014.24", "10.1179/000870403235002042", "10.1137/1.9781611972801.37", "10.1109/2945.981848", "10.1002/asi.22990", "10.1109/vast.2014.7042494", "10.1109/infvis.1995.528686", "10.1515/secm-2017-0114", "10.1145/2872427.2883041", "10.1126/science.aao0185", "10.1002/asi.10227", "10.1057/palgrave.ivs.9500180", "10.1109/vast.2012.6400485", "10.1145/2362364.2362367", "10.1002/aris.1440370106", "10.1016/j.joi.2014.07.006", "10.1073/pnas.0307626100", "10.1126/science.aaf5239", "10.3115/1117729.1117730", "10.1007/s12650-015-0323-9", "10.1073/pnas.0307513100"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/vast47406.2019.8986934", "title": "Influence Flowers of Academic Entities", "year": "2019", "conferenceName": "VAST", "authors": "Minjeong Shin;Alexander Soen;Benjamin T. Readshaw;Stephen M. Blackburn;Mitchell Whitelaw;Lexing Xie", "citationCount": "0", "affiliation": "Shin, M (Corresponding Author), Australian Natl Univ, Canberra, ACT, Australia. Shin, Minjeong; Soen, Alexander; Readshaw, Benjamin T.; Blackburn, Stephen M.; Whitelaw, Mitchell; Xie, Lexing, Australian Natl Univ, Canberra, ACT, Australia.", "countries": "Australia", "abstract": "We present the Influence Flower, a new visual metaphor for the influence profile of academic entities, including people, projects, institutions, conferences, and journals. While many tools quantify influence, we aim to expose the flow of influence between entities. The Influence Flower is an ego-centric graph, with a query entity placed in the centre. The petals are styled to reflect the strength of influence to and from other entities of the same or different type. For example, one can break down the incoming and outgoing influences of a research lab by research topics. The Influence Flower uses a recent snapshot of Microsoft Academic Graph, consisting of 212 million authors, their 176 million publications, and 1.2 billion citations. An interactive web app, Influence Map, is constructed around this central metaphor for searching and curating visualisations. We also propose a visual comparison method that highlights change in influence patterns over time. We demonstrate through several case studies that the Influence Flower supports data-driven inquiries about the following: researchers' careers over time; paper(s) and projects, including those with delayed recognition; the interdisciplinary profile of a research institution; and the shifting topical trends in conferences. We also use this tool on influence data beyond academic citations, by contrasting the academic and Twitter activities of a researcher.", "keywords": "Human-centered computing,Visualization,Visualisation application domains,Visual analytics,Visualization systems and tools,Empirical studies in visualization", "link": "http://dx.doi.org/10.1109/VAST47406.2019.8986934", "refList": ["10.1109/tvcg.2018.2865022", "10.4304/jetwi.4.1.3-14", "10.1145/3132744", "10.1007/s11192-017-2454-3", "10.1057/palgrave.ivs.9500156", "10.1038/504211a", "10.1145/1401890.1402008", "10.1371/journal.pbio.1002542", "10.1109/tvcg.2011.185", "10.1002/asi.20317", "10.1016/0370-2693(86)90375-8", "10.1109/tvcg.2012.252", "10.1038/s41467-018-07034-y", "10.1145/3332803", "10.1038/550029a", "10.1145/1056808.1057069", "10.1109/tvcg.2015.2468151", "10.1523/jneurosci.0003-08.2008", "10.1007/s11192-017-2535-3", "10.1109/pacificvis.2016.7465279", "10.1038/s41586-019-0941-9", "10.1111/j.1467-8659.2011.01921.x", "10.1109/tvcg.2015.2465151", "10.1007/s11192-017-2247-8", "10.1145/2740908.2742839", "10.1007/s11192-011-0436-4", "10.1126/science.aao0185", "10.1109/tvcg.2014.2383380", "10.1073/pnas.1424329112", "10.1007/s11192-005-0281-4", "10.1145/2858036.2858488", "10.1023/b:scie.0000018543.82441.f1", "10.1109/vast.2015.7347632", "10.1126/science.aaf5239", "10.1145/2500892", "10.1073/pnas.0706851105", "10.1073/pnas.0307513100", "10.1038/520429a"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030465", "title": "Visual Causality Analysis of Event Sequence Data", "year": "2020", "conferenceName": "VAST", "authors": "Zhuochen Jin;Shunan Guo;Nan Chen;Daniel Weiskopf;David Gotz;Nan Cao", "citationCount": "0", "affiliation": "Cao, N (Corresponding Author), Tongji Univ, IDVx Lab, Shanghai, Peoples R China. Jin, Zhuochen; Guo, Shunan; Chen, Nan; Cao, Nan, Tongji Univ, IDVx Lab, Shanghai, Peoples R China. Weiskopf, Daniel, Univ Stuttgart, Stuttgart, Germany. Gotz, David, Univ N Carolina, Chapel Hill, NC 27515 USA.", "countries": "USA;Germany;China", "abstract": "Causality is crucial to understanding the mechanisms behind complex systems and making decisions that lead to intended outcomes. Event sequence data is widely collected from many real-world processes, such as electronic health records, web clickstreams, and financial transactions, which transmit a great deal of information reflecting the causal relations among event types. Unfortunately, recovering causalities from observational event sequences is challenging, as the heterogeneous and high-dimensional event variables are often connected to rather complex underlying event excitation mechanisms that are hard to infer from limited observations. Many existing automated causal analysis techniques suffer from poor explainability and fail to include an adequate amount of human knowledge. In this paper, we introduce a visual analytics method for recovering causalities in event sequence data. We extend the Granger causality analysis algorithm on Hawkes processes to incorporate user feedback into causal model refinement. The visualization system includes an interactive causal analysis framework that supports bottom-up causal exploration, iterative causal verification and refinement, and causal comparison through a set of novel visualizations and interactions. We report two forms of evaluation: a quantitative evaluation of the model improvements resulting from the user-feedback mechanism, and a qualitative evaluation through case studies in different application domains to demonstrate the usefulness of the system.", "keywords": "Event sequence data,causality analysis,visual analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030465", "refList": ["10.5555/1642718", "10.1109/tvcg.2018.2865022", "10.5555/2074094.2074151", "10.1109/tvcg.2016.2618797", "10.1073/pnas.1320645111", "10.1109/tvcg.2017.2744843", "10.1109/iv.2017.69", "10.1109/tvcg.2019.2934399", "10.1145/3172944.3173007", "10.5555/1795555", "10.1109/mcg.2005.102", "10.1145/381641.381653", "10.1162/153244301753344614", "10.1111/cgf.14034", "10.1111/cgf.13198", "10.1017/cbo9780511519857", "10.1007/s10462-016-9475-9", "10.1075/ssol.2.2.07bor", "10.1007/978-1-4614-3223-4\\_3", "10.1109/infvis.2003.1249025", "10.1007/978-94-007-6094-313", "10.1145/2858036.2858387", "10.1109/tvcg.2007.70528", "10.1109/tvcg.2017.2674958", "10.1147/sj.454.0801", "10.1109/tvcg.2013.119", "10.1145/3173574.3173711", "10.1016/j.erss.2017.06.034", "10.1109/visual.2019.8933695", "10.1007/s11665-016-2173-6", "10.1016/0377-0427(87)90125-7", "10.2307/3601125", "10.1016/b978-0-444-88738-2.50018-x", "10.1109/mcg.2006.70", "10.1109/tvcg.2018.2865145", "10.1017/s1351324997001502", "10.1109/tvcg.2010.179", "10.1214/aos/1176344552", "10.1109/mcg.2009.22", "10.1007/978-3-319-26633-6\\_13", "10.1080/10447318.2014.905422", "10.1016/j.visinf.2019.03.004", "10.1057/palgrave.ivs.9500074", "10.1007/978-1-4614-3223-4"], "wos": 1, "children": [], "len": 1}], "len": 9}, {"doi": "10.1109/vast47406.2019.8986934", "title": "Influence Flowers of Academic Entities", "year": "2019", "conferenceName": "VAST", "authors": "Minjeong Shin;Alexander Soen;Benjamin T. Readshaw;Stephen M. Blackburn;Mitchell Whitelaw;Lexing Xie", "citationCount": "0", "affiliation": "Shin, M (Corresponding Author), Australian Natl Univ, Canberra, ACT, Australia. Shin, Minjeong; Soen, Alexander; Readshaw, Benjamin T.; Blackburn, Stephen M.; Whitelaw, Mitchell; Xie, Lexing, Australian Natl Univ, Canberra, ACT, Australia.", "countries": "Australia", "abstract": "We present the Influence Flower, a new visual metaphor for the influence profile of academic entities, including people, projects, institutions, conferences, and journals. While many tools quantify influence, we aim to expose the flow of influence between entities. The Influence Flower is an ego-centric graph, with a query entity placed in the centre. The petals are styled to reflect the strength of influence to and from other entities of the same or different type. For example, one can break down the incoming and outgoing influences of a research lab by research topics. The Influence Flower uses a recent snapshot of Microsoft Academic Graph, consisting of 212 million authors, their 176 million publications, and 1.2 billion citations. An interactive web app, Influence Map, is constructed around this central metaphor for searching and curating visualisations. We also propose a visual comparison method that highlights change in influence patterns over time. We demonstrate through several case studies that the Influence Flower supports data-driven inquiries about the following: researchers' careers over time; paper(s) and projects, including those with delayed recognition; the interdisciplinary profile of a research institution; and the shifting topical trends in conferences. We also use this tool on influence data beyond academic citations, by contrasting the academic and Twitter activities of a researcher.", "keywords": "Human-centered computing,Visualization,Visualisation application domains,Visual analytics,Visualization systems and tools,Empirical studies in visualization", "link": "http://dx.doi.org/10.1109/VAST47406.2019.8986934", "refList": ["10.1109/tvcg.2018.2865022", "10.4304/jetwi.4.1.3-14", "10.1145/3132744", "10.1007/s11192-017-2454-3", "10.1057/palgrave.ivs.9500156", "10.1038/504211a", "10.1145/1401890.1402008", "10.1371/journal.pbio.1002542", "10.1109/tvcg.2011.185", "10.1002/asi.20317", "10.1016/0370-2693(86)90375-8", "10.1109/tvcg.2012.252", "10.1038/s41467-018-07034-y", "10.1145/3332803", "10.1038/550029a", "10.1145/1056808.1057069", "10.1109/tvcg.2015.2468151", "10.1523/jneurosci.0003-08.2008", "10.1007/s11192-017-2535-3", "10.1109/pacificvis.2016.7465279", "10.1038/s41586-019-0941-9", "10.1111/j.1467-8659.2011.01921.x", "10.1109/tvcg.2015.2465151", "10.1007/s11192-017-2247-8", "10.1145/2740908.2742839", "10.1007/s11192-011-0436-4", "10.1126/science.aao0185", "10.1109/tvcg.2014.2383380", "10.1073/pnas.1424329112", "10.1007/s11192-005-0281-4", "10.1145/2858036.2858488", "10.1023/b:scie.0000018543.82441.f1", "10.1109/vast.2015.7347632", "10.1126/science.aaf5239", "10.1145/2500892", "10.1073/pnas.0706851105", "10.1073/pnas.0307513100", "10.1038/520429a"], "wos": 1, "children": [], "len": 1}], "len": 13}, "index": 146, "embedding": [0.2587255835533142, 1.5865137577056885, -1.0741424560546875, -0.6209551095962524, -0.6870212554931641, 0.16650904715061188, -0.6826844215393066, 2.0163393020629883, -0.40999409556388855, -0.7327370047569275, 0.007232047151774168, 0.7828099727630615, -0.12592144310474396, 3.236715078353882, 3.1046273708343506, 2.5632097721099854, 0.9127424359321594, 0.5814295411109924, -0.6852008700370789, -0.20177415013313293, -0.06630208343267441, 1.7365776300430298, 1.0871175527572632, 0.9018503427505493, -0.8797976970672607, 0.09350619465112686, -0.5670700073242188, 1.834058165550232, 1.5838677883148193, 0.18001647293567657, 1.2091028690338135, 2.2113845348358154], "projection": [-0.8695886135101318, 9.576024055480957], "size": 7, "height": 3, "width": 4}