{"data": {"doi": "10.1109/pacificvis.2017.8031594", "year": "2017", "title": "FFTEB: Edge bundling of huge graphs by the Fast Fourier Transform", "conferenceName": "PacificVis", "authors": "Antoine Lhuillier;Christophe Hurter;Alexandru Telea", "citationCount": "10", "affiliation": "Lhuillier, A (Corresponding Author), DEVI ENAC, Toulouse, France.\nLhuillier, Antoine; Hurter, Christophe, DEVI ENAC, Toulouse, France.\nTelea, Alexandru, Univ Groningen, Inst Johann Bernoulli, Groningen, Netherlands.", "countries": "France;Netherlands", "abstract": "Edge bundling techniques provide a visual simplification of cluttered graph drawings or trail sets. While many bundling techniques exist, only few recent ones can handle large datasets and also allow selective bundling based on edge attributes. We present a new technique that improves on both above points, in terms of increasing both the scalability and computational speed of bundling, while keeping the quality of the results on par with state-of-the-art techniques. For this, we shift the bundling process from the image space to the spectral (frequency) space, thereby increasing computational speed. We address scalability by proposing a data streaming process that allows bundling of extremely large datasets with limited GPU memory. We demonstrate our technique on several real-world datasets and by comparing it with state-of-the-art bundling methods.", "keywords": "I. 3.3 {[}Computing Methodologies]: Computer Graphics-Picture/Image Generation; I. 3.6 {[}Computing Methodologies]: Computer Graphics-Methodology and Techniques", "link": "https://doi.org/10.1109/PACIFICVIS.2017.8031594", "refList": ["10.1109/tvcg.2008.135", "10.1109/tvcg.2007.70582", "10.7155/jgaa.00099", "10.1109/tvcg.2011.213", "10.1109/tvcg.2013.246", "10.1111/j.1467-8659.2008.01232.x", "10.1109/tvcg.2011.233", "10.1111/j.1467-8659.2009.01680.x", "10.1109/tvcg.2007.70535", "10.1109/34.1000236", "10.1109/tvcg.2016.2515611", "10.1109/infvis.2005.1532150", "10.1109/tvcg.2006.147", "10.1109/ipdps.2016.95", "10.1137/1114019", "10.1109/vast.2011.6102440", "10.1109/tvcg.2013.114", "10.1109/pacificvis.2011.5742389", "10.1109/tau.1967.1161903", "10.1109/tvcg.2006.106", "10.1109/pacificvis.2015.7156354", "10.1109/iv.2010.53", "10.1109/tst.2013.6509098"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864690", "title": "Interactive obstruction-free lensing for volumetric data visualization", "year": "2018", "conferenceName": "SciVis", "authors": "Michael Traoré;Christophe Hurter;Alexandru Telea", "citationCount": "1", "affiliation": "Traore, M (Corresponding Author), French Civil Aviat Univ, ENAC, Toulouse, France. Traore, Michael; Hurter, Christophe, French Civil Aviat Univ, ENAC, Toulouse, France. Telea, Alexandru, Univ Groningen, Inst Johan Bernoulli, Groningen, Netherlands.", "countries": "France;Netherlands", "abstract": "Occlusion is an issue in volumetric visualization as it prevents direct visualization of the region of interest. While many techniques such as transfer functions, volume segmentation or view distortion have been developed to address this, there is still room for improvement to better support the understanding of objects' vicinity. However, most existing Focus+Context fail to solve partial occlusion in datasets where the target and the occluder are very similar density-wise. For these reasons, we investigate a new technique which maintains the general structure of the investigated volumetric dataset while addressing occlusion issues. With our technique, the user interactively defines an area of interest where an occluded region or object is partially visible. Then our lens starts pushing at its border occluding objects, thus revealing hidden volumetric data. Next, the lens is modified with an extended field of view (fish-eye deformation) to better see the vicinity of the selected region. Finally, the user can freely explore the surroundings of the area under investigation within the lens. To provide real-time exploration, we implemented our lens using a GPU accelerated ray-casting framework to handle ray deformations, local lighting, and local viewpoint manipulation. We illustrate our technique with five application scenarios in baggage inspection, 3D fluid flow visualization, chest radiology, air traffic planning, and DTI fiber exploration.", "keywords": "Interaction techniques,focus + context,volume visualization,volume rendering,raycasting", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864690", "refList": ["10.1109/visual.1999.809865", "10.1145/1409060.1409107", "10.1109/visual.2003.1250400", "10.1145/2598153.2598200", "10.1007/978-1-4614-7657-3\\_19", "10.1109/tvcg.2008.59", "10.1145/989863.989871", "10.1109/tvcg.2016.2599049", "10.1145/345513.345271", "10.1016/s1470-2045(17)30438-2", "10.1109/pacificvis.2014.61", "10.1111/j.1467-8659.2006.00979.x", "10.1109/tvcg.2010.35", "10.2312/conf/eg2012/stars/075-094", "10.1111/cgf.12927", "10.1111/cgf.12871", "10.1145/2024156.2024165", "10.1007/978-3-540-85412-8\\_16", "10.1057/ivs.2009.32", "10.1109/tvcg.2006.140", "10.1109/tvcg.2007.70565", "10.1109/tvcg.2015.2403323", "10.1109/visual.2004.32", "10.2200/s00688ed1v01y201512vis006", "10.1109/tvcg.2015.2443804", "10.1109/tvcg.2006.144", "10.1109/tvcg.2016.2515611", "10.1109/tvcg.2007.48", "10.1109/tvcg.2010.193", "10.1109/tvcg.2007.1051", "10.1109/tvcg.2015.2502583", "10.1109/tvcg.2011.223", "10.1109/38.595268", "10.1111/j.1467-8659.2012.03079.x", "10.1109/tvcg.2009.145", "10.1109/pacificvis.2017.8031594", "10.1145/2425296.2425325", "10.1109/tvcg.2012.265", "10.1109/mcg.2017.10", "10.1007/s12031-007-0029-0", "10.1109/tvcg.2010.127", "10.1016/j.trc.2014.03.005", "10.1109/tvcg.2009.138", "10.1109/tvcg.2006.124"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934805", "title": "Interactive Structure-aware Blending of Diverse Edge Bundling Visualizations", "year": "2019", "conferenceName": "InfoVis", "authors": "Yunhai Wang;Mingliang Xue;Yanyan Wang;Xinyuan Yan;Baoquan Chen;Chi-Wing Fu;Christophe Hurter", "citationCount": "1", "affiliation": "Fu, CW (Corresponding Author), Chinese Univ Hong Kong, Hong Kong, Peoples R China. Fu, CW (Corresponding Author), SIAT, Guangdong Prov Key Lab CV \\& VR Tech, Guangzhou, Peoples R China. Wang, Yunhai; Xue, Mingliang; Wang, Yanyan; Yan, Xinyuan, Shandong Univ, Jinan, Peoples R China. Chen, Baoquan, Peking Univ, Beijing, Peoples R China. Fu, Chi-Wing, Chinese Univ Hong Kong, Hong Kong, Peoples R China. Fu, Chi-Wing, SIAT, Guangdong Prov Key Lab CV \\& VR Tech, Guangzhou, Peoples R China. Hurter, Christophe, ENAC, Toulouse, France.", "countries": "China;France", "abstract": "Many edge bundling techniques (i.e., data simplification as a support for data visualization and decision making) exist but they are not directly applicable to any kind of dataset and their parameters are often too abstract and difficult to set up. As a result, this hinders the user ability to create efficient aggregated visualizations. To address these issues, we investigated a novel way of handling visual aggregation with a task-driven and user-centered approach. Given a graph, our approach produces a decluttered view as follows: first, the user investigates different edge bundling results and specifies areas, where certain edge bundling techniques would provide user-desired results. Second, our system then computes a smooth and structural preserving transition between these specified areas. Lastly, the user can further fine-tune the global visualization with a direct manipulation technique to remove the local ambiguity and to apply different visual deformations. In this paper, we provide details for our design rationale and implementation. Also, we show how our algorithm gives more suitable results compared to current edge bundling techniques, and in the end, we provide concrete instances of usages, where the algorithm combines various edge bundling results to support diverse data exploration and visualizations.", "keywords": "path visualization,trajectory visualization,edge bundles", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934805", "refList": ["10.1111/cgf.13213", "10.1145/2254556.2254652", "10.1111/cgf.12791", "10.1111/j.1467-8659.2011.01898.x", "10.1111/cgf.12871", "10.1109/tvcg.2018.2864911", "10.1145/3025453.3025628", "10.1177/1473871617738122", "10.1111/j.1467-8659.2009.01700.x", "10.2312/eurovisstar.20141172", "10.1109/tvcg.2011.233", "10.1016/0020-0190(89)90102-6", "10.2200/s00688ed1v01y201512vis006", "10.3390/informatics4030026", "10.1109/tvcg.2017.2745919", "10.1111/j.1467-8659.2009.01680.x", "10.1109/tvcg.2015.2467691", "10.1109/tvcg.2016.2515611", "10.1111/cgf.13176", "10.1109/tvcg.2006.147", "10.1145/2992154.2992168", "10.1109/tvcg.2016.2598958", "10.1109/tvcg.2010.269", "10.1002/spe.4380211102", "10.1109/pacificvis.2017.8031596", "10.1109/tvcg.2011.223", "10.1145/1168149.1168168", "10.1006/s1045-926x(02)00016-2", "10.2312/vissym/vissym04/221-230", "10.1111/j.1467-8659.2012.03079.x", "10.1016/j.jvlc.2017.09.004", "10.3390/e20090625", "10.1109/tvcg.2014.2346441", "10.1109/tvcg.2017.2744338", "10.1109/pacificvis.2017.8031594", "10.1109/tvcg.2011.104", "10.1007/978-3-319-06793-310", "10.1109/pacificvis.2011.5742389", "10.1111/j.1467-8659.2009.01449.x", "10.1371/journal.pone.0098679", "10.1109/pacificvis.2015.7156354", "10.7155/jgaa.00370", "10.1109/pacificvis.2013.6596147", "10.1109/tvcg.2006.156", "10.1111/j.1467-8659.2009.01450.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030471", "title": "Visual Analysis of Discrimination in Machine Learning", "year": "2020", "conferenceName": "InfoVis", "authors": "Qianwen Wang;Zhenhua Xu;Zhutian Chen;Yong Wang;Shixia Liu;Huamin Qu", "citationCount": "0", "affiliation": "Wang, QW (Corresponding Author), Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Wang, Qianwen; Xu, Zhenhua; Chen, Zhutian; Wang, Yong; Qu, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Liu, Shixia, Tsinghua Univ, Beijing, Peoples R China.", "countries": "China", "abstract": "The growing use of automated decision-making in critical applications, such as crime prediction and college admission, has raised questions about fairness in machine learning. How can we decide whether different treatments are reasonable or discriminatory? In this paper, we investigate discrimination in machine learning from a visual analytics perspective and propose an interactive visualization tool, DiscriLens, to support a more comprehensive analysis. To reveal detailed information on algorithmic discrimination, DiscriLens identifies a collection of potentially discriminatory itemsets based on causal modeling and classification rules mining. By combining an extended Euler diagram with a matrix-based visualization, we develop a novel set visualization to facilitate the exploration and interpretation of discriminatory itemsets. A user study shows that users can interpret the visually encoded information in DiscriLens quickly and accurately. Use cases demonstrate that DiscriLens provides informative guidance in understanding and reducing algorithmic discrimination.", "keywords": "Machine Learning,Discrimination,Data Visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030471", "refList": ["10.1109/tvcg.2019.2934396", "10.2312/eurovisstar.20141170", "10.1145/3357384.3357910", "10.1111/cgf.12791", "10.1109/tvcg.2018.2861397", "10.1111/j.1467-8659.2011.01898.x", "10.1145/2702123.2702237", "10.1109/tvcg.2019.2934798", "10.1109/mcg.2017.21", "10.1109/tvcg.2019.2934300", "10.1109/tvcg.2017.2745085", "10.1109/tvcg.2018.2859997", "10.1145/3173574.3174237", "10.1109/tvcg.2018.2865126", "10.1145/1718487.1718520", "10.1109/tvcg.2017.2743858", "10.1109/pacificvis.2015.7156392", "10.1109/tvcg.2018.2864477", "10.1145/324133.324140", "10.1137/140976649", "10.1145/3219819.3220088", "10.1109/tvcg.2019.2934805", "10.1145/1134271.1134277", "10.1137/090772745", "10.1016/j.jelectrocard.2010.09.003", "10.1109/tvcg.2012.253", "10.1145/2556612", "10.1109/tvcg.2013.173", "10.1109/tvcg.2019.2934619", "10.1109/tvcg.2017.2745078"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2019.2934657", "title": "OD Morphing: Balancing Simplicity with Faithfulness for OD Bundling", "year": "2019", "conferenceName": "VAST", "authors": "Yan Lyu;Xu Liu;Hanyi Chen;Arpan Mangal;Kai Liu;Chao Chen 0004;Brian Y. Lim", "citationCount": "0", "affiliation": "Lyu, Y (Corresponding Author), Natl Univ Singapore, Singapore, Singapore. Lyu, Yan; Lim, Brian, Natl Univ Singapore, Singapore, Singapore. Liu, Xu, Southeast Univ, Nanjing, Peoples R China. Chen, Hanyi, Zhejiang Univ, Hangzhou, Peoples R China. Mangal, Arpan, Indian Inst Technol, Delhi, India. Liu, Kai; Chen, Chao, Chongqing Univ, Chongqing, Peoples R China.", "countries": "India;China;Singapore", "abstract": "OD bundling is a promising method to identify key origin-destination (OD) patterns, but the bundling can mislead the interpretation of actual trajectories traveled. We present OD Morphing, an interactive OD bundling technique that improves geographical faithfulness to actual trajectories while preserving visual simplicity for OD patterns. OD Morphing iteratively identifies critical waypoints from the actual trajectory network with a min-cut algorithm and transitions OD bundles to pass through the identified waypoints with a smooth morphing method. Furthermore, we extend OD Morphing to support bundling at interaction speeds to enable users to interactively transition between degrees of faithfulness to aid sensemaking. We introduce metrics for faithfulness and simplicity to evaluate their trade-off achieved by OD morphed bundling. We demonstrate OD Morphing on real-world city-scale taxi trajectory and USA domestic planned flight datasets.", "keywords": "OD Visualization,Edge Bundling,Trajectory", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934657", "refList": ["10.1109/tvcg.2008.135", "10.1145/2833165.2833168", "10.1111/cgf.13213", "10.1109/tvcg.2018.2864503", "10.1109/tvcg.2010.44", "10.1145/1653771.1653820", "10.1016/j.comgeo.2015.10.005", "10.1109/tvcg.2014.2337333", "10.1016/j.sbspro.2014.12.218", "10.1109/tvcg.2016.2535234", "10.1109/pacificvis.2011.5742386", "10.1145/321694.321699", "10.1109/tvcg.2013.246", "10.1111/cgf.12881", "10.1111/j.1467-8659.2009.01700.x", "10.1109/tvcg.2015.2467771", "10.1109/tvcg.2011.233", "10.1109/infvis.2003.1249008", "10.1109/itsc.2011.6082850", "10.1111/j.1467-8659.2009.01680.x", "10.1109/tvcg.2014.2346271", "10.1109/tvcg.2015.2467691", "10.1109/tvcg.2016.2515611", "10.1016/j.physa.2006.12.003", "10.1147/sj.41.0025", "10.1007/978-3-642-00304-2\\_1", "10.1109/tvcg.2006.147", "10.1109/tvcg.2016.2598958", "10.1109/tpami.2004.60", "10.1109/tvcg.2011.223", "10.1109/tits.2018.2817282", "10.1111/j.1467-8659.2012.03079.x", "10.1109/tvcg.2007.70539", "10.1109/tvcg.2017.2744338", "10.1109/pacificvis.2017.8031594", "10.1179/000870410x12658023467367", "10.1145/2030112.2030126", "10.1109/tvcg.2011.104", "10.1145/2133416.2146416", "10.1109/tvcg.2011.190", "10.1142/s0218195995000064", "10.1002/cnm.1630040603", "10.1109/pacificvis.2011.5742389", "10.1109/pacificvis.2015.7156354", "10.1111/cgf.12778", "10.1109/dsnw.2011.5958797", "10.1109/cvprw.2008.4563095", "10.1109/tvcg.2016.2598885", "10.1109/tvcg.2017.2744322", "10.1111/j.1467-8659.2009.01450.x", "10.1109/tvcg.2016.2598416", "10.1109/cce.2012.6315867"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13712", "year": "2019", "title": "Route-Aware Edge Bundling for Visualizing Origin-Destination Trails in Urban Traffic", "conferenceName": "EuroVis", "authors": "Wei Zeng;Q. Shen;Y. Jiang;A. Telea", "citationCount": "1", "affiliation": "Shen, Q (Corresponding Author), Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China.\nZeng, W., Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China.\nShen, Q.; Jiang, Y., Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China.\nTelea, A., Univ Groningen, Groningen, Netherlands.", "countries": "China;Netherlands", "abstract": "Origin-destination (OD) trails describe movements across space. Typical visualizations thereof use either straight lines or plot the actual trajectories. To reduce clutter inherent to visualizing large OD datasets, bundling methods can be used. Yet, bundling OD trails in urban traffic data remains challenging. Two specific reasons hereof are the constraints implied by the underlying road network and the difficulty of finding good bundling settings. To cope with these issues, we propose a new approach called Route Aware Edge Bundling (RAEB). To handle road constraints, we first generate a hierarchical model of the road-and-trajectory data. Next, we derive optimal bundling parameters, including kernel size and number of iterations, for a user-selected level of detail of this model, thereby allowing users to explicitly trade off simplification vs accuracy. We demonstrate the added value of RAEB compared to state-of-the-art trail bundling methods on both synthetic and real-world traffic data for tasks that include the preservation of road network topology and the support of multiscale exploration.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13712", "refList": ["10.1109/tvcg.2008.135", "10.1145/2833165.2833168", "10.1111/cgf.13213", "10.1109/mcg.2011.88", "10.1109/tvcg.2013.226", "10.1109/tvcg.2010.44", "10.1145/1653771.1653820", "10.1109/tvcg.2015.2468111", "10.1109/tst.2013.6509098", "10.1111/j.1467-8659.2009.01440.x", "10.1111/cgf.12922", "10.1109/tvcg.2018.2816219", "10.1109/vast.2014.7042486", "10.1198/tas.2009.0033", "10.1111/cgf.12132", "10.1111/j.1467-8659.2009.01700.x", "10.1016/j.trc.2007.05.002", "10.1007/978-3-540-72680-7\\_22", "10.1109/tvcg.2011.233", "10.1109/tvcg.2014.2346271", "10.1109/tvcg.2016.2515611", "10.1109/infvis.2005.1532150", "10.1109/tvcg.2016.2598472", "10.1109/tvcg.2006.147", "10.1109/tvcg.2016.2598958", "10.1109/tits.2017.2683539", "10.1109/tits.2015.2436897", "10.1111/j.1467-8659.2012.03079.x", "10.1109/tvcg.2017.2744338", "10.1109/pacificvis.2017.8031594", "10.1179/000870410x12658023467367", "10.1057/palgrave.ivs.9500182", "10.1109/tvcg.2011.104", "10.1109/tvcg.2011.190", "10.1109/tvcg.2013.114", "10.1111/cgf.12778", "10.1109/tvcg.2015.2467112", "10.1111/cgf.12107", "10.1109/iv.2010.53", "10.1109/42.563664", "10.1109/tvcg.2017.2666146", "10.1145/2530531", "10.1111/j.1467-8659.2009.01450.x", "10.4028/www.scientific.net/kem.342-343.593", "10.1109/tvcg.2011.202", "10.1038/srep00612"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030410", "title": "Revisiting the Modifiable Areal Unit Problem in Deep Traffic Prediction with Visual Analytics", "year": "2020", "conferenceName": "VAST", "authors": "Wei Zeng 0002;Chengqiao Lin;Juncong Lin;Jincheng Jiang;Jiazhi Xia;Cagatay Turkay;Wei Chen", "citationCount": "0", "affiliation": "Lin, JC (Corresponding Author), Xiamen Univ, Xiamen, Peoples R China. Zeng, Wei; Jiang, Jincheng, Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. Lin, Chengqiao; Lin, Juncong, Xiamen Univ, Xiamen, Peoples R China. Xia, Jiazhi, Cent South Univ, Changsha, Peoples R China. Turkay, Cagatay, Univ Warwick, Coventry, W Midlands, England. Chen, Wei, Zhejiang Univ, State Key Lab CAD \\& CG, Hangzhou, Zhejiang, Peoples R China.", "countries": "China;England", "abstract": "Deep learning methods are being increasingly used for urban traffic prediction where spatiotemporal traffic data is aggregated into sequentially organized matrices that are then fed into convolution-based residual neural networks. However, the widely known modifiable areal unit problem within such aggregation processes can lead to perturbations in the network inputs. This issue can significantly destabilize the feature embeddings and the predictions - rendering deep networks much less useful for the experts. This paper approaches this challenge by leveraging unit visualization techniques that enable the investigation of many-to-many relationships between dynamically varied multi-scalar aggregations of urban traffic data and neural network predictions. Through regular exchanges with a domain expert, we design and develop a visual analytics solution that integrates 1) a Bivariate Map equipped with an advanced bivariate colormap to simultaneously depict input traffic and prediction errors across space, 2) a Moran's I Scatterplot that provides local indicators of spatial association analysis, and 3) a Multi-scale Attribution View that arranges non-linear dot plots in a tree layout to promote model analysis and comparison across scales. We evaluate our approach through a series of case studies involving a real-world dataset of Shenzhen taxi trips, and through interviews with domain experts. We observe that geographical scale variations have important impact on prediction performances, and interactive visual exploration of dynamically varying inputs and outputs benefit experts in the development of deep traffic prediction models.", "keywords": "MAUP,traffic prediction,deep learning,model diagnostic,visual analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030410", "refList": ["10.1038/srep26377", "10.1109/mcg.2011.88", "10.1080/13658816.2015.1119279", "10.1109/tvcg.2013.226", "10.1109/pacificvis.2011.5742387", "10.1038/s41467-017-01882-w", "10.1109/tvcg.2019.2934670", "10.1111/j.1467-8659.2009.01440.x", "10.1111/cgf.13712", "10.1016/j.compenvurbsys.2008.09.006", "10.1109/pacificvis.2014.50", "10.1109/tvcg.2018.2816219", "10.1109/tvcg.2016.2535234", "10.1109/tvcg.2014.2346893", "10.3390/ijgi8080344", "10.1109/tvcg.2013.246", "10.1007/s10940-005-9003-6", "10.1016/j.compenvurbsys.2008.05.001", "10.1007/s10661-019-7831-3", "10.1111/j.1538-4632.2007.00699.x", "10.1016/j.aap.2016.08.015", "10.1080/13658816.2018.1541177", "10.1109/pacificvis.2012.6183572", "10.1109/tvcg.2011.181", "10.1137/090759069", "10.1109/pacificvis.2011.5742390", "10.1214/10-aos799", "10.1109/tits.2017.2683539", "10.1109/tits.2015.2436897", "10.3390/ijerph16071150", "10.1109/tvcg.2009.145", "10.1109/tvcg.2012.265", "10.1080/10106049.2017.1404140", "10.3390/ijgi8020063", "10.3390/info6020134", "10.1080/13658816.2014.955027", "10.1109/tits.2016.2639320", "10.2307/143141", "10.1109/tvcg.2016.2598432"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030469", "title": "Topology Density Map for Urban Data Visualization and Analysis", "year": "2020", "conferenceName": "VAST", "authors": "Zezheng Feng;Haotian Li;Wei Zeng 0004;Shuang-Hua Yang;Huamin Qu", "citationCount": "0", "affiliation": "Zeng, W (Corresponding Author), Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. Feng, Zezheng; Li, Haotian; Qu, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Zeng, Wei, Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. Yang, Shuang-Hua, Southern Univ Sci \\& Technol, Shenzhen, Peoples R China.", "countries": "China", "abstract": "Density map is an effective visualization technique for depicting the scalar field distribution in 2D space. Conventional methods for constructing density maps are mainly based on Euclidean distance, limiting their applicability in urban analysis that shall consider road network and urban traffic. In this work, we propose a new method named Topology Density Map, targeting for accurate and intuitive density maps in the context of urban environment. Based on the various constraints of road connections and traffic conditions, the method first constructs a directed acyclic graph (DAG) that propagates nonlinear scalar fields along 1D road networks. Next, the method extends the scalar fields to a 2D space by identifying key intersecting points in the DAG and calculating the scalar fields for every point, yielding a weighted Voronoi diagram like effect of space division. Two case studies demonstrate that the Topology Density Map supplies accurate information to users and provides an intuitive visualization for decision making. An interview with domain experts demonstrates the feasibility, usability, and effectiveness of our method.", "keywords": "Density map,network topology,urban data", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030469", "refList": ["10.1109/vast.2009.5332584", "10.1109/tvcg.2013.193", "10.1080/03081060.2013.844903", "10.1109/tvcg.2018.2864503", "10.1145/2702123.2702419", "10.1109/tvcg.2019.2934670", "10.1109/tits.2015.2496783", "10.1177/1473871615581216", "10.3141/1617-02", "10.1145/2024156.2024169", "10.1111/cgf.13712", "10.1016/j.ejor.2007.02.005", "10.1109/tvcg.2014.2346893", "10.1007/11871842\\_29", "10.1109/vast.2010.5652478", "10.1016/j.visinf.2019.10.002", "10.1109/tvcg.2016.2616404", "10.1109/vl.1996.545307", "10.1145/2629592", "10.1155/2018/2696037", "10.1061/(asce)0733-947x(1998)124:4(368", "10.3141/1899-21", "10.1023/a:1026123329433", "10.1109/mcg.2010.79", "10.1057/palgrave.ivs.9500174", "10.1109/tcyb.2019.2963681", "10.1109/tvcg.2015.2467554", "10.1111/cgf.12114", "10.1145/2814575", "10.1016/j.jcps.2014.08.002", "10.1109/2945.981847", "10.1080/03052150210909", "10.1109/tciaig.2012.2186810", "10.1109/tits.2017.2683539", "10.1109/iv.2004.1320137", "10.1016/0377-2217(80)90126-5", "10.1109/tvcg.2016.2640960", "10.1109/tvcg.2015.2467196", "10.1145/3097983.3098056", "10.1007/s11432-018-9801-4", "10.1109/vast.2014.7042490", "10.1061/(asce)0733-947x(2006)132:2(122", "10.1016/j.tra.2008.03.011", "10.1109/tits.2014.2298892", "10.1016/j.trb.2005.12.003", "10.1007/bf01840357", "10.1109/vast.2011.6102454", "10.1109/tvcg.2013.145", "10.1007/bf02289588", "10.1109/pacificvis.2014.56", "10.1109/mcg.2018.053491730", "10.1109/tvcg.2009.111", "10.1057/palgrave.ivs.9500184", "10.1109/tvcg.2013.173", "10.1109/tvcg.2016.2598432", "10.1007/978-0-85729-079-3"], "wos": 1, "children": [], "len": 1}], "len": 5}], "len": 15}, "index": 172, "embedding": [1.7378742694854736, 0.7881175875663757, 2.216214418411255, 2.2041702270507812, -0.6896921992301941, 0.16650904715061188, -0.42834439873695374, 1.3963217735290527, -0.4727596938610077, -0.8766400814056396, 0.8299969434738159, 0.8652120232582092, -0.15391238033771515, 1.1772217750549316, 1.0721244812011719, 0.9325781464576721, -0.051267173141241074, 0.06749609857797623, -0.7390042543411255, 0.6846240758895874, -0.06630208343267441, 1.9785444736480713, 0.06574303656816483, -0.14990495145320892, 1.0358200073242188, 0.06111183390021324, -0.561912477016449, -0.04583561792969704, 1.4168579578399658, 2.1245744228363037, 0.7351898550987244, 1.1005300283432007], "projection": [-3.7496442794799805, 7.063786029815674], "size": 8, "height": 3, "width": 4}