{"data": {"doi": "10.1109/scivis.2015.7429491", "title": "Feature-Based Tensor Field Visualization for Fiber Reinforced Polymers", "year": "2015", "conferenceName": "SciVis", "authors": "Valentin Zobel;Markus Stommel;Gerik Scheuermann", "citationCount": "3", "affiliation": "Zobel, V (Corresponding Author), Univ Leipzig, D-04109 Leipzig, Germany. Zobel, Valentin; Scheuermann, Gerik, Univ Leipzig, D-04109 Leipzig, Germany. Stommel, Markus, TU Dortmund Univ, Dortmund, Germany.", "countries": "Germany", "abstract": "Virtual testing is an integral part of modern product development in mechanical engineering. Numerical structure simulations allow the computation of local stresses which are given as tensor fields. For homogeneous materials, the tensor information is usually reduced to a scalar field like the von Mises stress. A material-dependent threshold defines the material failure answering the key question of engineers. This leads to a rather simple feature-based visualisation. For composite materials like short fiber reinforced polymers, the situation is much more complex. The material property is determined by the fiber distribution at every position, often described as fiber orientation tensor field. Essentially, the material's ability to cope with stress becomes anisotropic and inhomogeneous. We show how to combine the stress field and the fiber orientation field in such cases, leading to a feature-based visualization of tensor fields for composite materials. The resulting features inform the engineer about potential improvements in the product development.", "keywords": "tensor visualization, feature-based visualisation, composite materials, structural mechanics", "link": "http://dx.doi.org/10.1109/SciVis.2015.7429491", "refList": ["10.1002/nag.223", "10.1016/j.cma.2005.05.041", "10.1109/tvcg.2010.199", "10.1109/visual.1995.485141", "10.1109/visual.1994.346326", "10.1122/1.550630", "10.1111/j.1467-8659.2012.03231.x", "10.1002/nag.288", "10.1177/002199837100500106", "10.2312/conf/eg2013/stars/039-063", "10.1177/0021998304048413", "10.2312/vissym/vissym04/147-154", "10.1109/tvcg.2009.184", "10.1109/visual.2004.105"], "wos": 1, "children": [{"doi": "10.1109/pacificvis48177.2020.1008", "year": "2020", "title": "Tensor Spines - A Hyperstreamlines Variant Suitable for Indefinite Symmetric Second-Order Tensors", "conferenceName": "PacificVis", "authors": "Vanessa Kretzschmar;Fabian G{\\\"{u}}nther;Markus Stommel;Gerik Scheuermann", "citationCount": "0", "affiliation": "Kretzschmar, V (Corresponding Author), TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, V (Corresponding Author), Univ Leipzig, Leipzig, Germany.\nKretzschmar, Vanessa; Guenther, Fabian; Stommel, Markus, TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, Vanessa; Scheuermann, Gerik, Univ Leipzig, Leipzig, Germany.", "countries": "Germany", "abstract": "Modern engineering uses optimization to design long-living and robust components. One part of this process is to find the optimal stress-aware design under given geometric constraints and loading conditions. Tensor visualization provides techniques to show and evaluate the stress distribution based on finite element method simulations. One such technique are hyperstreamlines. They allow us to explore the stress along a line following one principal stress direction while showing the other principal stress directions and their values. In this paper, we show shortcomings of this approach from an engineer's point of view and propose a variant called tensor spines. It provides an improved perception of the relation between the principal stresses helping engineers to optimize their designs further.", "keywords": "Human-centered computing; Visualization; Visualization techniques", "link": "https://doi.org/10.1109/PacificVis48177.2020.1008", "refList": ["10.1109/38.219447", "10.1002/nag.223", "10.1109/tvcg.2016.2598998", "10.1109/pacificvis.2014.51", "10.1111/cgf.13693", "10.1109/tvcg.2015.2484343", "10.1111/cgf.13434", "10.1007/s00371-017-1450-1", "10.1007/b106657\\_8", "10.1109/scivis.2015.7429491", "10.1111/j.1467-8659.2012.03231.x", "10.2312/vissym/vissym04/147-154", "10.1109/visual.2004.105", "10.1111/cgf.13423", "10.1109/visual.2003.1250379", "10.1111/cgf.13171", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13214", "year": "2017", "title": "STAR: Visual Computing in Materials Science", "conferenceName": "EuroVis", "authors": "Christoph Heinzl;S. Stappen", "citationCount": "8", "affiliation": "Heinzl, C (Corresponding Author), Univ Appl Sci Upper Austria, Wels Campus, Wels, Austria.\nHeinzl, C., Univ Appl Sci Upper Austria, Wels Campus, Wels, Austria.\nStappen, S., TU Wien, Inst Comp Graph \\& Algorithms, Vienna, Austria.", "countries": "Austria", "abstract": "Visual computing has become highly attractive for boosting research endeavors in the materials science domain. Using visual computing, a multitude of different phenomena may now be studied, at various scales, dimensions, or using different modalities. This was simply impossible before. Visual computing techniques provide novel insights in order to understand complex material systems of interest, which is demonstrated by strongly rising number of new approaches, publishing new techniques for materials analysis and simulation. Outlining the proximity of materials science and visual computing, this state of the art report focuses on the intersection of both domains in order to guide research endeavors in this field. We provide a systematic survey on the close interrelations of both fields as well as how they profit from each other. Analyzing the existing body of literature, we review the domain of visual computing supported materials science, starting with the definition of materials science as well as material systems for which visual computing is frequently used. Major tasks for visual computing, visual analysis and visualization in materials sciences are identified, as well as simulation and testing techniques, which are providing the data for the respective analyses. We reviewed the input data characteristics and the direct and derived outputs, the visualization techniques and visual metaphors used, as well as the interactions and analysis workflows employed. All our findings are finally integrated in a cumulative matrix, giving insights about the different interrelations of both domains. We conclude our report with the identification of open high level and low level challenges for future research.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13214", "refList": ["10.1007/s10853-015-9173-z", "10.1109/fendt.2014.6928241", "10.2312/eurovisstar.20141170", "10.1109/pacificvis.2015.7156377", "10.1364/ao.49.000e48", "10.1007/s10853-015-9355-8", "10.1364/oe.2.000540", "10.1016/j.cag.2010.05.001", "10.1109/tvcg.2007.70598", "10.1111/j.1467-8659.2012.03111.x", "10.1109/tvcg.2007.70603", "10.1109/visual.2003.1250418", "10.1016/j.compscitech.2007.04.006", "10.1007/s10921-008-0039-z", "10.1007/s10921-008-0035-3", "10.1109/vl.1996.545307", "10.1016/j.polymertesting.2013.10.017", "10.1109/tvcg.2015.2467432", "10.1109/visual.2004.35", "10.1109/visual.1998.745350", "10.1186/s13046-016-0414-z", "10.1109/tvcg.2003.1207440", "10.1109/tvcg.2009.115", "10.1016/j.compositesa.2014.11.016", "10.1109/vast.2016.7883516", "10.1111/cgf.12605", "10.1016/j.compositesb.2011.01.025", "10.1109/scivis.2015.7429491", "10.1007/s10853-010-5203-z", "10.1007/s10853-013-7718-6", "10.1007/s10853-014-8540-5", "10.1109/tvcg.2010.104", "10.1111/cgf.12895", "10.1063/1.362662", "10.1016/s0376-7388(02)00122-9", "10.1186/s40327-015-0017-3", "10.1109/tvcg.2012.206", "10.1109/tvcg.2013.8", "10.1109/tvcg.2009.103", "10.1109/tvcg.2014.2346321", "10.1109/tvcg.2013.177", "10.1109/pacificvis.2011.5742372", "10.1007/s10853-005-2733-x", "10.1007/s10853-009-3817-9", "10.1109/iciasf.2005.1569899", "10.1111/cgf.12896", "10.1016/j.polymertesting.2015.01.020", "10.1007/s10921-008-0034-4", "10.1109/tim.2007.908139", "10.1109/autest.2008.4662635", "10.1145/1964921.1964967", "10.1007/s10853-011-5270-9", "10.1109/pacificvis.2014.52", "10.1016/j.polymertesting.2011.12.012", "10.1109/tvcg.2010.214", "10.1109/tthz.2016.2519263", "10.1109/tvcg.2012.200", "10.1109/tvcg.2015.2448105", "10.1109/tps.2014.2312722", "10.1016/j.cirp.2011.05.006", "10.1007/s007910100055", "10.1016/j.cag.2015.04.001", "10.1007/s10853-013-7956-7", "10.1145/1141911.1141976", "10.1023/a:1012586204236", "10.1145/2185520.2185534", "10.1007/s10853-012-7100-0", "10.1109/tvcg.2007.70515", "10.1109/tvcg.2011.228", "10.1109/tvcg.2010.20"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864506", "title": "Visualization of Bubble Formation in Porous Media", "year": "2018", "conferenceName": "SciVis", "authors": "Hui Zhang 0027;Steffen Frey;Holger Steeb;David Uribe;Thomas Ertl;Wenping Wang", "citationCount": "0", "affiliation": "Zhang, H (Corresponding Author), Univ Hong Kong, Dept Comp Sci, Hong Kong, Peoples R China. Zhang, Hui; Wang, Wenping, Univ Hong Kong, Dept Comp Sci, Hong Kong, Peoples R China. Frey, Steffen; Ertl, Thomas, Univ Stuttgart, Visualizat Res Ctr, Stuttgart, Germany. Steeb, Holger; Uribe, David, Univ Stuttgart, Inst Appl Mech, Stuttgart, Germany.", "countries": "Germany;China", "abstract": "We present a visualization approach for the analysis of CO<sub>2</sub>bubble-induced attenuation in porous rock formations. As a basis for this, we introduce customized techniques to extract CO<sub>2</sub>bubbles and their surrounding porous structure from X-ray computed tomography data (XCT) measurements. To understand how the structure of porous media influences the occurrence and the shape of formed bubbles, we automatically classify and relate them in terms of morphology and geometric features, and further directly support searching for promising porous structures. To allow for the meaningful direct visual comparison of bubbles and their structures, we propose a customized registration technique considering the bubble shape as well as its points of contact with the porous media surface. With our quantitative extraction of geometric bubble features, we further support the analysis as well as the creation of a physical model. We demonstrate that our approach was successfully used to answer several research questions in the domain, and discuss its high practical relevance to identify critical seismic characteristics of fluid-saturated rock that govern its capability to store CO<sub>2</sub>.", "keywords": "3D volume rendering,bubble visualization,porous media", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864506", "refList": ["10.1126/science.1079033", "10.1063/pt.3.2865", "10.1063/1.4871486", "10.1109/visual.2004.48", "10.1071/eg04025", "10.1109/visual.2005.1532788", "10.1016/j.cag.2010.05.001", "10.1109/tvcg.2007.70603", "10.2312/localchapterevents/italchap/italianchapconf2008/129-136", "10.1109/im.2001.924423", "10.1016/0262-8856(92)90076-f", "10.1016/j.ijggc.2017.10.002", "10.1109/tvcg.2014.2346351", "10.1111/cgf.12605", "10.1109/tvcg.2015.2443804", "10.1016/0196-8904(93)90069-m", "10.1002/2015gl063538", "10.1109/tvcg.2013.177", "10.1109/34.982886", "10.1017/jfm.2016.401", "10.1111/cgf.13214", "10.1007/s00371-007-0197-5", "10.1145/37402.37422", "10.1109/pacificvis.2014.52", "10.1017/jfm.2017.221", "10.1109/tvcg.2012.200", "10.1109/42.906424", "10.1109/tvcg.2013.16", "10.1109/im.2003.1240258", "10.1145/571647.571648", "10.1063/1.4871489", "10.1111/j.1467-8659.2009.01671.x", "10.1145/383259.383295", "10.1016/j.advwatres.2014.02.014", "10.1109/tvcg.2006.124", "10.1109/tip.2010.2069690"], "wos": 1, "children": [{"doi": "10.1111/cgf.13688", "year": "2019", "title": "A Visual Tool for the Analysis of Algorithms for Tomographic Fiber Reconstruction in Materials Science", "conferenceName": "EuroVis", "authors": "Bernhard Fr{\\\"{o}}hler;Tim Elberfeld;Torsten M{\\\"{o}}ller;Hans{-}Christian Hege;Johannes Weissenb{\\\"{o}}ck;Jan De Beenhouwer;Jan Sijbers;Johann Kastner;Christoph Heinzl", "citationCount": "0", "affiliation": "Frohler, B (Corresponding Author), Univ Appl Sci Upper Austria, Res Grp Computed Tomog, Wels, Austria.\nFrohler, B (Corresponding Author), Uni Vienna, Data Sci, Vienna, Austria.\nFrohler, B (Corresponding Author), Univ Vienna, Fac Comp Sci, Vienna, Austria.\nFroehler, B.; Weissenboeck, J.; Kastner, J.; Heinzl, C., Univ Appl Sci Upper Austria, Res Grp Computed Tomog, Wels, Austria.\nElberfeld, T.; De Beenhouwer, J.; Sijbers, J., Univ Antwerp, Imec Vis Lab, Antwerp, Belgium.\nFroehler, B.; Moeller, T., Uni Vienna, Data Sci, Vienna, Austria.\nFroehler, B.; Moeller, T., Univ Vienna, Fac Comp Sci, Vienna, Austria.\nHege, H. C., Zuse Inst Berlin, Visual Data Anal Dept, Berlin, Germany.", "countries": "Belgium;Germany;Austria", "abstract": "We present visual analysis methods for the evaluation of tomographic fiber reconstruction algorithms by means of analysis, visual debugging and comparison of reconstructed fibers in materials science. The methods are integrated in a tool (FIAKER) that supports the entire workflow. It enables the analysis of various fiber reconstruction algorithms, of differently parameterized fiber reconstruction algorithms and of individual steps in iterative fiber reconstruction algorithms. Insight into the performance of fiber reconstruction algorithms is obtained by a list-based ranking interface. A 3D view offers interactive visualization techniques to gain deeper insight, e.g., into the aggregated quality of the examined fiber reconstruction algorithms and parameterizations. The tool was designed in close collaboration with researchers who work with fiber-reinforced polymers on a daily basis and develop algorithms for tomographic reconstruction and characterization of such materials. We evaluate the tool using synthetic datasets as well as tomograms of real materials. Five case studies certify the usefulness of the tool, showing that it significantly accelerates the analysis and provides valuable insights that make it possible to improve the fiber reconstruction algorithms. The main contribution of the paper is the well-considered combination of methods and their seamless integration into a visual tool that supports the entire workflow. Further findings result from the analysis of (dis-)similarity measures for fibers as well as from the discussion of design decisions. It is also shown that the generality of the analytical methods allows a wider range of applications, such as the application in pore space analysis.", "keywords": "Simulation; parameter space analysis; ensemble visualization; industrial CT", "link": "https://doi.org/10.1111/cgf.13688", "refList": ["10.1109/tvcg.2018.2864506", "10.1007/s10921-018-0514-0", "10.1109/tmi.2007.906785", "10.1109/tvcg.2016.2582158", "10.4028/www.scientific.net/msf.825-826.907", "10.1007/s12021-016-9316-7", "10.1109/dasip.2018.8597098", "10.1109/kse.2015.48", "10.1364/oe.24.025129", "10.3139/217.2441", "10.1109/vast.2016.7883516", "10.1109/tvcg.2009.115", "10.1111/cgf.12895", "10.1088/1757-899x/406/1/012014", "10.1109/tvcg.2014.2346321", "10.1111/cgf.13415", "10.1109/pacificvis.2014.52", "10.1109/tvcg.2012.213", "10.1109/vast.2014.7042491", "10.1109/tvcg.2016.2598589", "10.1002/nbm.3902", "10.21105/joss.01185", "10.1109/tvcg.2013.173", "10.1145/3173574.3173943"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2018.2864510", "title": "Dynamic Volume Lines: Visual Comparison of 3D Volumes through Space-filling Curves", "year": "2018", "conferenceName": "SciVis", "authors": "Johannes Weissenböck;Bernhard Fröhler;M. Eduard Gröller;Johann Kastner;Christoph Heinzl", "citationCount": "5", "affiliation": "Weissenbock, J (Corresponding Author), Univ Appl Sci Upper Austria, Wels, Australia. Weissenboeck, Johannes; Froehler, Bernhard; Kastner, Johann; Heinzl, Christoph, Univ Appl Sci Upper Austria, Wels, Australia. Groeller, Eduard, TU Wien, Vienna, Austria. Groeller, Eduard, VRVis Res Ctr, Vienna, Austria.", "countries": "Austria;Australia", "abstract": "The comparison of many members of an ensemble is difficult, tedious, and error-prone, which is aggravated by often just subtle differences. In this paper, we introduce Dynamic Volume Lines for the interactive visual analysis and comparison of sets of 3D volumes. Each volume is linearized along a Hilbert space-filling curve into a 1D Hilbert line plot, which depicts the intensities over the Hilbert indices. We present a nonlinear scaling of these 1D Hilbert line plots based on the intensity variations in the ensemble of 3D volumes, which enables a more effective use of the available screen space. The nonlinear scaling builds the basis for our interactive visualization techniques. An interactive histogram heatmap of the intensity frequencies serves as overview visualization. When zooming in, the frequencies are replaced by detailed 1D Hilbert line plots and optional functional boxplots. To focus on important regions of the volume ensemble, nonlinear scaling is incorporated into the plots. An interactive scaling widget depicts the local ensemble variations. Our brushing and linking interface reveals, for example, regions with a high ensemble variation by showing the affected voxels in a 3D spatial view. We show the applicability of our concepts using two case studies on ensembles of 3D volumes resulting from tomographic reconstruction. In the first case study, we evaluate an artificial specimen from simulated industrial 3D X-ray computed tomography (XCT). In the second case study, a real-world XCT foam specimen is investigated. Our results show that Dynamic Volume Lines can identify regions with high local intensity variations, allowing the user to draw conclusions, for example, about the choice of reconstruction parameters. Furthermore, it is possible to detect ring artifacts in reconstructions volumes.", "keywords": "Ensemble data,comparative visualization,visual analysis,Hilbert curve,nonlinear scaling,X-ray computed tomography", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864510", "refList": ["10.1109/69.908985", "10.1109/tvcg.2013.143", "10.1177/1473871611416549", "10.1016/j.polymertesting.2005.07.005", "10.1109/icdmw.2009.55", "10.1364/josaa.1.000612", "10.1109/tvcg.2009.155", "10.2352/issn.2470-1173.2016.16.hvei-133", "10.1109/tvcg.2013.213", "10.1109/vl.1996.545307", "10.1109/tvcg.2014.2346455", "10.1002/sta4.39", "10.1109/vast.2016.7883516", "10.1145/3002151.3002165", "10.1109/mcg.2015.70", "10.1364/oe.19.013604", "10.1016/j.cag.2017.05.012", "10.1111/cgf.12895", "10.1103/physrevlett.98.108105", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2012.03054.x", "10.1109/tvcg.2014.2346321", "10.1109/tmi.2008.923696", "10.1007/978-3-540-77974-210", "10.1111/cgf.13214", "10.1109/vast.2014.7042491", "10.1109/icpr.1994.577130", "10.1016/j.ipl.2007.08.034", "10.1109/vast.2015.7347634", "10.1109/tvcg.2014.2346448", "10.1111/j.1467-8659.2012.03112.x", "10.1109/tvcg.2010.20", "10.1111/cgf.13177"], "wos": 1, "children": [{"doi": "10.1109/vast47406.2019.8986923", "title": "ICE: An Interactive Configuration Explorer for High Dimensional Categorical Parameter Spaces", "year": "2019", "conferenceName": "VAST", "authors": "Anjul Tyagi;Zhen Cao;Tyler Estro;Erez Zadok;Klaus Mueller", "citationCount": "0", "affiliation": "Tyagi, A (Corresponding Author), SUNY Stony Brook, Dept Comp Sci, Stony Brook, NY 11794 USA. Tyagi, Anjul; Cao, Zhen; Estro, Tyler; Zadok, Erez; Mueller, Klaus, SUNY Stony Brook, Dept Comp Sci, Stony Brook, NY 11794 USA.", "countries": "USA", "abstract": "There are many applications where users seek to explore the impact of the settings of several categorical variables with respect to one dependent numerical variable. For example, a computer systems analyst might want to study how the type of file system or storage device affects system performance. A usual choice is the method of Parallel Sets designed to visualize multivariate categorical variables, However, we found that the magnitude of the parameter impacts on the numerical variable cannot be easily observed here. We also attempted a dimension reduction approach based on Multiple Correspondence Analysis but found that the SVD-generated 2D layout resulted in a loss of information. We hence propose a novel approach, the Interactive Configuration Explorer (ICE), which directly addresses the need of analysts to learn how the dependent numerical variable is affected by the parameter settings given multiple optimization objectives. No information is lost as ICE shows the complete distribution and statistics of the dependent variable in context with each categorical variable. Analysts can interactively filter the variables to optimize for certain goals such as achieving a system with maximum performance, low variance, etc. Our system was developed in tight collaboration with a group of systems performance researchers and its final effectiveness was evaluated with expert interviews, a comparative user study, and two case studies.", "keywords": "Data Clustering,Illustrative Visualization,User Interfaces,High Dimensional Data", "link": "http://dx.doi.org/10.1109/VAST47406.2019.8986923", "refList": ["10.1109/sibgrapi.2015.38", "10.1023/a:1022602019183", "10.1109/tvcg.2013.182", "10.1021/acsami.9b02947", "10.1007/978-3-540-88411-8\\_2", "10.1023/a:1009769707641", "10.1016/j.patcog.2017.04.019", "10.1007/s10606-008-9080-9", "10.1109/tvcg.2017.2701829", "10.1109/tvcg.2010.223", "10.7551/mitpress/1090.001.0001", "10.1080/00949657508810123", "10.1145/502512.502530", "10.1109/tvcg.2011.185", "10.1109/tvcg.2014.2350494", "10.1007/bf02948829", "10.1109/visual.1997.663916", "10.2307/2685478", "10.1109/tvcg.2015.2467324", "10.1109/tvcg.2010.183", "10.1145/1496909.1496922", "10.1111/cgf.13176", "10.1145/3035918.3064029", "10.1111/j.1467-8659.2011.01940.x", "10.1109/jproc.2015.2494218", "10.1109/tvcg.2014.2346321", "10.1109/tits.2015.2436897", "10.1111/cgf.13214", "10.1137/s1052623497329683", "10.1126/science.290.5500.2323", "10.1109/tvcg.2015.2467132.3", "10.18637/jss.v048.i04", "10.1145/3116213", "10.1109/tvcg.2014.2346448", "10.1126/science.220.4598.671", "10.1109/iv.2009.103", "10.1111/j.1467-8659.2009.01684.x", "10.1109/tvcg.2018.2864510", "10.1109/tvcg.2015.2467132", "10.1109/nnsp.1999.788121", "10.1109/tvcg.2009.111", "10.1088/1748-9326/6/4/045404", "10.1177/1473871612439357", "10.1007/bf02239469", "10.1179/000870403235002042", "10.1109/tvcg.2006.76"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934258", "title": "Scale-Space Splatting: Reforming Spacetime for Cross-Scale Exploration of Integral Measures in Molecular Dynamics", "year": "2019", "conferenceName": "SciVis", "authors": "Juraj Pálenik;Jan Byska;Stefan Bruckner;Helwig Hauser", "citationCount": "0", "affiliation": "Palenik, J (Corresponding Author), Univ Bergen, Bergen, Norway. Palenik, Juraj; Byska, Jan; Bruckner, Stefan; Hauser, Helwig, Univ Bergen, Bergen, Norway. Byska, Jan, Masaryk Univ, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "Understanding large amounts of spatiotemporal data from particle-based simulations, such as molecular dynamics, often relies on the computation and analysis of aggregate measures. These, however, by virtue of aggregation, hide structural information about the space/time localization of the studied phenomena. This leads to degenerate cases where the measures fail to capture distinct behaviour. In order to drill into these aggregate values, we propose a multi-scale visual exploration technique. Our novel representation, based on partial domain aggregation, enables the construction of a continuous scale-space for discrete datasets and the simultaneous exploration of scales in both space and time. We link these two scale-spaces in a scale-space space-time cube and model linked views as orthogonal slices through this cube, thus enabling the rapid identification of spatio-temporal patterns at multiple scales. To demonstrate the effectiveness of our approach, we showcase an advanced exploration of a protein-ligand simulation.", "keywords": "Scale space,time-series,scientific simulation,multi-scale analysis,space-time cube,molecular dynamics", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934258", "refList": ["10.1111/cgf.13445", "10.1109/tvcg.2012.191", "10.1201/b14876", "10.1145/827051.827056", "10.1080/07391102.2005.10531229", "10.1021/acs.jcim.7b00070", "10.1007/978-3-8348-9190-729", "10.1111/cgf.13427", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1016/0021-9991(82)90025-0", "10.1111/cgf.13177", "10.1007/978-1-4757-6465-9", "10.1145/1044588.1044615", "10.2307/2669996", "10.1109/tvcg.2018.2865049", "10.1007/978-3-540-70823-0\\_3", "10.1111/cgf.13640", "10.1109/tvcg.2010.253", "10.1109/tvcg.2009.177", "10.1016/j.csda.2018.03.014", "10.1109/tvcg.2009.200", "10.1109/visual.2003.1250353", "10.2312/eurovisshort.20171146", "10.1109/tvcg.2010.148", "10.1002/9780470316849", "10.1109/visual.1993.398859", "10.1007/978-1-4612-4026-6", "10.1016/j.jmb.2018.09.004", "10.1111/cgf.13415", "10.2312/molva.20181102", "10.1371/journal.pcbi.1002708", "10.1007/s10851-010-0242-2", "10.1016/0263-7855(96)00018-5", "10.1109/visual.2003.1250402", "10.1007/bf01936872", "10.1002/wics.79", "10.1111/j.1467-8659.2009.01684.x", "10.1109/tvcg.2018.2864510", "10.1111/cgf.12804", "10.1117/12.904668", "10.1002/jcc.20289", "10.1088/0965-0393/18/1/015012", "10.1109/34.56205", "10.1111/j.1435-5597.1970.tb01464.x", "10.1007/978-0-85729-079-3", "10.1007/s11263-005-1838-7"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030419", "title": "Comparative Layouts Revisited: Design Space, Guidelines, and Future Directions", "year": "2020", "conferenceName": "InfoVis", "authors": "Sehi L'Yi;Jaemin Jo;Jinwook Seo", "citationCount": "0", "affiliation": "L'Yi, S (Corresponding Author), Harvard Med Sch, Boston, MA 02115 USA. L'Yi, Sehi, Harvard Med Sch, Boston, MA 02115 USA. Jo, Jaemin, Sungkyunkwan Univ, Seoul, South Korea. Seo, Jinwook, Seoul Natl Univ, Seoul, South Korea.", "countries": "USA;Korea", "abstract": "We present a systematic review on three comparative layouts-juxtaposition, superposition, and explicit-encoding-which are information visualization (InfoVis) layouts designed to support comparison tasks. For the last decade, these layouts have served as fundamental idioms in designing many visualization systems. However, we found that the layouts have been used with inconsistent terms and confusion, and the lessons from previous studies are fragmented. The goal of our research is to distill the results from previous studies into a consistent and reusable framework. We review 127 research papers, including 15 papers with quantitative user studies, which employed comparative layouts. We first alleviate the ambiguous boundaries in the design space of comparative layouts by suggesting lucid terminology (e.g., chart-wise and item-wise juxtaposition). We then identify the diverse aspects of comparative layouts, such as the advantages and concerns of using each layout in the real-world scenarios and researchers' approaches to overcome the concerns. Building our knowledge on top of the initial insights gained from the Gleicher et al.'s survey [19], we elaborate on relevant empirical evidence that we distilled from our survey (e.g., the actual effectiveness of the layouts in different study settings) and identify novel facets that the original work did not cover (e.g., the familiarity of the layouts to people). Finally, we show the consistent and contradictory results on the performance of comparative layouts and offer practical implications for using the layouts by suggesting trade-offs and seven actionable guidelines.", "keywords": "Comparative layout,visual comparison,literature review,juxtaposition,superposition,explicit-encoding", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030419", "refList": ["10.1109/tvcg.2013.233", "10.1111/cgf.12380", "10.1177/1473871611416549", "10.1145/2702123.2702419", "10.1109/tvcg.2014.2322363", "10.1111/cgf.12791", "10.1145/2702123.2702130", "10.1145/2702123.2702217", "10.1109/tvcg.2012.237", "10.1177/1473871613480062", "10.1109/mcg.2017.377152546", "10.1109/tvcg.2013.213", "10.1111/cgf.12369", "10.1109/tvcg.2017.2744198", "10.1145/3139295.3139309", "10.1109/tvcg.2019.2934801", "10.1109/tvcg.2013.122", "10.1109/tvcg.2017.2747545", "10.1109/tvcg.2015.2413774", "10.1037/0096-1523.24.3.719", "10.1109/tvcg.2014.2346320", "10.1109/tvcg.2007.70535", "10.1109/mcg.2018.032421661", "10.1109/tvcg.2017.2744199", "10.1145/2556288.2557141", "10.1109/tvcg.2013.149", "10.1145/1165734.1165736", "10.5220/0006127502170224", "10.1109/tvcg.2017.2745298", "10.1177/1473871617692841", "10.1190/int-2017-0083.1", "10.1190/int-2014-0283.1", "10.1109/tvcg.2016.2598796", "10.1111/cgf.13401", "10.1016/j.cag.2017.05.005", "10.1177/1473871616667632", "10.1145/3025453.3025882", "10.1145/2470654.2470724", "10.1109/tvcg.2007.70539", "10.1109/tvcg.2018.2864884", "10.1109/tvcg.2010.164", "10.1145/3103010.3103013", "10.1109/pacificvis.2016.7465266", "10.1109/pacificvis.2012.6183556", "10.1109/tvcg.2015.2467751", "10.1109/tvcg.2018.2796557", "10.1111/cgf.13531", "10.1109/tvcg.2013.161", "10.1109/iv.2018.00051", "10.1109/tvcg.2010.162", "10.1109/tvcg.2018.2864510", "10.1109/iv.2017.30", "10.1109/tvcg.2007.70623"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 9}, {"doi": "10.1109/vast47406.2019.8986923", "title": "ICE: An Interactive Configuration Explorer for High Dimensional Categorical Parameter Spaces", "year": "2019", "conferenceName": "VAST", "authors": "Anjul Tyagi;Zhen Cao;Tyler Estro;Erez Zadok;Klaus Mueller", "citationCount": "0", "affiliation": "Tyagi, A (Corresponding Author), SUNY Stony Brook, Dept Comp Sci, Stony Brook, NY 11794 USA. Tyagi, Anjul; Cao, Zhen; Estro, Tyler; Zadok, Erez; Mueller, Klaus, SUNY Stony Brook, Dept Comp Sci, Stony Brook, NY 11794 USA.", "countries": "USA", "abstract": "There are many applications where users seek to explore the impact of the settings of several categorical variables with respect to one dependent numerical variable. For example, a computer systems analyst might want to study how the type of file system or storage device affects system performance. A usual choice is the method of Parallel Sets designed to visualize multivariate categorical variables, However, we found that the magnitude of the parameter impacts on the numerical variable cannot be easily observed here. We also attempted a dimension reduction approach based on Multiple Correspondence Analysis but found that the SVD-generated 2D layout resulted in a loss of information. We hence propose a novel approach, the Interactive Configuration Explorer (ICE), which directly addresses the need of analysts to learn how the dependent numerical variable is affected by the parameter settings given multiple optimization objectives. No information is lost as ICE shows the complete distribution and statistics of the dependent variable in context with each categorical variable. Analysts can interactively filter the variables to optimize for certain goals such as achieving a system with maximum performance, low variance, etc. Our system was developed in tight collaboration with a group of systems performance researchers and its final effectiveness was evaluated with expert interviews, a comparative user study, and two case studies.", "keywords": "Data Clustering,Illustrative Visualization,User Interfaces,High Dimensional Data", "link": "http://dx.doi.org/10.1109/VAST47406.2019.8986923", "refList": ["10.1109/sibgrapi.2015.38", "10.1023/a:1022602019183", "10.1109/tvcg.2013.182", "10.1021/acsami.9b02947", "10.1007/978-3-540-88411-8\\_2", "10.1023/a:1009769707641", "10.1016/j.patcog.2017.04.019", "10.1007/s10606-008-9080-9", "10.1109/tvcg.2017.2701829", "10.1109/tvcg.2010.223", "10.7551/mitpress/1090.001.0001", "10.1080/00949657508810123", "10.1145/502512.502530", "10.1109/tvcg.2011.185", "10.1109/tvcg.2014.2350494", "10.1007/bf02948829", "10.1109/visual.1997.663916", "10.2307/2685478", "10.1109/tvcg.2015.2467324", "10.1109/tvcg.2010.183", "10.1145/1496909.1496922", "10.1111/cgf.13176", "10.1145/3035918.3064029", "10.1111/j.1467-8659.2011.01940.x", "10.1109/jproc.2015.2494218", "10.1109/tvcg.2014.2346321", "10.1109/tits.2015.2436897", "10.1111/cgf.13214", "10.1137/s1052623497329683", "10.1126/science.290.5500.2323", "10.1109/tvcg.2015.2467132.3", "10.18637/jss.v048.i04", "10.1145/3116213", "10.1109/tvcg.2014.2346448", "10.1126/science.220.4598.671", "10.1109/iv.2009.103", "10.1111/j.1467-8659.2009.01684.x", "10.1109/tvcg.2018.2864510", "10.1109/tvcg.2015.2467132", "10.1109/nnsp.1999.788121", "10.1109/tvcg.2009.111", "10.1088/1748-9326/6/4/045404", "10.1177/1473871612439357", "10.1007/bf02239469", "10.1179/000870403235002042", "10.1109/tvcg.2006.76"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis.2018.00017", "year": "2018", "title": "In Situ Prediction Driven Feature Analysis in Jet Engine Simulations", "conferenceName": "PacificVis", "authors": "Soumya Dutta;Han{-}Wei Shen;Jen{-}Ping Chen", "citationCount": "5", "affiliation": "Dutta, S (Corresponding Author), Ohio State Univ, Columbus, OH 43210 USA.\nDutta, Soumya; Shen, Han-Wei; Chen, Jen-Ping, Ohio State Univ, Columbus, OH 43210 USA.", "countries": "USA", "abstract": "Efficient feature exploration in large-scale data sets using traditional post-hoc analysis approaches is becoming prohibitive due to the bottleneck stemming from I/O and output data sizes. This problem becomes more challenging when an ensemble of simulations are required to run for studying the influence of input parameters on the model output. As a result, scientists are inclining more towards analyzing the data in situ while it resides in the memory. In situ analysis aims at minimizing expensive data movement while maximizing the resource utilization for extraction of important information from the data. In this work, we study the evolution of rotating stall in jet engines using data generated from a large-scale flow simulation under various input conditions. Since the features of interest lack a precise descriptor, we adopt a fuzzy rule-based machine learning algorithm for efficient and robust extraction of such features. For scalable exploration, we advocate for an off-line learning and in situ prediction driven strategy that facilitates in-depth study of the stall. Task-specific information estimated in situ is visualized interactively during the post-hoc analysis revealing important details about the inception and evolution of stall. We verify and validate our method through comprehensive expert evaluation demonstrating the efficacy of our approach.", "keywords": "In situ analysis; machine learning in visualization; fuzzy rule-based system; multivariate analysis; rotating stall; big data analytics", "link": "https://doi.org/10.1109/PacificVis.2018.00017", "refList": ["10.1002/cyto.a.20411", "10.1109/tvcg.2017.2745178", "10.1109/pacificvis.2015.7156381", "10.1109/tvcg.2015.2467411", "10.1109/tvcg.2013.18", "10.2312/egpgv/egpgv11/101-109", "10.1109/tfuzz.2002.1006431", "10.1109/tip.2014.2312289", "10.1109/pacificvis.2017.8031585", "10.1111/j.1467-8659.2011.01964.x", "10.1109/mcg.2007.129", "10.1109/tvcg.2016.2598604", "10.1145/1383529.1383533", "10.1109/mcg.2010.55", "10.1111/j.1467-8659.2011.01940.x", "10.1109/ldav.2011.6092322", "10.1145/2535571.2535592", "10.1109/pacificvis.2009.4906833", "10.1109/tvcg.2017.2745258", "10.1109/tvcg.2012.227", "10.1111/cgf.13214", "10.1111/cgf.12275", "10.1615/int.j.uncertaintyquantification.2015013730", "10.1109/sc.2014.40", "10.1109/tvcg.2015.2467952", "10.1109/tvcg.2009.199", "10.1109/mcg.2012.87", "10.1109/tvcg.2005.38", "10.1109/ldav.2011.6092178", "10.1109/tvcg.2017.2744818", "10.1115/1.2812968", "10.1109/ldav.2014.7013204", "10.1109/tvcg.2015.2467436"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864801", "title": "CoDDA: A Flexible Copula-based Distribution Driven Analysis Framework for Large-Scale Multivariate Data", "year": "2018", "conferenceName": "SciVis", "authors": "Subhashis Hazarika;Soumya Dutta;Han-Wei Shen;Jen-Ping Chen", "citationCount": "3", "affiliation": "Hazarika, S (Corresponding Author), Ohio State Univ, GRAVITY Res Grp, Dept Comp Sci \\& Engn, Columbus, OH 43210 USA. Hazarika, Subhashis; Dutta, Soumya; Shen, Han-Wei, Ohio State Univ, GRAVITY Res Grp, Dept Comp Sci \\& Engn, Columbus, OH 43210 USA. Chen, Jen-Ping, Ohio State Univ, Dept Mech \\& Aerosp Engn, Columbus, OH 43210 USA.", "countries": "USA", "abstract": "CoDDA (Copula-based Distribution Driven Analysis) is a flexible framework for large-scale multivariate datasets. A common strategy to deal with large-scale scientific simulation data is to partition the simulation domain and create statistical data summaries. Instead of storing the high-resolution raw data from the simulation, storing the compact statistical data summaries results in reduced storage overhead and alleviated I/O bottleneck. Such summaries, often represented in the form of statistical probability distributions, can serve various post-hoc analysis and visualization tasks. However, for multivariate simulation data using standard multivariate distributions for creating data summaries is not feasible. They are either storage inefficient or are computationally expensive to be estimated in simulation time (in situ) for large number of variables. In this work, using copula functions, we propose a flexible multivariate distribution-based data modeling and analysis framework that offers significant data reduction and can be used in an in situ environment. The framework also facilitates in storing the associated spatial information along with the multivariate distributions in an efficient representation. Using the proposed multivariate data summaries, we perform various multivariate post-hoc analyses like query-driven visualization and sampling-based visualization. We evaluate our proposed method on multiple real-world multivariate scientific datasets. To demonstrate the efficacy of our framework in an in situ environment, we apply it on a large-scale flow simulation.", "keywords": "In situ processing,Distribution-based,Multivariate,Query-driven,Copula", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864801", "refList": ["10.1109/tvcg.2007.70615", "10.1109/tvcg.2015.2467204", "10.1080/13504860210136721a", "10.1111/cgf.12100", "10.1109/ldav.2011.6092313", "10.1109/tvcg.2015.2467411", "10.1109/iv.2002.1028780", "10.1109/tvcg.2010.247", "10.2312/egpgv/egpgv11/101-109", "10.1111/j.1467-8659.2009.01677.x", "10.1109/tvcg.2015.2467958", "10.1111/j.1467-8659.2011.01944.x", "10.1109/pacificvis.2017.8031585", "10.1111/j.1467-8659.2011.01964.x", "10.1109/tvcg.2010.80", "10.1109/tvcg.2016.2598604", "10.1109/mcg.2010.55", "10.1109/pacificvis.2014.60", "10.1109/tvcg.2006.165", "10.1109/ldav.2011.6092322", "10.1109/tpami.2014.2307886", "10.2307/2684359", "10.1145/2020408.2020509", "10.1137/15m1016308", "10.1109/ldav.2015.7348071", "10.1109/pacificvis.2017.8031590", "10.1109/sc.2014.40", "10.1109/tvcg.2015.2467952", "10.1109/icdmw.2011.135", "10.1109/pacificvis.2018.00017", "10.1109/vast.2015.7347634", "10.1016/b978-044450896-6.50010-8", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1016/j.insmatheco.2006.11.011", "10.1007/978-3-642-35407-6\\_3", "10.1109/tvcg.2006.100", "10.1109/ldav.2011.6092178", "10.1115/1.2812968", "10.1109/ldav.2014.7013204", "10.1109/ldav.2016.7874311", "10.1109/tvcg.2015.2467436", "10.1111/cgf.12930", "10.1111/j.1467-8659.2012.03096.x", "10.1109/tvcg.2007.70519"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934335", "title": "Void-and-Cluster Sampling of Large Scattered Data and Trajectories", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "3", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "We propose a data reduction technique for scattered data based on statistical sampling. Our void-and-cluster sampling technique finds a representative subset that is optimally distributed in the spatial domain with respect to the blue noise property. In addition, it can adapt to a given density function, which we use to sample regions of high complexity in the multivariate value domain more densely. Moreover, our sampling technique implicitly defines an ordering on the samples that enables progressive data loading and a continuous level-of-detail representation. We extend our technique to sample time-dependent trajectories, for example pathlines in a time interval, using an efficient and iterative approach. Furthermore, we introduce a local and continuous error measure to quantify how well a set of samples represents the original dataset. We apply this error measure during sampling to guide the number of samples that are taken. Finally, we use this error measure and other quantities to evaluate the quality, performance, and scalability of our algorithm.", "keywords": "Data reduction,sampling,blue noise,entropy-based sampling,scattered data,pathlines", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934335", "refList": ["10.1145/3281464.3281467", "10.1109/ldav.2014.7013206", "10.1137/0903027", "10.1109/ldav.2011.6092313", "10.1111/cgf.13336", "10.1117/12.152707", "10.1109/tvcg.2014.2350479", "10.1109/pacificvis.2017.8031585", "10.1111/j.1467-8659.2011.01964.x", "10.1145/1556262.1556289", "10.1109/iv.2017.20", "10.1109/tvcg.2016.2598604", "10.1109/tvcg.2010.227", "10.1007/s10586-014-0360-5", "10.1109/tvcg.2018.2864801", "10.1145/1531326.1531392", "10.1145/1278780.1278807", "10.1109/tvcg.2010.148", "10.1016/j.jfluidstructs.2013.08.007", "10.1109/tvcg.2016.2620975", "10.1146/annurev.aa.30.090192.002551", "10.1109/pacificvis.2011.5742372", "10.1109/tvcg.2014.2346324", "10.1109/5.3288", "10.1109/pacificvis.2017.8031590", "10.1109/pacificvis.2018.00016", "10.1109/bigdata.2013.6691717"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2020.3030473", "title": "Data-Driven Space-Filling Curves", "year": "2020", "conferenceName": "SciVis", "authors": "Liang Zhou;Christopher R. Johnson;Daniel Weiskopf", "citationCount": "0", "affiliation": "Zhou, L (Corresponding Author), Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang, Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang; Johnson, Chris R., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Visualizat Res Ctr VLSUS, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "Abstract-We propose a data-driven space-filling curve method for 2D and 3D visualization. Our flexible curve traverses the data elements in the spatial domain in a way that the resulting linearization better preserves features in space compared to existing methods. We achieve such data coherency by calculating a Hamiltonian path that approximately minimizes an objective function that describes the similarity of data values and location coherency in a neighborhood. Our extended variant even supports multiscale data via quadtrees and octrees. Our method is useful in many areas of visualization including multivariate or comparative visualization ensemble visualization of 2D and 3D data on regular grids or multiscale visual analysis of particle simulations. The effectiveness of our method is evaluated with numerical comparisons to existing techniques and through examples of ensemble and multivariate datasets.", "keywords": "Space-filling curves,comparative visualization,ensemble visualization,multivariate visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030473", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1467-8659.2011.01914.x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.1109/tvcg.2019", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2010.176", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 9}, {"doi": "10.1109/pacificvis48177.2020.1186", "year": "2020", "title": "Distribution-based Particle Data Reduction for In-situ Analysis and Visualization of Large-scale N-body Cosmological Simulations", "conferenceName": "PacificVis", "authors": "Guan Li;Jiayi Xu;Tianchi Zhang;Guihua Shan;Han{-}Wei Shen;Ko{-}Chih Wang;Shihong Liao;Zhonghua Lu", "citationCount": "0", "affiliation": "Shan, GH (Corresponding Author), Chinese Acad Sci, Comp Network Informat Ctr, Beijing, Peoples R China.\nLi, Guan; Shan, Guihua; Lu, Zhonghua, Chinese Acad Sci, Comp Network Informat Ctr, Beijing, Peoples R China.\nLi, Guan; Zhang, Tianchi, Univ Chinese Acad Sci, Beijing, Peoples R China.\nXu, Jiayi; Shen, Han-Wei, Ohio State Univ, Columbus, OH 43210 USA.\nZhang, Tianchi; Liao, Shihong, Chinese Acad Sci, Natl Astron Observ, Beijing, Peoples R China.\nWang, Ko-Chih, Natl Taiwan Normal Univ, Taipei, Taiwan.", "countries": "USA;Taiwan;China", "abstract": "Cosmological N-body simulation is an important tool for scientists to study the evolution of the universe. With the increase of computing power, billions of particles of high space-time fidelity can be simulated by supercomputers. However, limited computer storage can only hold a small subset of the simulation output for analysis, which makes the understanding of the underlying cosmological phenomena difficult. To alleviate the problem, we design an in-situ data reduction method for large-scale unstructured particle data. During the data generation phase, we use a combined k-dimensional partitioning and Gaussian mixture model approach to reduce the data by utilizing probability distributions. We offer a model evaluation criterion to examine the quality of the probabilistic distribution models, which allows us to identify and improve low-quality models. After the in-situ processing, the particle data size is greatly reduced, which satisfies the requirements from the domain experts. By comparing the astronomical attributes and visualizations of the reconstructed data with the raw data, we demonstrate the effectiveness of our in-situ particle data reduction technique.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization", "link": "https://doi.org/10.1109/PacificVis48177.2020.1186", "refList": ["10.1016/j.cag.2003.10.018", "10.1109/tvcg.2010.215", "10.1109/tvcg.2015.2467411", "10.1109/mcg.2009.120", "10.1111/j.2517-6161.1977.tb01600.x", "10.1109/pacificvis.2016.7465273", "10.1051/0004-6361/201321591", "10.1109/pacificvis.2017.8031585", "10.1109/tvcg.2016.2534560", "10.1109/ipdps.2016.11", "10.1111/j.1467-8659.2011.01964.x", "10.1109/pacificvis.2018.00013", "10.1145/3144769.3144776", "10.1186/s40668-017-0021-1", "10.1111/j.1365-2966.2005.09655.x", "10.1145/3139295.3139297", "10.1145/361002.361007", "10.1109/tvcg.2016.2598604", "10.1109/visual.2001.964520", "10.1109/mcg.2010.55", "10.1038/nature03597", "10.1214/aoms/1177728352", "10.1086/152650", "10.1080/10635150490522304", "10.1109/pacificvis.2018.00017", "10.1109/ldav.2012.6378978", "10.1109/pacificvis.2018.00016", "10.1109/ldav.2011.6092178", "10.1109/pacificvis.2015.7156380"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030473", "title": "Data-Driven Space-Filling Curves", "year": "2020", "conferenceName": "SciVis", "authors": "Liang Zhou;Christopher R. Johnson;Daniel Weiskopf", "citationCount": "0", "affiliation": "Zhou, L (Corresponding Author), Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang, Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang; Johnson, Chris R., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Visualizat Res Ctr VLSUS, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "Abstract-We propose a data-driven space-filling curve method for 2D and 3D visualization. Our flexible curve traverses the data elements in the spatial domain in a way that the resulting linearization better preserves features in space compared to existing methods. We achieve such data coherency by calculating a Hamiltonian path that approximately minimizes an objective function that describes the similarity of data values and location coherency in a neighborhood. Our extended variant even supports multiscale data via quadtrees and octrees. Our method is useful in many areas of visualization including multivariate or comparative visualization ensemble visualization of 2D and 3D data on regular grids or multiscale visual analysis of particle simulations. The effectiveness of our method is evaluated with numerical comparisons to existing techniques and through examples of ensemble and multivariate datasets.", "keywords": "Space-filling curves,comparative visualization,ensemble visualization,multivariate visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030473", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1467-8659.2011.01914.x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.1109/tvcg.2019", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2010.176", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 5}, {"doi": "10.1109/pacificvis.2019.00043", "year": "2019", "title": "Statistical Super Resolution for Data Analysis and Visualization of Large Scale Cosmological Simulations", "conferenceName": "PacificVis", "authors": "Ko{-}Chih Wang;Jiayi Xu;Jonathan Woodring;Han{-}Wei Shen", "citationCount": "0", "affiliation": "Wang, KC (Corresponding Author), Ohio State Univ, Columbus, OH 43210 USA.\nWang, Ko-Chih; Xu, Jiayi; Shen, Han-Wei, Ohio State Univ, Columbus, OH 43210 USA.\nWoodring, Jonathan, Los Alamos Natl Lab, Los Alamos, NM USA.", "countries": "USA", "abstract": "Cosmologists build simulations for the evolution of the universe using different initial parameters. By exploring the datasets from different simulation runs, cosmologists can understand the evolution of our universe and approach its initial conditions. A cosmological simulation nowadays can generate datasets on the order of petabytes. Moving datasets from the supercomputers to post data analysis machines is infeasible. We propose a novel approach called statistical super-resolution to tackle the big data problem for cosmological data analysis and visualization. It uses datasets from a few simulation runs to create a prior knowledge, which captures the relation between low- and high-resolution data. We apply in situ statistical down-sampling to datasets generated from simulation runs to minimize the requirements of I/O bandwidth and storage. High-resolution datasets are reconstructed from the statistical down-sampled data by using the prior knowledge for scientists to perform advanced data analysis and render high-quality visualizations.", "keywords": "", "link": "https://doi.org/10.1109/PacificVis.2019.00043", "refList": ["10.1109/visual.2004.110", "10.1016/j.cag.2003.10.018", "10.1109/tvcg.2010.215", "10.1111/cgf.13336", "10.1109/mcg.2009.120", "10.1109/pacificvis.2017.8031585", "10.1109/ipdps.2016.11", "10.1109/pacificvis.2018.00013", "10.1109/pvgs.2003.1249044", "10.1109/chicc.2014.6896189", "10.1016/j.parco.2015.10.005", "10.1109/tip.2010.2050625", "10.1088/0004-637x/765/1/39", "10.1109/tvcg.2016.2598604", "10.1086/163168", "10.1109/visual.2001.964520", "10.1109/tvcg.2014.2346324", "10.1109/pacificvis.2017.8031590", "10.1109/sc.2014.40", "10.1109/pacificvis.2018.00017", "10.1109/ldav.2012.6378978", "10.1016/j.apm.2017.11.036", "10.1109/mcg.2016.48", "10.1002/cpe.2887", "10.1186/s40668-016-0017-2", "10.1109/pacificvis.2018.00016", "10.1109/pacificvis.2015.7156380", "10.1111/j.1467-8659.2009.01690.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030473", "title": "Data-Driven Space-Filling Curves", "year": "2020", "conferenceName": "SciVis", "authors": "Liang Zhou;Christopher R. Johnson;Daniel Weiskopf", "citationCount": "0", "affiliation": "Zhou, L (Corresponding Author), Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang, Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang; Johnson, Chris R., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Visualizat Res Ctr VLSUS, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "Abstract-We propose a data-driven space-filling curve method for 2D and 3D visualization. Our flexible curve traverses the data elements in the spatial domain in a way that the resulting linearization better preserves features in space compared to existing methods. We achieve such data coherency by calculating a Hamiltonian path that approximately minimizes an objective function that describes the similarity of data values and location coherency in a neighborhood. Our extended variant even supports multiscale data via quadtrees and octrees. Our method is useful in many areas of visualization including multivariate or comparative visualization ensemble visualization of 2D and 3D data on regular grids or multiscale visual analysis of particle simulations. The effectiveness of our method is evaluated with numerical comparisons to existing techniques and through examples of ensemble and multivariate datasets.", "keywords": "Space-filling curves,comparative visualization,ensemble visualization,multivariate visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030473", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1467-8659.2011.01914.x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.1109/tvcg.2019", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2010.176", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 5}], "len": 23}], "len": 41}], "len": 45}, "index": 285, "embedding": [-1.4286314249038696, 1.3293321132659912, -1.0434188842773438, -2.387450695037842, -0.6721880435943604, 0.16650904715061188, 0.42946866154670715, 1.2624232769012451, -0.45468848943710327, 0.2377346158027649, -0.33917665481567383, -0.2851685583591461, -0.15996834635734558, 0.1735231876373291, 1.1692893505096436, 1.9763753414154053, -0.24351109564304352, 0.4683237075805664, -0.7097932696342468, 1.539340615272522, -0.06630208343267441, 2.0563111305236816, 0.47184431552886963, 1.5524197816848755, -2.424682378768921, 1.525795340538025, -0.5581337213516235, 0.7557659149169922, 1.6443884372711182, -0.8774524927139282, -0.23785287141799927, 1.0458042621612549], "projection": [-0.5606340169906616, 9.477499961853027], "size": 23, "height": 6, "width": 8}