{"data": {"doi": "10.1109/tvcg.2014.2346322", "title": "Vivaldi: A Domain-Specific Language for Volume Processing and Visualization on Distributed Heterogeneous Systems", "year": "2014", "conferenceName": "SciVis", "authors": "Hyungsuk Choi;Woohyuk Choi;Tran Minh Quan;David G. C. Hildebrand;Hanspeter Pfister;Won-Ki Jeong", "citationCount": "18", "affiliation": "Choi, H (Corresponding Author), UNIST, Ulsan, South Korea. Choi, Hyungsuk; Choi, Woohyuk; Quan, Tran Minh; Jeong, Won-Ki, UNIST, Ulsan, South Korea. Hildebrand, David G. C.; Pfister, Hanspeter, Harvard Univ, Cambridge, MA 02138 USA.", "countries": "USA;Korea", "abstract": "As the size of image data from microscopes and telescopes increases, the need for high-throughput processing and visualization of large volumetric data has become more pressing. At the same time, many-core processors and GPU accelerators are commonplace, making high-performance distributed heterogeneous computing systems affordable. However, effectively utilizing GPU clusters is difficult for novice programmers, and even experienced programmers often fail to fully leverage the computing power of new parallel architectures due to their steep learning curve and programming complexity. In this paper, we propose Vivaldi, a new domain-specific language for volume processing and visualization on distributed heterogeneous computing systems. Vivaldi's Python-like grammar and parallel processing abstractions provide flexible programming tools for non-experts to easily write high-performance parallel computing code. Vivaldi provides commonly used functions and numerical operators for customized visualization and high-throughput image processing applications. We demonstrate the performance and usability of Vivaldi on several examples ranging from volume rendering to image segmentation.", "keywords": "Domain-specific language, volume rendering, GPU computing, distributed heterogeneous systems", "link": "http://dx.doi.org/10.1109/TVCG.2014.2346322", "refList": ["10.1109/mcse.2010.69", "10.1109/visual.2004.95", "10.1109/icpp.2011.22", "10.1109/tpds.2012.160", "10.1145/1015706.1015800", "10.1145/1966394.1966396", "10.1109/tvcg.2012.32", "10.1145/2345156.2254079", "10.1109/tvcg.2008.104", "10.2312/egpgv/egpgv08/049-056"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2015.2467449", "title": "Diderot: a Domain-Specific Language for Portable Parallel Scientific Visualization and Image Analysis", "year": "2015", "conferenceName": "SciVis", "authors": "Gordon L. Kindlmann;Charisee Chiw;Nicholas Seltzer;Lamont Samuels;John H. Reppy", "citationCount": "17", "affiliation": "Kindlmann, G (Corresponding Author), Univ Chicago, Dept Comp Sci, Chicago, IL 60637 USA. Kindlmann, Gordon; Chiw, Charisee; Seltzer, Nicholas; Samuels, Lamont; Reppy, John, Univ Chicago, Dept Comp Sci, Chicago, IL 60637 USA.", "countries": "USA", "abstract": "Many algorithms for scientific visualization and image analysis are rooted in the world of continuous scalar, vector, and tensor fields, but are programmed in low-level languages and libraries that obscure their mathematical foundations. Diderot is a parallel domain-specific language that is designed to bridge this semantic gap by providing the programmer with a high-level, mathematical programming notation that allows direct expression of mathematical concepts in code. Furthermore, Diderot provides parallel performance that takes advantage of modern multicore processors and GPUs. The high-level notation allows a concise and natural expression of the algorithms and the parallelism allows efficient execution on real-world datasets.", "keywords": "Domain specific language, portable parallel programming, scientific visualization, tensor fields", "link": "http://dx.doi.org/10.1109/TVCG.2015.2467449", "refList": ["10.2514/3.25224", "10.1145/1118890.1118892", "10.1109/tvcg.2011.185", "10.1145/2345156.2254079", "10.2140/pjm.1966.16.1", "10.1016/j.jmr.2011.09.022", "10.1109/tvcg.2012.240", "10.1109/visual.1999.809896", "10.1109/tvcg.2014.2346318", "10.1016/b978-012387582-2/50038-1", "10.1109/tpami.1986.4767851", "10.1016/s0022-5096(00)00023-5", "10.1145/2185520.2185528", "10.1145/361002.361007", "10.1111/j.1467-8659.2011.01952.x", "10.1109/visual.1998.745290", "10.1109/tvcg.2008.163", "10.1145/79173.79181", "10.1109/mcg.2009.130", "10.1016/s0898-1221(02)00210-9", "10.1109/smi.2005.41", "10.1109/2945.597800", "10.1109/visual.2003.1250414", "10.1016/s0022-0000(73)80033-9", "10.1109/tvcg.2008.148", "10.1109/78.193221", "10.1145/1932682.1869527", "10.1016/j.parco.2007.09.001", "10.1109/tvcg.2009.174", "10.1109/tvcg.2007.70534", "10.1109/tvcg.2014.2346322", "10.1109/38.511", "10.1145/352029.352035"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864841", "title": "A Declarative Grammar of Flexible Volume Visualization Pipelines", "year": "2018", "conferenceName": "SciVis", "authors": "Min Shih;Charles Rozhon;Kwan-Liu Ma", "citationCount": "1", "affiliation": "Shih, M (Corresponding Author), Univ Calif Davis, Davis, CA 95616 USA. Shih, Min; Rozhon, Charles; Ma, Kwan-Liu, Univ Calif Davis, Davis, CA 95616 USA.", "countries": "USA", "abstract": "This paper presents a declarative grammar for conveniently and effectively specifying advanced volume visualizations. Existing methods for creating volume visualizations either lack the flexibility to specify sophisticated visualizations or are difficult to use for those unfamiliar with volume rendering implementation and parameterization. Our design provides the ability to quickly create expressive visualizations without knowledge of the volume rendering implementation. It attempts to capture aspects of those difficult but powerful methods while remaining flexible and easy to use. As a proof of concept, our current implementation of the grammar allows users to combine multiple data variables in various ways and define transfer functions for diverse input data. The grammar also has the ability to describe advanced shading effects and create animations. We demonstrate the power and flexibility of our approach using multiple practical volume visualizations.", "keywords": "Volume visualization,direct volume rendering,declarative specification,multivariate/multimodal volume data,animation", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864841", "refList": ["10.1109/38.31462", "10.1007/978-0-387-98141-3\\_1", "10.1109/visual.1992.235219", "10.1109/visual.2004.95", "10.1080/14685240802376389", "10.1109/tvcg.2015.2467449", "10.1109/visual.2005.1532788", "10.1109/tvcg.2011.185", "10.1145/2345156.2254079", "10.1109/scivis.2015.7429514", "10.1109/tvcg.2014.2346318", "10.1111/j.1467-8659.2011.01952.x", "10.2312/vissym/eurovis07/115-122", "10.1109/tvcg.2002.1021579", "10.1109/mcg.2009.130", "10.1109/tvcg.2015.2467091", "10.1109/tvcg.2007.70555", "10.1111/j.1467-8659.2007.01095.x", "10.1016/j.parco.2007.09.001", "10.1109/tvcg.2009.174", "10.1109/tvcg.2007.70534", "10.1109/tvcg.2016.2599041", "10.1109/tvcg.2014.2346322", "10.1109/mcg.2008.96", "10.1109/tvcg.2009.189", "10.1109/ipdps.2011.385", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2018.2864848", "title": "Shared-Memory Parallel Computation of Morse-Smale Complexes with Improved Accuracy", "year": "2018", "conferenceName": "SciVis", "authors": "Attila Gyulassy;Peer-Timo Bremer;Valerio Pascucci", "citationCount": "5", "affiliation": "Gyulassy, A (Corresponding Author), Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Gyulassy, Attila; Pascucci, Valerio, Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Bremer, Peer-Timo, Lawrence Livermore Natl Lab, Livermore, CA USA.", "countries": "USA", "abstract": "Topological techniques have proven to be a powerful tool in the analysis and visualization of large-scale scientific data. In particular, the Morse-Smale complex and its various components provide a rich framework for robust feature definition and computation. Consequently, there now exist a number of approaches to compute Morse-Smale complexes for large-scale data in parallel. However, existing techniques are based on discrete concepts which produce the correct topological structure but are known to introduce grid artifacts in the resulting geometry. Here, we present a new approach that combines parallel streamline computation with combinatorial methods to construct a high-quality discrete Morse-Smale complex. In addition to being invariant to the orientation of the underlying grid, this algorithm allows users to selectively build a subset of features using high-quality geometry. In particular, a user may specifically select which ascending/descending manifolds are reconstructed with improved accuracy, focusing computational effort where it matters for subsequent analysis. This approach computes Morse-Smale complexes for larger data than previously feasible with significant speedups. We demonstrate and validate our approach using several examples from a variety of different scientific domains, and evaluate the performance of our method.", "keywords": "Morse complex,Parallel Computation,Topology,Accurate Geometry", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864848", "refList": ["10.1002/jcc.25181", "10.1007/s00454-003-2926-5", "10.1109/tpami.2011.95", "10.1109/tvcg.2010.235", "10.1007/s00454-002-2885-2", "10.1109/tvcg.2006.57", "10.1109/tvcg.2015.2467449", "10.1016/j.cagd.2012.03.017", "10.1145/777792.777846", "10.1109/tvcg.2008.110", "10.1109/tvcg.2007.70603", "10.1109/tvcg.2004.3", "10.1109/tvcg.2006.186", "10.1109/ldav.2016.7874333", "10.1021/jp981794v", "10.1016/j.jsc.2016.03.006", "10.1109/tvcg.2011.249", "10.1109/tvcg.2012.209", "10.1109/ldav.2016.7874312", "10.1080/14786445908642760", "10.1109/sc.2014.88", "10.1109/tvcg.2009.69", "10.1109/tvcg.2014.2346434", "10.1111/j.1365-2966.2011.18394.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934620", "title": "High-throughput feature extraction for measuring attributes of deforming open-cell foams", "year": "2019", "conferenceName": "SciVis", "authors": "Steve Petruzza;Attila Gyulassy;Samuel Leventhal;John J. Baglino;Michael Czabaj;Ashley D. Spear;Valerio Pascucci", "citationCount": "1", "affiliation": "Petruzza, S (Corresponding Author), Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Petruzza, Steve; Gyulassy, Attila; Leventhal, Samuel; Pascucci, Valerio, Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Baglino, John J.; Czabaj, Michael; Spear, Ashley D., Univ Utah, Dept Mech Engn, Salt Lake City, UT 84112 USA.", "countries": "USA", "abstract": "Metallic open-cell foams are promising structural materials with applications in multifunctional systems such as biomedical implants, energy absorbers in impact, noise mitigation, and batteries. There is a high demand for means to understand and correlate the design space of material performance metrics to the material structure in terms of attributes such as density, ligament and node properties, void sizes, and alignments. Currently, X-ray Computed Tomography (CT) scans of these materials are segmented either manually or with skeletonization approaches that may not accurately model the variety of shapes present in nodes and ligaments, especially irregularities that arise from manufacturing, image artifacts, or deterioration due to compression. In this paper, we present a new workflow for analysis of open-cell foams that combines a new density measurement to identify nodal structures, and topological approaches to identify ligament structures between them. Additionally, we provide automated measurement of foam properties. We demonstrate stable extraction of features and time-tracking in an image sequence of a foam being compressed. Our approach allows researchers to study larger and more complex foams than could previously be segmented only manually, and enables the high-throughput analysis needed to predict future foam performance.", "keywords": "Topological analysis,foam,features extraction,feature tracking", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934620", "refList": ["10.1179/175355510x12744412709403", "10.1002/jcc.25181", "10.1111/j.1365-2818.1981.tb01197.x", "10.3758/s13414-017-1457-8", "10.2312/sgp/sgp06/143-152", "10.1002/(sici)1527-2648(200004)2:4", "10.1016/j.solener.2010.04.022", "10.1016/s0079-6425(00)00002-5", "10.1016/0031-3203(84)90057-8", "10.1109/smi.2003.1199609", "10.1016/j.ijheatmasstransfer.2015.01.052", "10.1109/tvcg.2006.57", "10.1016/s1005-0302(12)60016-4", "10.1016/s0031-3203(98)00082-x", "10.1142/s0218654308001154", "10.1145/997817.997872", "10.1109/2945.795212", "10.1016/s0266-3538(03)00276-8", "10.1016/j.mspro.2014.07.604", "10.1111/j.1365-2818.1992.tb04302.x", "10.1109/2945.942688", "10.1109/tvcg.2007.70603", "10.1557/mrs2003.83", "10.1016/j.matdes.2013.10.027", "10.1109/tvcg.2015.2467432", "10.1109/pccga.2000.883951", "10.1016/0167-8655(95)00034-e", "10.1016/j.cej.2015.09.014", "10.1109/visual.1998.745288", "10.1109/ldav.2015.7348066", "10.1117/12.198601", "10.1109/tvcg.2009.69", "10.1007/pl00013399", "10.1109/2945.597796", "10.1016/j.jmatprotec.2013.12.004", "10.1109/34.329007", "10.1016/s0079-6425(98)00004-8", "10.1103/physrevd.71.077102", "10.1038/nmeth.2089", "10.1016/s0167-8655(02)00102-2", "10.1111/j.1365-2966.2011.18394.x", "10.1109/tvcg.2012.200", "10.1002/1527-2648(20021014)4:10", "10.1016/j.patcog.2016.01.022", "10.1109/tvcg.2018.2864848", "10.1007/s00371-005-0308-0", "10.1016/j.msea.2017.08.102", "10.1016/0165-1684(94)90061-2"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2018.2865152", "title": "DXR: A Toolkit for Building Immersive Data Visualizations", "year": "2018", "conferenceName": "InfoVis", "authors": "Ronell Sicat;Jiabao Li;Junyoung Choi;Maxime Cordeil;Won-Ki Jeong;Benjamin Bach;Hanspeter Pfister", "citationCount": "12", "affiliation": "Sicat, R (Corresponding Author), Harvard Visual Comp Grp, Cambridge, MA USA. Sicat, Ronell; Pfister, Hanspeter, Harvard Visual Comp Grp, Cambridge, MA USA. Li, Jiabao, Harvard Grad Sch Design, Cambridge, MA USA. Bach, Benjamin, Univ Edinburgh, Sch Informat, Edinburgh, Midlothian, Scotland. Cordeil, Maxime, Monash Univ, Immers Analyt Lab, Clayton, Vic, Australia. Choi, JunYoung; Jeong, Won-Ki, Ulsan Natl Inst Sci \\& Technol, Ulsan, South Korea.", "countries": "Scotland;USA;Korea;Australia", "abstract": "This paper presents DXR, a toolkit for building immersive data visualizations based on the Unity development platform. Over the past years, immersive data visualizations in augmented and virtual reality (AR, VR) have been emerging as a promising medium for data sense-making beyond the desktop. However, creating immersive visualizations remains challenging, and often require complex low-level programming and tedious manual encoding of data attributes to geometric and visual properties. These can hinder the iterative idea-to-prototype process, especially for developers without experience in 3D graphics, AR, and VR programming. With DXR, developers can efficiently specify visualization designs using a concise declarative visualization grammar inspired by Vega-Lite. DXR further provides a GUI for easy and quick edits and previews of visualization designs in-situ, i.e., while immersed in the virtual world. DXR also provides reusable templates and customizable graphical marks, enabling unique and engaging visualizations. We demonstrate the flexibility of DXR through several examples spanning a wide range of applications.", "keywords": "Augmented Reality,Virtual Reality,Immersive Visualization,Immersive Analytics,Visualization Toolkit", "link": "http://dx.doi.org/10.1109/TVCG.2018.2865152", "refList": ["10.1145/2642918.2647369", "10.1109/tvcg.2015.2467449", "10.1109/tvcg.2011.185", "10.1145/2598153.2598175", "10.1109/tvcg.2016.2598609", "10.1145/1980462.1980470", "10.1109/tvcg.2014.2346318", "10.1145/3009939.3009947", "10.2312/conf/eg2013/stars/039-063", "10.1145/3013971.3014006", "10.1109/tvcg.2016.2598608", "10.1109/tvcg.2016.2599107", "10.1145/3173574.3173664", "10.1109/tvcg.2017.2745941", "10.1145/2556288.2557010", "10.1145/3126594.3126613", "10.1016/j.visinf.2017.11.002", "10.1111/cgf.12391", "10.1109/tvcg.2015.2467091", "10.1109/bigdata.2014.7004282", "10.1109/bdva.2015.7314302", "10.1109/tvcg.2010.144", "10.1109/tvcg.2009.174", "10.1109/infvis.2004.64", "10.1145/2133416.2146416", "10.1109/tvcg.2014.2346322", "10.1109/tvcg.2017.2744079", "10.1111/cgf.12804", "10.1371/journal.pone.0057990", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13439", "year": "2018", "title": "Rendering and Extracting Extremal Features in 3D Fields", "conferenceName": "EuroVis", "authors": "Gordon L. Kindlmann;Charisee Chiw;T. Huynh;Attila Gyulassy;John H. Reppy;Peer{-}Timo Bremer", "citationCount": "4", "affiliation": "Kindlmann, G (Corresponding Author), Univ Chicago, Dept Comp Sci, Chicago, IL 60637 USA.\nKindlmann, G.; Chiw, C.; Huynh, T.; Reppy, J., Univ Chicago, Dept Comp Sci, Chicago, IL 60637 USA.\nGyulassy, A.; Bremer, P. -T., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA.", "countries": "USA", "abstract": "Visualizing and extracting three-dimensional features is important for many computational science applications, each with their own feature definitions and data types. While some are simple to state and implement (e.g. isosurfaces), others require more complicated mathematics (e.g. multiple derivatives, curvature, eigenvectors, etc.). Correctly implementing mathematical definitions is difficult, so experimenting with new features requires substantial investments. Furthermore, traditional interpolants rarely support the necessary derivatives, and approximations can reduce numerical stability. Our new approach directly translates mathematical notation into practical visualization and feature extraction, with minimal mental and implementation overhead. Using a mathematically expressive domain-specific language, Diderot, we compute direct volume renderings and particle-based feature samplings for a range of mathematical features. Non-expert users can experiment with feature definitions without any exposure to meshes, interpolants, derivative computation, etc. We demonstrate high-quality results on notoriously difficult features, such as ridges and vortex cores, using working code simple enough to be presented in its entirety.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13439", "refList": ["10.1016/j.procs.2010.04.192", "10.1145/1015706.1015713", "10.1109/visual.1997.663930", "10.1109/tvcg.2009.204", "10.1109/tvcg.2015.2467449", "10.1063/1.857730", "10.1109/icpr.1994.576356", "10.1109/tvcg.2006.149", "10.1145/2345156.2254079", "10.1016/0734-189x(83)90094-4", "10.2140/pjm.1966.16.1", "10.1242/dev.087148", "10.1109/visual.1999.809896", "10.1109/tvcg.2007.70554", "10.1016/s0022-5096(00)00023-5", "10.1109/tvcg.2009.177", "10.1109/pacificvis.2012.6183587", "10.1002/dvdy.22283", "10.1006/cviu.1995.1014", "10.1109/tvcg.2012.218", "10.1109/tvcg.2011.98", "10.1109/tvcg.2009.44", "10.1109/visual.1998.745290", "10.2140/camcos.2016.11.37", "10.1109/tvcg.2009.11", "10.1109/visual.1996.568137", "10.1109/smi.2005.41", "10.1017/s0022112004002526", "10.1109/visual.2003.1250414", "10.1007/s00427-001-0196-x", "10.1109/tvcg.2008.148", "10.1016/j.media.2007.07.005", "10.1145/37402.37422", "10.1002/nbm.1940080707", "10.1111/j.1467-8659.2011.01945.x", "10.1109/38.511", "10.1016/s0091-679x(06)81006-x", "10.1109/34.632985", "10.1017/jfm.2012.257", "10.1017/s0022112095000462", "10.1109/tvcg.2007.1053", "10.1109/visual.2004.105"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864828", "title": "Objective Vortex Corelines of Finite-sized Objects in Fluid Flows", "year": "2018", "conferenceName": "SciVis", "authors": "Tobias Günther;Holger Theisel", "citationCount": "1", "affiliation": "Gunther, T (Corresponding Author), Swiss Fed Inst Technol, Comp Graph Lab, Zurich, Switzerland. Guenther, Tobias, Swiss Fed Inst Technol, Comp Graph Lab, Zurich, Switzerland. Theisel, Holger, Univ Magdeburg, Visual Comp Grp, Magdeburg, Germany.", "countries": "Switzerland;Germany", "abstract": "Vortices are one of the most-frequently studied phenomena in fluid flows. The center of the rotating motion is called the vortex coreline and its successful detection strongly depends on the choice of the reference frame. The optimal frame moves with the center of the vortex, which incidentally makes the observed fluid flow steady and thus standard vortex coreline extractors such as Sujudi-Haimes become applicable. Recently, an objective optimization framework was proposed that determines a near-steady reference frame for tracer particles. In this paper, we extend this technique to the detection of vortex corelines of inertial particles. An inertial particle is a finite-sized object that is carried by a fluid flow. In contrast to the usual tracer particles, they do not move tangentially with the flow, since they are subject to gravity and exhibit mass-dependent inertia. Their particle state is determined by their position and own velocity, which makes the search for the optimal frame a high-dimensional problem. We demonstrate in this paper that the objective detection of an inertial vortex coreline can be reduced in 2D to a critical point search in 2D. For 3D flows, however, the vortex coreline criterion remains a parallel vectors condition in 6D. To detect the vortex corelines we propose a recursive subdivision approach that is tailored to the underlying structure of the 6D vectors. The resulting algorithm is objective, and we demonstrate the vortex coreline extraction in a number of 2D and 3D vector fields.", "keywords": "Vortex extraction,inertial particles,objectivity,vortex coreline", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864828", "refList": ["10.1016/0377-0257(79)87004-4", "10.1111/cgf.12358", "10.1016/0167-2789(91)90088-q", "10.1109/2.35197", "10.1109/tvcg.2016.2599016", "10.5194/npg-22-571-2015", "10.1109/tvcg.2007.70633", "10.1007/978-3-540-70823-0\\_9", "10.1016/b978-012387582-2/50040-x", "10.1111/cgf.12846", "10.1007/s11538-010-9594-4", "10.1017/s002211209900467x", "10.1143/jpsj.66.1331", "10.1063/1.857730", "10.1017/s0022112092001460", "10.1016/s0097-8493(02)00056-0", "10.1017/jfm.2016.151", "10.1175/2009jas2865.1", "10.1111/j.1467-8659.2008.01238.x", "10.1016/j.nonrwa.2014.08.002", "10.1109/visual.1997.663910", "10.1109/visual.1999.809896", "10.1146/annurev.fluid.23.1.601", "10.1109/tvcg.2015.2467200", "10.1145/1057432.1057452", "10.1109/tvcg.2014.2346415", "10.1111/cgf.13114", "10.1007/s100219900068", "10.2514/2.744", "10.1111/cgf.12659", "10.1145/3072959.3073684", "10.1023/a:1001816013475", "10.1007/s10569-015-9617-4", "10.1016/0960-0779(94)90137-6", "10.1016/0010-4655(88)90020-3", "10.1109/visual.1991.175773", "10.1063/1.864230", "10.1088/1742-6596/333/1/012003", "10.1111/cgf.12108", "10.1017/s0022112004002526", "10.1017/s0022112008005089", "10.1007/978-94-007-2482-2\\_30", "10.1016/j.ijengsci.2007.10.005", "10.1111/cgf.12913", "10.1109/tvcg.2009.11", "10.1111/cgf.13439", "10.1016/j.crme.2015.08.002", "10.1109/tvcg.2007.70545", "10.1145/2897824.2925919", "10.1109/visual.1998.745296", "10.1109/tvcg.2016.2599018", "10.1016/j.physd.2007.09.027", "10.1088/0031-8949/2010/t142/014001", "10.1016/0011-7471(70)90059-8", "10.1017/s0022112095000462", "10.1109/tvcg.2007.1053"], "wos": 1, "children": [{"doi": "10.1111/cgf.13689", "year": "2019", "title": "Robust Reference Frame Extraction from Unsteady 2D Vector Fields with Convolutional Neural Networks", "conferenceName": "EuroVis", "authors": "Byungsoo Kim;Tobias G{\\\"{u}}nther", "citationCount": "3", "affiliation": "Kim, B (Corresponding Author), Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.\nKim, Byungsoo; Guenther, Tobias, Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "Robust feature extraction is an integral part of scientific visualization. In unsteady vector field analysis, researchers recently directed their attention towards the computation of near-steady reference frames for vortex extraction, which is a numerically challenging endeavor. In this paper, we utilize a convolutional neural network to combine two steps of the visualization pipeline in an end-to-end manner: the filtering and the feature extraction. We use neural networks for the extraction of a steady reference frame for a given unsteady 2D vector field. By conditioning the neural network to noisy inputs and resampling artifacts, we obtain numerically stabler results than existing optimization-based approaches. Supervised deep learning typically requires a large amount of training data. Thus, our second contribution is the creation of a vector field benchmark data set, which is generally useful for any local deep learning-based feature extraction. Based on Vatistas velocity profile, we formulate a parametric vector field mixture model that we parameterize based on numerically-computed example vector fields in near-steady reference frames. Given the parametric model, we can efficiently synthesize thousands of vector fields that serve as input to our deep learning architecture. The proposed network is evaluated on an unseen numerical fluid flow simulation.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13689", "refList": ["10.1016/0377-0257(79)87004-4", "10.1111/cgf.12358", "10.1109/tvcg.2018.2864828", "10.1016/0167-2789(91)90088-q", "10.1007/978-3-540-70823-0\\_9", "10.1016/b978-012387582-2/50040-x", "10.1111/cgf.13405", "10.1111/cgf.13319", "10.1109/tvcg.2018.2843369", "10.1007/bf00538235", "10.23940/ijpe.18.03", "10.1017/jfm.2016.151", "10.1109/visual.1999.809896", "10.1146/annurev.fluid.23.1.601", "10.1109/tvcg.2007.1036", "10.1109/tvcg.2018.2864839", "10.1007/978-3-319-54024-5\\_6", "10.1109/tvcg.2013.189", "10.1145/3072959.3073684", "10.1109/tvcg.2015.2467203", "10.2514/2.957", "10.1016/0960-0779(94)90137-6", "10.1109/visual.1991.175773", "10.1109/visual.1996.568137", "10.1017/s0022112004002526", "10.1109/pacificvis.2016.7465253", "10.1007/bf00849110", "10.1007/bf00198434", "10.1109/tvcg.2007.70545", "10.3390/informatics4030027", "10.1137/140983665", "10.1016/0011-7471(70)90059-8", "10.1017/s0022112095000462", "10.1145/1183287.1183290"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3028947", "title": "A Fluid Flow Data Set for Machine Learning and its Application to Neural Flow Map Interpolation", "year": "2020", "conferenceName": "SciVis", "authors": "Jakob Jakob;Markus H. Gross;Tobias Günther", "citationCount": "0", "affiliation": "Jakob, J (Corresponding Author), Swiss Fed Inst Technol, Zurich, Switzerland. Jakob, Jakob; Gross, Markus; Guenther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "In recent years, deep learning has opened countless research opportunities across many different disciplines. At present, visualization is mainly applied to explore and explain neural networks. Its counterpart-the application of deep learning to visualization problems-requires us to share data more openly in order to enable more scientists to engage in data-driven research. In this paper, we construct a large fluid flow data set and apply it to a deep learning problem in scientific visualization. Parameterized by the Reynolds number, the data set contains a wide spectrum of laminar and turbulent fluid flow regimes. The full data set was simulated on a high-performance compute cluster and contains 8000 time-dependent 2D vector fields, accumulating to more than 16 TB in size. Using our public fluid data set, we trained deep convolutional neural networks in order to set a benchmark for an improved post-hoc Lagrangian fluid flow analysis. In in-situ settings, flow maps are exported and interpolated in order to assess the transport characteristics of time-dependent fluids. Using deep learning, we improve the accuracy of flow map interpolations, allowing a more precise flow analysis at a reduced memory IO footprint.", "keywords": "Scientific visualization,deep learning,flow maps", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028947", "refList": ["10.1007/978-3-319-10593-2\\_25", "10.1145/3355089.3356560", "10.1109/access.2019.2903582", "10.1111/cgf.13405", "10.1109/tmm.2019.2919431", "10.1017/jfm.2016.151", "10.1016/j.physd.2005.10.007", "10.1007/978-3-030-00533-7\\_36", "10.3390/rs11161921", "10.1007/978-3-030-48457-6\\_1", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/tvcg.2007.70554", "10.1109/mcg.2018.2881523", "10.1109/cvpr.2016.207", "10.1145/1073204.1073264", "10.1145/3072959.3073643", "10.1109/tpami.2015.2439281", "10.2312/pgv", "10.4208/cicp.oa-2018-0035", "10.1109/cvpr.2017.693", "10.1109/tvcg.2013.128", "10.1109/igarss.2018.8519261", "10.1063/1.3270044", "10.2312/pgv.20191115", "10.1145/3197517.3201304", "10.1145/3065386", "10.1145/1360612.1360649", "10.1109/mcse.2015.103", "10.1145/3355089.3356575", "10.1109/mcg.2018.2881502", "10.1029/2019jd032121", "10.3390/informatics4030027", "10.1109/access.2019.2931781", "10.1007/s12650-018-0523-1", "10.1109/tvcg.2019.2934332", "10.1146/annurev.fluid.32.1.165", "10.1007/978-3-319-46475-6\\_43", "10.1126/science.1127647", "10.1007/978-3-319-46475-6\\_25", "10.1111/cgf.13689"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.8737", "year": "2020", "title": "SSR-VFD: Spatial Super-Resolution for Vector Field Data Analysis and Visualization", "conferenceName": "PacificVis", "authors": "Li Guo;Shaojie Ye;Jun Han;Hao Zheng;Han Gao;Danny Z. Chen;Jian{-}Xun Wang;Chaoli Wang", "citationCount": "1", "affiliation": "Guo, L (Corresponding Author), Nankai Univ, Tianjin, Peoples R China.\nGuo, Li, Nankai Univ, Tianjin, Peoples R China.\nYe, Shaojie, Zhejiang Univ, Hangzhou, Zhejiang, Peoples R China.\nHan, Jun; Zheng, Hao; Gao, Han; Chen, Danny Z.; Wang, Jian-Xun; Wang, Chaoli, Univ Notre Dame, Notre Dame, IN 46556 USA.", "countries": "USA;China", "abstract": "We present SSR-VFD, a novel deep learning framework that produces coherent spatial super-resolution (SSR) of three-dimensional vector field data (VFD). SSR-VFD is the first work that advocates a machine learning approach to generate high-resolution vector fields from low-resolution ones. The core of SSR-VFD lies in the use of three separate neural nets that take the three components of a low-resolution vector field as input and jointly output a synthesized high-resolution vector field. To capture spatial coherence, we take into account magnitude and angle losses in network optimization. Our method can work in the in situ scenario where VFD are down-sampled at simulation time for storage saving and these reduced VFD are upsampled back to their original resolution during postprocessing. To demonstrate the effectiveness of SSR-VFD, we show quantitative and qualitative results with several vector field data sets of different characteristics and compare our method against volume upscaling using bicubic interpolation, and two solutions based on CNN and GAN, respectively.", "keywords": "Spatial super-resolution; vector field data; convolutional neural network; deep learning", "link": "https://doi.org/10.1109/PacificVis48177.2020.8737", "refList": ["10.1016/j.ijvsm.2017.05.001", "10.1016/j.jvs.2005.01.020", "10.1109/iccv.2015.123", "10.1111/cgf.13620", "10.1109/cvpr.2019.00831", "10.1109/cvpr.2019.00817", "10.1109/cvpr.2019.00399", "10.1109/tvcg.2019.2934312", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/tvcg.2018.2816059", "10.1109/mcg.2018.2881523", "10.1109/tpami.2015.2439281", "10.1109/bigdata.2018.8622520", "10.1145/3197517.3201304", "10.1109/tvcg.2018.2796085", "10.1109/tvcg.2019.2934255", "10.1109/cvpr.2016.90", "10.1109/pacificvis.2019.00041", "10.1111/cgf.13689"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030374", "title": "VC-Net: Deep Volume-Composition Networks for Segmentation and Visualization of Highly Sparse and Noisy Image Data", "year": "2020", "conferenceName": "SciVis", "authors": "Yifan Wang;Guoli Yan;Haikuan Zhu;Sagar Buch;Ying Wang;E. Mark Haacke;Jing Hua;Zichun Zhong", "citationCount": "0", "affiliation": "Wang, YF (Corresponding Author), Wayne State Univ, Dept Comp Sci, Detroit, MI 48202 USA. Wang, Yifan; Yan, Guoli; Zhu, Haikuan; Hua, Jing; Zhong, Zichun, Wayne State Univ, Dept Comp Sci, Detroit, MI 48202 USA. Buch, Sagar; Wang, Ying; Haacke, Ewart Mark, Wayne State Univ, Dept Radiol, Detroit, MI 48201 USA.", "countries": "USA", "abstract": "The fundamental motivation of the proposed work is to present a new visualization-guided computing paradigm to combine direct 3D volume processing and volume rendered clues for effective 3D exploration. For example, extracting and visualizing microstructures in-vivo have been a long-standing challenging problem. However, due to the high sparseness and noisiness in cerebrovasculature data as well as highly complex geometry and topology variations of micro vessels, it is still extremely challenging to extract the complete 3D vessel structure and visualize it in 3D with high fidelity. In this paper, we present an end-to-end deep learning method, VC-Net, for robust extraction of 3D microvascular structure through embedding the image composition, generated by maximum intensity projection (MIP), into the 3D volumetric image learning process to enhance the overall performance. The core novelty is to automatically leverage the volume visualization technique (e.g., MIP - a volume rendering scheme for 3D volume images) to enhance the 3D data exploration at the deep learning level. The MIP embedding features can enhance the local vessel signal (through canceling out the noise) and adapt to the geometric variability and scalability of vessels, which is of great importance in microvascular tracking. A multi-stream convolutional neural network (CNN) framework is proposed to effectively learn the 3D volume and 2D MIP feature vectors, respectively, and then explore their inter-dependencies in a joint volume-composition embedding space by unprojecting the 2D feature vectors into the 3D volume embedding space. It is noted that the proposed framework can better capture the small/micro vessels and improve the vessel connectivity. To our knowledge, this is the first time that a deep learning framework is proposed to construct a joint convolutional embedding space, where the computed vessel probabilities from volume rendering based 2D projection and 3D volume can be explored and integrated synergistically. Experimental results are evaluated and compared with the traditional 3D vessel segmentation methods and the state-of-the-art in deep learning, by using extensive public and real patient (micro- )cerebrovascular image datasets. The application of this accurate segmentation and visualization of sparse and complicated 3D microvascular structure facilitated by our method demonstrates the potential in a powerful MR arteriogram and venogram diagnosis of vascular disease.", "keywords": "Deep neural network,3D cerebrovascular segmentation and visualization,maximum intensity projection (MIP),joint embedding", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030374", "refList": ["10.1109/cluster.2018.00036", "10.1109/iccv.2015.123", "10.1109/tvcg.2013.133", "10.1109/cvpr.2017.19", "10.1109/tvcg.2019.2934312", "10.1007/978-3-319-46487-9\\_40", "10.1109/tvcg.2006.175", "10.1109/tvcg.2007.70523", "10.1109/tvcg.2018.2880207", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/iccv.2017.244", "10.1109/cvpr.2017.632", "10.1109/tvcg.2018.2816059", "10.1109/pacificvis.2009.4906852", "10.1109/tvcg.2018.2864808", "10.1109/mcg.2018.2881523", "10.1109/tvcg.2015.2467431", "10.1109/tpami.2015.2439281", "10.1109/pacificvis48177.2020.8737", "10.1109/cvpr.2019.00244", "10.1109/tvcg.2006.165", "10.1109/bigdata.2018.8622520", "10.1007/978-3-319-46466-4\\_29", "10.1109/visual.2019.8933759", "10.1145/3197517.3201304", "10.1109/pacificvis.2011.5742378", "10.1109/cvpr.2006.91", "10.1109/pacificvis.2011.5742369", "10.1109/tvcg.2019.2934255", "10.1109/cvpr.2016.90", "10.1007/978-3-319-24574-4\\_28", "10.1109/pacificvis.2019.00041", "10.1109/tvcg.2019.2934332", "10.1109/cvpr.2018.00916", "10.1007/978-3-319-46475-6\\_43"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}], "len": 9}, {"doi": "10.1109/tvcg.2019.2934310", "title": "Extraction and Visual Analysis of Potential Vorticity Banners around the Alps", "year": "2019", "conferenceName": "SciVis", "authors": "Robin Bader;Michael Sprenger;Nikolina Ban;Stefan Rüdisühli;Christoph Schär;Tobias Günther", "citationCount": "0", "affiliation": "Bader, R (Corresponding Author), Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland. Bader, Robin; Guenther, Tobias, Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland. Sprenger, Michael; Ban, Nikolina; Ruedisuehli, Stefan; Schaer, Christoph, Swiss Fed Inst Technol, Inst Atmospher \\& Climate Sci, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "Potential vorticity is among the most important scalar quantities in atmospheric dynamics. For instance, potential vorticity plays a key role in particularly strong wind peaks in extratropical cyclones and it is able to explain the occurrence of frontal rain bands. Potential vorticity combines the key quantities of atmospheric dynamics, namely rotation and stratification. Under suitable wind conditions elongated banners of potential vorticity appear in the lee of mountains. Their role in atmospheric dynamics has recently raised considerable interest in the meteorological community for instance due to their influence in aviation wind hazards and maritime transport. In order to support meteorologists and climatologists in the analysis of these structures, we developed an extraction algorithm and a visual exploration framework consisting of multiple linked views. For the extraction we apply a predictor-corrector algorithm that follows streamlines and realigns them with extremal lines of potential vorticity. Using the agglomerative hierarchical clustering algorithm, we group banners from different sources based on their proximity. To visually analyze the time-dependent banner geometry, we provide interactive overviews and enable the query for detail on demand, including the analysis of different time steps, potentially correlated scalar quantities, and the wind vector field. In particular, we study the relationship between relative humidity and the banners for their potential in indicating the development of precipitation. Working with our method, the collaborating meteorologists gained a deeper understanding of the three-dimensional processes, which may spur follow-up research in the future.", "keywords": "Scientific Visualization,potential vorticity,meteorology,feature extraction", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934310", "refList": ["10.1002/qj.49710042520", "10.1111/j.1467-8659.2009.01702.x", "10.1111/cgf.13319", "10.1175/1520-0469(1998)055", "10.1007/bf01475602", "10.1143/jpsj.66.1331", "10.1109/tvcg.2013.2297914", "10.1007/978-3-540-88606-8\\_6", "10.1175/1520-0477(2001)082", "10.1175/mwr-d-16-0042.1", "10.1007/s00703-001-0592-9", "10.1002/qj.49710544615", "10.1111/cgf.13163", "10.1007/bf01446807", "10.1109/visual.1994.346327", "10.1109/visual.1999.809896", "10.1109/tvcg.2011.78", "10.1109/tvcg.2015.2467200", "10.2514/2.744", "10.1145/1013208.1013209", "10.1007/978-3", "10.1111/cgf.12933", "10.1175/1520-0477(2002)083", "10.1007/978-94-015-8765-5", "10.1175/2011mwr3504.1", "10.1007/s007030170008", "10.5194/gmd-9-3393-2016", "10.1175/bams-d-15-00299.1", "10.1002/2014gl062588", "10.1256/smsqj.47001", "10.1175/2010mwr3334.1", "10.1109/tvcg.2017.2779501", "10.1256/qj.02.47", "10.1111/cgf.13439", "10.5194/gmd-2017-230", "10.1109/visual.2003.1250376", "10.14529/jsfi140103", "10.1109/tvcg.2017.2743989", "10.1109/tvcg.2007.70545", "10.1111/j.1467-8659.2003.00723.x", "10.1109/tvcg.2007.1053", "10.1002/qj.828", "10.1002/2016jd026013", "10.1007/bf01450097"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13984", "year": "2020", "title": "Visual Analysis of the Finite-Time Lyapunov Exponent", "conferenceName": "EuroVis", "authors": "Antoni Sagrist{\\`{a}};Stefan Jordan;Filip Sadlo", "citationCount": "0", "affiliation": "Sagrista, A (Corresponding Author), Heidelberg Univ, Heidelberg, Germany.\nSagrista, Antoni; Jordan, Stefan; Sadlo, Filip, Heidelberg Univ, Heidelberg, Germany.", "countries": "Germany", "abstract": "In this paper, we present an integrated visual analytics approach to support the parametrization and exploration of flow visualization based on the finite-time Lyapunov exponent. Such visualization of time-dependent flow faces various challenges, including the choice of appropriate advection times, temporal regions of interest, and spatial resolution. Our approach eases these challenges by providing the user with context by means of parametric aggregations, with support and guidance for a more directed exploration, and with a set of derived measures for better qualitative assessment. We demonstrate the utility of our approach with examples from computation fluid dynamics and time-dependent dynamical systems.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13984", "refList": ["10.1145/37402.37422", "10.1109/38.79452", "10.1016/j.parco.2011.09.001", "10.1016/j.physd.2005.10.007", "10.1109/2.35197", "10.1109/tvcg.2007.70551", "10.1016/s0167-2789(00)00199-8", "10.1109/tvcg.2016.2599018", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2015.2467449", "10.2307/2003354", "10.1109/tvcg.2007.70554", "10.1090/s0002-9904-1967-11798-1", "10.1109/visual.2005.1532788", "10.1017/s0022112004009929", "10.1111/j.1467-8659.2011.01901.x", "10.1111/cgf.13439", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}], "len": 15}, {"doi": "10.1111/cgf.13984", "year": "2020", "title": "Visual Analysis of the Finite-Time Lyapunov Exponent", "conferenceName": "EuroVis", "authors": "Antoni Sagrist{\\`{a}};Stefan Jordan;Filip Sadlo", "citationCount": "0", "affiliation": "Sagrista, A (Corresponding Author), Heidelberg Univ, Heidelberg, Germany.\nSagrista, Antoni; Jordan, Stefan; Sadlo, Filip, Heidelberg Univ, Heidelberg, Germany.", "countries": "Germany", "abstract": "In this paper, we present an integrated visual analytics approach to support the parametrization and exploration of flow visualization based on the finite-time Lyapunov exponent. Such visualization of time-dependent flow faces various challenges, including the choice of appropriate advection times, temporal regions of interest, and spatial resolution. Our approach eases these challenges by providing the user with context by means of parametric aggregations, with support and guidance for a more directed exploration, and with a set of derived measures for better qualitative assessment. We demonstrate the utility of our approach with examples from computation fluid dynamics and time-dependent dynamical systems.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13984", "refList": ["10.1145/37402.37422", "10.1109/38.79452", "10.1016/j.parco.2011.09.001", "10.1016/j.physd.2005.10.007", "10.1109/2.35197", "10.1109/tvcg.2007.70551", "10.1016/s0167-2789(00)00199-8", "10.1109/tvcg.2016.2599018", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2015.2467449", "10.2307/2003354", "10.1109/tvcg.2007.70554", "10.1090/s0002-9904-1967-11798-1", "10.1109/visual.2005.1532788", "10.1017/s0022112004009929", "10.1111/j.1467-8659.2011.01901.x", "10.1111/cgf.13439", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}], "len": 27}, {"doi": "10.1109/tvcg.2017.2743938", "title": "The Topology ToolKit", "year": "2017", "conferenceName": "SciVis", "authors": "Julien Tierny;Guillaume Favelier;Joshua A. Levine;Charles Gueunet;Michael Michaux", "citationCount": "12", "affiliation": "Tierny, J (Corresponding Author), Univ Paris 06, Sorbonne Univ, UPMC, CNRS,LIP6,UMR 7606, Paris, France. Tierny, Julien; Favelier, Guillaume; Gueunet, Charles; Michaux, Michael, Univ Paris 06, Sorbonne Univ, UPMC, CNRS,LIP6,UMR 7606, Paris, France. Levine, Joshua A., Univ Arizona, Tucson, AZ 85721 USA. Gueunet, Charles, Kitware SAS, Villeurbanne, France.", "countries": "USA;France", "abstract": "This system paper presents the Topology ToolKit (TTK), a software platform designed for the topological analysis of scalar data in scientific visualization. While topological data analysis has gained in popularity over the last two decades, it has not yet been widely adopted as a standard data analysis tool for end users or developers. TTK aims at addressing this problem by providing a unified, generic, efficient, and robust implementation of key algorithms for the topological analysis of scalar data, including: critical points, integral lines, persistence diagrams, persistence curves, merge trees, contour trees, Morse-Smale complexes, fiber surfaces, continuous scatterplots, Jacobi sets, Reeb spaces, and more. TTK is easily accessible to end users due to a tight integration with ParaView. It is also easily accessible to developers through a variety of bindings (Python, VTK/C++) for fast prototyping or through direct, dependency-free, C++, to ease integration into pre-existing complex systems. While developing TTK, we faced several algorithmic and software engineering challenges, which we document in this paper. In particular, we present an algorithm for the construction of a discrete gradient that complies to the critical points extracted in the piecewise-linear setting. This algorithm guarantees a combinatorial consistency across the topological abstractions supported by TTK, and importantly, a unified implementation of topological data simplification for multi-scale exploration and analysis. We also present a cached triangulation data structure, that supports time efficient and generic traversals, which self-adjusts its memory usage on demand for input simplicial meshes and which implicitly emulates a triangulation for regular grids with no memory overhead. Finally, we describe an original software architecture, which guarantees memory efficient and direct accesses to TTK features, while still allowing for researchers powerful and easy bindings and extensions. TTK is open source (BSD license) and its code. online documentation and video tutorials are available on TTK's website [108].", "keywords": "Topological data analysis,scalar data,data segmentation,feature extraction,bivariate data,uncertain data", "link": "http://dx.doi.org/10.1109/TVCG.2017.2743938", "refList": ["10.1109/tvcg.2013.81", "10.1142/s0218195905001580", "10.2312/spbg/spbg07/091-100", "10.1109/tvcg.2014.2346322", "10.1007/s00453-014-9887-3", "10.1145/1239451.1239509", "10.1016/b978-012387582-2/50038-1", "10.1007/s10915-011-9501-7", "10.1111/cgf.12121", "10.1016/j.parco.2007.09.001"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934338", "title": "The Effect of Data Transformations on Scalar Field Topological Analysis of High-Order FEM Solutions", "year": "2019", "conferenceName": "SciVis", "authors": "Ashok Jallepalli;Joshua A. Levine;Robert Michael Kirby", "citationCount": "0", "affiliation": "Jallepalli, A (Corresponding Author), Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Jallepalli, Ashok; Kirby, Robert M., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Levine, Joshua A., Univ Arizona, Dept Comp Sci, Tucson, AZ 85721 USA.", "countries": "USA", "abstract": "High-order finite element methods (HO-FEM) are gaining popularity in the simulation community due to their success in solving complex flow dynamics. There is an increasing need to analyze the data produced as output by these simulations. Simultaneously, topological analysis tools are emerging as powerful methods for investigating simulation data. However, most of the current approaches to topological analysis have had limited application to HO-FEM simulation data for two reasons. First, the current topological tools are designed for linear data (polynomial degree one), but the polynomial degree of the data output by these simulations is typically higher (routinely up to polynomial degree six). Second, the simulation data and derived quantities of the simulation data have discontinuities at element boundaries, and these discontinuities do not match the input requirements for the topological tools. One solution to both issues is to transform the high-order data to achieve low-order, continuous inputs for topological analysis. Nevertheless, there has been little work evaluating the possible transformation choices and their downstream effect on the topological analysis. We perform an empirical study to evaluate two commonly used data transformation methodologies along with the recently introduced L-SIAC filter for processing high-order simulation data. Our results show diverse behaviors are possible. We offer some guidance about how best to consider a pipeline of topological analysis of HO-FEM simulations with the currently available implementations of topological analysis.", "keywords": "High-Order Finite Element Methods,Filtering Techniques,Scalar Field Visualization,Topological Analysis", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934338", "refList": ["10.1109/tvcg.2008.9", "10.1137/15m1053220", "10.1007/s10915-014-9946-6", "10.1111/cgf.13165", "10.1016/j.combustflame.2008.10.029", "10.1016/j.cagd.2012.03.017", "10.2307/2005782", "10.1137/16m1097845", "10.1007/s10915-013-9748-2", "10.1016/j.cpc.2015.02.008", "10.1016/j.comgeo.2006.05.009", "10.1016/j.compfluid.2013.12.007", "10.1016/s0925-7721(02)00093-7", "10.1007/s10915-011-9535-x", "10.1109/tvcg.2017.2743938", "10.1145/1239451.1239509", "10.1090/s0025-5718-02-01464-3", "10.1007/s10915-008-9230-8", "10.1016/b978-012387582-2/50038-1", "10.1103/physreve.86.016309", "10.1109/tvcg.2009.69", "10.1016/j.cam.2015.08.011", "10.1016/j.jcp.2018.06.037", "10.1109/tvcg.2017.2744058", "10.1109/visual.2004.113", "10.1137/120874059", "10.1007/s00453-003-1052-3", "10.1109/tvcg.2011.109", "10.1137/100782188", "10.1007/978-3-540-88606-8\\_5", "10.1109/pacificvis.2015.7156387", "10.1137/110830678", "10.2514/1.j054181", "10.1007/s10915-017-0517-5", "10.1142/s0218195909002903"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934257", "title": "Toward Localized Topological Data Structures: Querying the Forest for the Tree", "year": "2019", "conferenceName": "SciVis", "authors": "Pavol Klacansky;Attila Gyulassy;Peer-Timo Bremer;Valerio Pascucci", "citationCount": "1", "affiliation": "Klacansky, P (Corresponding Author), Univ Utah, Sci Comp \\& Imaging Inst, Salt Lake City, UT 84112 USA. Klacansky, Pavol; Gyulassy, Attila; Pascucci, Valerio, Univ Utah, Sci Comp \\& Imaging Inst, Salt Lake City, UT 84112 USA. Bremer, Peer-Timo, Lawrence Livermore Natl Lab, Livermore, CA USA.", "countries": "USA", "abstract": "Topological approaches to data analysis can answer complex questions about the number, connectivity, and scale of intrinsic features in scalar data. However, the global nature of many topological structures makes their computation challenging at scale, and thus often limits the size of data that can be processed. One key quality to achieving scalability and performance on modern architectures is data locality, i.e., a process operates on data that resides in a nearby memory system, avoiding frequent jumps in data access patterns. From this perspective, topological computations are particularly challenging because the implied data structures represent features that can span the entire data set, often requiring a global traversal phase that limits their scalability. Traditionally, expensive preprocessing is considered an acceptable trade-off as it accelerates all subsequent queries. Most published use cases, however, explore only a fraction of all possible queries, most often those returning small, local features. In these cases, much of the global information is not utilized, yet computing it dominates the overall response time. We address this challenge for merge trees, one of the most commonly used topological structures. In particular, we propose an alternative representation, the merge forest, a collection of local trees corresponding to regions in a domain decomposition. Local trees are connected by a bridge set that allows us to recover any necessary global information at query time. The resulting system couples (i) a preprocessing that scales linearly in practice with (ii) fast runtime queries that provide the same functionality as traditional queries of a global merge tree. We test the scalability of our approach on a shared-memory parallel computer and demonstrate how data structure locality enables the analysis of large data with an order of magnitude performance improvement over the status quo. Furthermore, a merge forest reduces the memory overhead compared to a global merge tree and enables the processing of data sets that are an order of magnitude larger than possible with previous algorithms.", "keywords": "Merge tree,parallel computation,topology", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934257", "refList": ["10.1109/ldav.2017.8231846", "10.1145/276884.276892", "10.1090/mbk/069", "10.1007/s00454-002-2885-2", "10.1109/tvcg.2015.2452919", "10.1016/0956-0521(91)90014-v", "10.1145/262839.269238", "10.1145/364099.364331", "10.1016/j.comgeo.2006.05.009", "10.1109/ldav.2016.7874333", "10.1080/16864360.2017.1419648", "10.1016/s0925-7721(02)00093-7", "10.1145/2517327.2442526", "10.1109/tvcg.2017.2743938", "10.1016/j.proci.2014.05.147", "10.1109/tvcg.2010.253", "10.1103/physrevlett.113.155005", "10.1007/978-3-319-44684-420", "10.1109/ldav.2016.7874312", "10.1007/b106657\\_2", "10.1109/sc.2014.88", "10.1109/ldav.2015.7348066", "10.1007/978-3-319-04099-86", "10.1109/ldav.2012.6378962", "10.1109/pacificvis.2017.8031584", "10.2140/camcos.2016.11.37", "10.1016/j.combustflame.2014.08.021", "10.1109/tvcg.2006.22", "10.1007/pl00009159", "10.1007/s00453-003-1052-3", "10.1109/tvcg.2007.47", "10.1017/jfm.2015.268", "10.1007/s00454-017-9901-z", "10.1145/62.2160", "10.1145/2996913.2996952", "10.1145/1868237.1868249", "10.1145/77635.77639", "10.1016/j.comgeo.2004.05.002", "10.1088/1742-6596/180/1/012086", "10.1109/pacificvis.2015.7156387", "10.1109/tpds.2019.2898436", "10.1145/1463822.1463869", "10.1109/tvcg.2017.2744238", "10.1109/hipc.2012.6507496", "10.1109/tvcg.2006.162", "10.1017/s0022112004009681", "10.2307/2317380"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030353", "title": "Localized Topological Simplification of Scalar Data", "year": "2020", "conferenceName": "SciVis", "authors": "Jonas Lukasczyk;Christoph Garth;Ross Maciejewski;Julien Tierny", "citationCount": "0", "affiliation": "Lukasczyk, J (Corresponding Author), Arizona State Univ, Tempe, AZ 85287 USA. Lukasczyk, Jonas; Maciejewski, Ross, Arizona State Univ, Tempe, AZ 85287 USA. Garth, Christoph, Tech Univ Kaiserslautern, Kaiserslautern, Germany. Tierny, Julien, Sorbonne Univ, Paris, France. Tierny, Julien, CNRS, Paris, France.", "countries": "Germany;USA;France", "abstract": "This paper describes a localized algorithm for the topological simplification of scalar data, an essential pre-processing step of topological data analysis (TDA). Given a scalar field $f$ and a selection of extrema to preserve, the proposed localized topological simplification (LTS) derives a function g that is close to $f$ and only exhibits the selected set of extrema. Specifically, sub- and superlevel set components associated with undesired extrema are first locally flattened and then correctly embedded into the global scalar field, such that these regions are guaranteed-from a combinatorial perspective-to no longer contain any undesired extrema. In contrast to previous global approaches, LTS only and independently processes regions of the domain that actually need to be simplified, which already results in a noticeable speedup. Moreover, due to the localized nature of the algorithm, LTS can utilize shared-memory parallelism to simplify regions simultaneously with a high parallel efficiency (70%). Hence, LTS significantly improves interactivity for the exploration of simplification parameters and their effect on subsequent topological analysis. For such exploration tasks, LTS brings the overall execution time of a plethora of TDA pipelines from minutes down to seconds, with an average observed speedup over state-of-the-art techniques of up to $\\times 36$. Furthermore, in the special case where preserved extrema are selected based on topological persistence, an adapted version of LTS partially computes the persistence diagram and simultaneously simplifies features below a predefined persistence threshold. The effectiveness of LTS, its parallel efficiency, and its resulting benefits for TDA are demonstrated on several simulated and acquired datasets from different application domains, including physics, chemistry, and biomedical imaging.", "keywords": "Topological data analysis,scalar data,simplification,feature extraction,parallel computing", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030353", "refList": ["10.1016/j.cag.2014.01.006", "10.1002/jcc.25181", "10.1109/tvcg.2007.70601", "10.2307/2412323", "10.1016/j.jsc.2016.03.009", "10.1007/s00454-006-1276-5", "10.1111/cgf.12596", "10.1007/s00454-002-2885-2", "10.1109/tvcg.2015.2452919", "10.1016/j.neucom.2006.11.018", "10.21105/joss.00726", "10.1109/tvcg.2007.70603", "10.1109/tvcg.2014.2346449", "10.1109/tvcg.2010.213", "10.1109/tvcg.2006.186", "10.1080/10618600.2012.657132", "10.1111/j.1467-8659.2009.01706.x", "10.1109/tvcg.2012.120", "10.1109/tvcg.2011.249", "10.1109/ldav.2016.7874305", "10.1109/tvcg.2017.2743980", "10.1109/pacificvis.2010.5429601", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2010.253", "10.1002/qua.26133", "10.1109/tvcg.2011.220", "10.1007/s10107-006-0077-1", "10.1145/1377676.1377719", "10.1111/cgf.12933", "10.1109/tvcg.2016.2598495", "10.1126/science.290.5500.2319", "10.1111/cgf.12361", "10.1016/j.neucom.2004.11.042", "10.1109/vast.2010.5652940", "10.1109/ldav48142.2019.8944365", "10.1016/j.patrec.2017.09.032", "10.1145/77635.77639", "10.1109/tvcg.2015.2489660", "10.1111/cgf.12640", "10.1126/science.290.5500.2323", "10.1111/j.1365-2966.2011.18394.x", "10.1109/tvcg.2014.2346403", "10.1090/s0273-0979-09-01249-x", "10.1111/cgf.12655", "10.1109/tvcg.2018.2846735", "10.1145/2535927", "10.1137/060654797", "10.1145/235815.235821"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13983", "year": "2020", "title": "Fiber Surfaces for many Variables", "conferenceName": "EuroVis", "authors": "Christian Blecha;Felix Raith;A. J. Pr{\\\"{a}}ger;Thomas Nagel;Olaf Kolditz;Jobst Ma{\\ss}mann;Niklas R{\\\"{o}}ber;Michael B{\\\"{o}}ttinger;Gerik Scheuermann", "citationCount": "0", "affiliation": "Blecha, C (Corresponding Author), Univ Leipzig, Inst Comp Sci, Leipzig, Germany.\nBlecha, C.; Raith, F.; Praeger, A. J.; Scheuermann, G., Univ Leipzig, Inst Comp Sci, Leipzig, Germany.\nNagel, T., Tech Univ Bergakad Freiberg, Geotech Inst, Chair Soil Mech \\& Fdn Engn, Freiberg, Germany.\nKolditz, O., Helmholtz Ctr Environm Res, Dept Environm Informat, Leipzig, Germany.\nMassmann, J., Fed Inst Geosci \\& Nat Resources BGR, Hannover, NH, Germany.\nRoeber, N.; Boettinger, M., Deutsch Klimarechenzentrum, Hamburg, Germany.", "countries": "Germany", "abstract": "Scientific visualization deals with increasingly complex data consisting of multiple fields. Typical disciplines generating multivariate data are fluid dynamics, structural mechanics, geology, bioengineering, and climate research. Quite often, scientists are interested in the relation between some of these variables. A popular visualization technique for a single scalar field is the extraction and rendering of isosurfaces. With this technique, the domain can be split into two parts, i.e. a volume with higher values and one with lower values than the selected isovalue. Fiber surfaces generalize this concept to two or three scalar variables up to now. This article extends the notion further to potentially any finite number of scalar fields. We generalize the fiber surface extraction algorithm of Raith et al. {[}RBN{*} 19] from 3 to d dimensions and demonstrate the technique using two examples from geology and climate research. The first application concerns a generic model of a nuclear waste repository and the second one an atmospheric simulation over central Europe. Both require complex simulations which involve multiple physical processes. In both cases, the new extended fiber surfaces helps us finding regions of interest like the nuclear waste repository or the power supply of a storm due to their characteristic properties.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13983", "refList": ["10.1109/tvcg.2007.70615", "10.1007/s12665-012-1546-x", "10.1007/s11242-019-01310-1", "10.2312/conf/eg2013/stars/095-116", "10.1109/tvcg.2016.2599040", "10.1111/j.1467-8659.2011.01959.x", "10.1002/qj.2947", "10.1109/tvcg.2015.2467433", "10.1109/tvcg.2018.2864846", "10.1111/cgf.12636", "10.1109/cmv.2007.20", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2016.2570215", "10.1109/tvcg.2018.2867488", "10.1109/pacificvis.2017.8031588", "10.1111/cgf.12646", "10.1109/tvcg.2016.2599017", "10.1109/pacificvis.2019.00030", "10.1109/tvcg.2006.165", "10.1111/j.1467-8659.2009.01429.x", "10.1109/tvcg.2010.64", "10.1145/1377676.1377720", "10.1016/j.jrmge.2017.05.007", "10.18240/ijo.2016.07.04", "10.1186/s40645-019-0304-z", "10.1016/j.parco.2015.10.016", "10.1109/tvcg.2015.2466992", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.14037", "year": "2020", "title": "State of the Art in Time-Dependent Flow Topology: Interpreting Physical Meaningfulness Through Mathematical Properties", "conferenceName": "EuroVis", "authors": "Roxana Bujack;Lin Yan;Ingrid Hotz;Christoph Garth;Bei Wang", "citationCount": "0", "affiliation": "Bujack, R (Corresponding Author), Los Alamos Natl Lab, Los Alamos, NM 87545 USA.\nBujack, Roxana, Los Alamos Natl Lab, Los Alamos, NM 87545 USA.\nYan, Lin; Wang, Bei, Univ Utah, Sci Comp \\& Imaging Inst, Salt Lake City, UT 84112 USA.\nHotz, Ingrid, Linkopings Univ, Sci Visualizat Grp, Linkoping, Sweden.\nGarth, Christoph, Univ Kaiserslautern, Kaiserslautern, Germany.", "countries": "Sweden;Germany;USA", "abstract": "We present a state-of-the-art report on time-dependent flow topology. We survey representative papers in visualization and provide a taxonomy of existing approaches that generalize flow topology from time-independent to time-dependent settings. The approaches are classified based upon four categories: tracking of steady topology, reference frame adaption, pathline classification or clustering, and generalization of critical points. Our unique contributions include introducing a set of desirable mathematical properties to interpret physical meaningfulness for time-dependent flow visualization, inferring mathematical properties associated with selective research papers, and utilizing such properties for classification. The five most important properties identified in the existing literature include coincidence with the steady case, induction of a partition within the domain, Lagrangian invariance, objectivity, and Galilean invariance.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14037", "refList": ["10.2514/6.1995-1715", "10.1111/cgf.12100", "10.1007/978-3-540-70823-0\\_1", "10.1111/cgf.12885", "10.1063/1.857730", "10.1109/tvcg.2019.2934312", "10.1109/tvcg.2013.92", "10.1063/1.166399", "10.1109/tvcg.2005.68.3", "10.1063/1.4971788", "10.1111/cgf.12933", "10.1145/3072959.3073684", "10.1063/1.4982720", "10.1109/tvcg.2018.2864432", "10.1017/s0022112004002526", "10.1109/tvcg.2010.93", "10.1109/pacificvis.2016.7465253", "10.1109/tvcg.2018.2864505", "10.1063/1.858828", "10.1109/tvcg.2019.2934255", "10.5194/npg-9-237-2002", "10.1063/1.4800210", "10.1007/978-3-540-88606-8\\_12", "10.1111/j.1467-8659.2011.01942.x", "10.1109/2945.928168", "10.1007/978-3-662-10388-31", "10.1016/j.physd.2013.01.013", "10.1111/cgf.12358", "10.1017/s002211209900720x", "10.1017/s0022112097008057", "10.1111/j.1467-8659.2009.01546.x", "10.1109/2.35197", "10.1111/j.1467-8659.2012.03089.x", "10.1111/cgf.13319", "10.1109/tvcg.2019.2934375.3", "10.1016/j.crme.2015.08.002.4", "10.1016/s0167-2789(00)00142-1", "10.1111/cgf.12359", "10.1103/physreve.93.063107", "10.1016/j.physd.2009.05.005", "10.1063/1.1477449", "10.1111/j.1467-8659.2009.01686.x", "10.1109/pacificvis.2011.5742374", "10.1017/jfm.2013.391", "10.1111/cgf.12121", "10.1186/1743-422x-3-15", "10.1063/1.3502450", "10.1063/1.868323", "10.1016/j.cnsns.2013.05.002", "10.1109/visual.2004.99", "10.1109/visual.2004.107", "10.1111/j.1467-8659.2009.01604.x", "10.1146/annurev-fluid-010313-141322", "10.1063/1.3690153", "10.1109/tvcg.2019.2934375", "10.1109/tvcg.2013.143", "10.1137/130940633", "10.1016/j.cag.2014.01.007", "10.1016/s0097-8493(02)00056-0", "10.1109/vl.1996.545307", "10.1109/tvcg.2011.284", "10.1109/tvcg.2011.265", "10.1017/jfm.2016.792", "10.1109/tvcg.2013.208", "10.1007/s12650-016-0348-8", "10.1023/b:elas.0000005548.36767.e7", "10.1007/978-1-4939-0419-8\\_\\_9", "10.1007/bf00849110", "10.1615/int.j.uncertaintyquantification.2012003956", "10.1017/s0022112096001802", "10.1017/s0962492902000065", "10.1109/pacificvis.2019.00041", "10.1111/j.1467-8659.2011.01901.x", "10.1109/tvcg.2008.33", "10.1016/j.physd.2005.10.007", "10.1016/s0894-1777(96)00090-8", "10.1145/2517327.2442526", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2018.2816059", "10.1109/tvcg.2019.2934242", "10.2514/6.1995-1715.4", "10.1111/cgf.12109", "10.1109/tvcg.2011.269", "10.1109/visual.1990.146359", "10.1111/j.1467-8659.2003.00723.x", "10.5194/npg-18-977-2011", "10.1109/visual.1998.745296", "10.1109/tvcg.2007.70557", "10.1109/tvcg.2014.2312012"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13982", "year": "2020", "title": "Extraction of Distinguished Hyperbolic Trajectories for 2D Time-Dependent Vector Field Topology", "conferenceName": "EuroVis", "authors": "Lutz Hofmann;Filip Sadlo", "citationCount": "0", "affiliation": "Hofmann, L (Corresponding Author), Heidelberg Univ, Heidelberg, Germany.\nHofmann, Lutz; Sadlo, Filip, Heidelberg Univ, Heidelberg, Germany.", "countries": "Germany", "abstract": "This paper does two main contributions to 2D time-dependent vector field topology. First, we present a technique for robust, accurate, and efficient extraction of distinguished hyperbolic trajectories (DHT), the generative structures of 2D time-dependent vector field topology. It is based on refinement of initial candidate curves. In contrast to previous approaches, it is robust because the refinement converges for reasonably close initial candidates, it is accurate due to its adaptive scheme, and it is efficient due to its high convergence speed. Second, we provide a detailed evaluation and discussion of previous approaches for the extraction of DHTs and time-dependent vector field topology in general. We demonstrate the utility of our approach using analytical flows, as well as data from computational fluid dynamics.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13982", "refList": ["10.1063/1.3579597", "10.1109/2.35197", "10.1111/j.1467-8659.2012.03063.x", "10.1007/978-3-540-70823-0\\_2", "10.1111/cgf.12885", "10.5194/npg-11-17-2004", "10.1016/j.physd.2005.10.007", "10.1109/visual.1998.745297", "10.1109/tvcg.2018.2868760", "10.1109/tvcg.2007.70551", "10.1109/tvcg.2017.2743938", "10.1109/visual.1999.809896", "10.1109/tvcg.2007.70554", "10.1109/tvcg.2015.2467200", "10.1016/j.physd.2009.05.005", "10.1007/978-3-540-88606-8\\_2", "10.1109/tvcg.2012.131", "10.1007/978-3-540-88606-8\\_1", "10.1145/3072959.3073684", "10.1142/s0218127403007321", "10.1016/s0167-2789(00)00199-8", "10.1063/1.166479", "10.1007/s003329900057", "10.1109/tvcg.2010.198", "10.1109/visual.2004.99", "10.1109/visual.2003.1250376", "10.1109/tvcg.2007.70545", "10.5194/npg-9-237-2002", "10.5194/npg-17-1-2010", "10.1109/tvcg.2007.70557", "10.1109/tvcg.2019.2934375"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13985", "year": "2020", "title": "Fuzzy Contour Trees: Alignment and Joint Layout of Multiple Contour Trees", "conferenceName": "EuroVis", "authors": "Anna Pia Lohfink;Florian Wetzels;Jonas Lukasczyk;Gunther H. Weber;Christoph Garth", "citationCount": "0", "affiliation": "Lohfink, AP (Corresponding Author), Tech Univ Kaiserslautern, Kaiserslautern, Germany.\nLohfink, Anna-Pia; Wetzels, Florian; Garth, Christoph, Tech Univ Kaiserslautern, Kaiserslautern, Germany.\nLukasczyk, Jonas, Arizona State Univ, Tempe, AZ 85287 USA.\nWeber, Gunther H., Lawrence Berkeley Natl Lab, Davis, CA USA.\nWeber, Gunther H., Univ Calif Davis, Davis, CA 95616 USA.", "countries": "Germany;USA", "abstract": "We describe a novel technique for the simultaneous visualization of multiple scalar fields, e.g. representing the members of an ensemble, based on their contour trees. Using tree alignments, a graph-theoretic concept similar to edit distance mappings, we identify commonalities across multiple contour trees and leverage these to obtain a layout that can represent all trees simultaneously in an easy-to-interpret, minimally-cluttered manner. We describe a heuristic algorithm to compute tree alignments for a given similarity metric, and give an algorithm to compute a joint layout of the resulting aligned contour trees. We apply our approach to the visualization of scalar field ensembles, discuss basic visualization and interaction possibilities, and demonstrate results on several analytic and real-world examples.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13985", "refList": ["10.4230/lipics.socg.2017.25", "10.1109/tvcg.2016.2598919", "10.1109/tvcg.2013.269", "10.1109/pacificvis.2016.7465251", "10.1145/322139.322143", "10.1109/visual.2004.96", "10.1109/tvcg.2011.185", "10.1007/s00454-012-9465-x", "10.1016/s0925-7721(02)00093-7", "10.1109/tvcg.2018.2853721", "10.1111/cgf.12359", "10.1109/tvcg.2011.236", "10.1111/cgf.12360", "10.1109/tvcg.2017.2743938", "10.1007/b106657\\_2", "10.1109/tvcg.2019.2948616", "10.1007/978-3-319-04099-8\\_10", "10.2312/3dor.20161084", "10.1109/ldav.2015.7348089", "10.1111/cgf.12933", "10.1109/tvcg.2019.2934242", "10.1109/tvcg.2010.270", "10.1109/tvcg.2009.69", "10.1109/tvcg.2018.2873612", "10.1109/tvcg.2018.2864432", "10.4028/www.scientific.net/amm.869.9", "10.1109/tvcg.2007.47", "10.1007/s00454-016-9763-9", "10.1016/s0925-7721(02)00132-3", "10.1109/sc.2014.40", "10.1615/int.j.uncertaintyquantification.2012003956", "10.1145/2582112.2582169", "10.1057/palgrave.ivs.9500157", "10.1109/tvcg.2008.143", "10.1111/cgf.13164", "10.1089/cmb.1994.1.337", "10.1016/j.tcs.2004.12.030", "10.1145/322290.322295", "10.1007/978-3-319-63962-8\\_324-1"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13984", "year": "2020", "title": "Visual Analysis of the Finite-Time Lyapunov Exponent", "conferenceName": "EuroVis", "authors": "Antoni Sagrist{\\`{a}};Stefan Jordan;Filip Sadlo", "citationCount": "0", "affiliation": "Sagrista, A (Corresponding Author), Heidelberg Univ, Heidelberg, Germany.\nSagrista, Antoni; Jordan, Stefan; Sadlo, Filip, Heidelberg Univ, Heidelberg, Germany.", "countries": "Germany", "abstract": "In this paper, we present an integrated visual analytics approach to support the parametrization and exploration of flow visualization based on the finite-time Lyapunov exponent. Such visualization of time-dependent flow faces various challenges, including the choice of appropriate advection times, temporal regions of interest, and spatial resolution. Our approach eases these challenges by providing the user with context by means of parametric aggregations, with support and guidance for a more directed exploration, and with a set of derived measures for better qualitative assessment. We demonstrate the utility of our approach with examples from computation fluid dynamics and time-dependent dynamical systems.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13984", "refList": ["10.1145/37402.37422", "10.1109/38.79452", "10.1016/j.parco.2011.09.001", "10.1016/j.physd.2005.10.007", "10.1109/2.35197", "10.1109/tvcg.2007.70551", "10.1016/s0167-2789(00)00199-8", "10.1109/tvcg.2016.2599018", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2015.2467449", "10.2307/2003354", "10.1109/tvcg.2007.70554", "10.1090/s0002-9904-1967-11798-1", "10.1109/visual.2005.1532788", "10.1017/s0022112004009929", "10.1111/j.1467-8659.2011.01901.x", "10.1111/cgf.13439", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}], "len": 17}, {"doi": "10.1109/tvcg.2018.2864841", "title": "A Declarative Grammar of Flexible Volume Visualization Pipelines", "year": "2018", "conferenceName": "SciVis", "authors": "Min Shih;Charles Rozhon;Kwan-Liu Ma", "citationCount": "1", "affiliation": "Shih, M (Corresponding Author), Univ Calif Davis, Davis, CA 95616 USA. Shih, Min; Rozhon, Charles; Ma, Kwan-Liu, Univ Calif Davis, Davis, CA 95616 USA.", "countries": "USA", "abstract": "This paper presents a declarative grammar for conveniently and effectively specifying advanced volume visualizations. Existing methods for creating volume visualizations either lack the flexibility to specify sophisticated visualizations or are difficult to use for those unfamiliar with volume rendering implementation and parameterization. Our design provides the ability to quickly create expressive visualizations without knowledge of the volume rendering implementation. It attempts to capture aspects of those difficult but powerful methods while remaining flexible and easy to use. As a proof of concept, our current implementation of the grammar allows users to combine multiple data variables in various ways and define transfer functions for diverse input data. The grammar also has the ability to describe advanced shading effects and create animations. We demonstrate the power and flexibility of our approach using multiple practical volume visualizations.", "keywords": "Volume visualization,direct volume rendering,declarative specification,multivariate/multimodal volume data,animation", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864841", "refList": ["10.1109/38.31462", "10.1007/978-0-387-98141-3\\_1", "10.1109/visual.1992.235219", "10.1109/visual.2004.95", "10.1080/14685240802376389", "10.1109/tvcg.2015.2467449", "10.1109/visual.2005.1532788", "10.1109/tvcg.2011.185", "10.1145/2345156.2254079", "10.1109/scivis.2015.7429514", "10.1109/tvcg.2014.2346318", "10.1111/j.1467-8659.2011.01952.x", "10.2312/vissym/eurovis07/115-122", "10.1109/tvcg.2002.1021579", "10.1109/mcg.2009.130", "10.1109/tvcg.2015.2467091", "10.1109/tvcg.2007.70555", "10.1111/j.1467-8659.2007.01095.x", "10.1016/j.parco.2007.09.001", "10.1109/tvcg.2009.174", "10.1109/tvcg.2007.70534", "10.1109/tvcg.2016.2599041", "10.1109/tvcg.2014.2346322", "10.1109/mcg.2008.96", "10.1109/tvcg.2009.189", "10.1109/ipdps.2011.385", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2018.2865152", "title": "DXR: A Toolkit for Building Immersive Data Visualizations", "year": "2018", "conferenceName": "InfoVis", "authors": "Ronell Sicat;Jiabao Li;Junyoung Choi;Maxime Cordeil;Won-Ki Jeong;Benjamin Bach;Hanspeter Pfister", "citationCount": "12", "affiliation": "Sicat, R (Corresponding Author), Harvard Visual Comp Grp, Cambridge, MA USA. Sicat, Ronell; Pfister, Hanspeter, Harvard Visual Comp Grp, Cambridge, MA USA. Li, Jiabao, Harvard Grad Sch Design, Cambridge, MA USA. Bach, Benjamin, Univ Edinburgh, Sch Informat, Edinburgh, Midlothian, Scotland. Cordeil, Maxime, Monash Univ, Immers Analyt Lab, Clayton, Vic, Australia. Choi, JunYoung; Jeong, Won-Ki, Ulsan Natl Inst Sci \\& Technol, Ulsan, South Korea.", "countries": "Scotland;USA;Korea;Australia", "abstract": "This paper presents DXR, a toolkit for building immersive data visualizations based on the Unity development platform. Over the past years, immersive data visualizations in augmented and virtual reality (AR, VR) have been emerging as a promising medium for data sense-making beyond the desktop. However, creating immersive visualizations remains challenging, and often require complex low-level programming and tedious manual encoding of data attributes to geometric and visual properties. These can hinder the iterative idea-to-prototype process, especially for developers without experience in 3D graphics, AR, and VR programming. With DXR, developers can efficiently specify visualization designs using a concise declarative visualization grammar inspired by Vega-Lite. DXR further provides a GUI for easy and quick edits and previews of visualization designs in-situ, i.e., while immersed in the virtual world. DXR also provides reusable templates and customizable graphical marks, enabling unique and engaging visualizations. We demonstrate the flexibility of DXR through several examples spanning a wide range of applications.", "keywords": "Augmented Reality,Virtual Reality,Immersive Visualization,Immersive Analytics,Visualization Toolkit", "link": "http://dx.doi.org/10.1109/TVCG.2018.2865152", "refList": ["10.1145/2642918.2647369", "10.1109/tvcg.2015.2467449", "10.1109/tvcg.2011.185", "10.1145/2598153.2598175", "10.1109/tvcg.2016.2598609", "10.1145/1980462.1980470", "10.1109/tvcg.2014.2346318", "10.1145/3009939.3009947", "10.2312/conf/eg2013/stars/039-063", "10.1145/3013971.3014006", "10.1109/tvcg.2016.2598608", "10.1109/tvcg.2016.2599107", "10.1145/3173574.3173664", "10.1109/tvcg.2017.2745941", "10.1145/2556288.2557010", "10.1145/3126594.3126613", "10.1016/j.visinf.2017.11.002", "10.1111/cgf.12391", "10.1109/tvcg.2015.2467091", "10.1109/bigdata.2014.7004282", "10.1109/bdva.2015.7314302", "10.1109/tvcg.2010.144", "10.1109/tvcg.2009.174", "10.1109/infvis.2004.64", "10.1145/2133416.2146416", "10.1109/tvcg.2014.2346322", "10.1109/tvcg.2017.2744079", "10.1111/cgf.12804", "10.1371/journal.pone.0057990", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}], "len": 51}, "index": 333, "embedding": [1.1862801313400269, 2.2018885612487793, -1.059349536895752, -2.3949873447418213, 0.3045632541179657, 0.16650904715061188, -0.7182635068893433, 4.314229965209961, 4.5307230949401855, 3.9161922931671143, 2.0989608764648438, 3.5512285232543945, 6.877135276794434, 3.892056703567505, 0.634107232093811, -0.28119105100631714, 3.096083879470825, 0.07991757988929749, 1.3185973167419434, 2.234809160232544, -0.06630208343267441, -0.07267681509256363, -1.2505723237991333, 3.9614806175231934, -2.532860279083252, 5.098034381866455, -0.5399249196052551, 1.9457865953445435, 3.0554966926574707, -2.08601713180542, 2.2994165420532227, 2.2637486457824707], "projection": [2.0940849781036377, 9.96627426147461], "size": 26, "height": 7, "width": 13}