{"data": {"doi": "10.1109/tvcg.2015.2467203", "title": "Cluster Analysis of Vortical Flow in Simulations of Cerebral Aneurysm Hemodynamics", "year": "2015", "conferenceName": "SciVis", "authors": "Steffen Oeltze-Jafra;Juan R. Cebral;Gábor Janiga;Bernhard Preim", "citationCount": "21", "affiliation": "Oeltze-Jafra, S (Corresponding Author), Univ Magdeburg, Dept Simulat \\& Graph, D-39106 Magdeburg, Germany. Oeltze-Jafra, Steffen; Preim, Bernhard, Univ Magdeburg, Dept Simulat \\& Graph, D-39106 Magdeburg, Germany. Cebral, Juan R., George Mason Univ, Ctr Computat Fluid Dynam, Fairfax, VA 22030 USA. Janiga, Gabor, Univ Magdeburg, Inst Fluid Dynam \\& Thermodynam, D-39106 Magdeburg, Germany.", "countries": "Germany;USA", "abstract": "Computational fluid dynamic (CFD) simulations of blood flow provide new insights into the hemodynamics of vascular pathologies such as cerebral aneurysms. Understanding the relations between hemodynamics and aneurysm initiation, progression, and risk of rupture is crucial in diagnosis and treatment. Recent studies link the existence of vortices in the blood flow pattern to aneurysm rupture and report observations of embedded vortices - a larger vortex encloses a smaller one flowing in the opposite direction - whose implications are unclear. We present a clustering-based approach for the visual analysis of vortical flow in simulated cerebral aneurysm hemodynamics. We show how embedded vortices develop at saddle-node bifurcations on vortex core lines and convey the participating flow at full manifestation of the vortex by a fast and smart grouping of streamlines and the visualization of group representatives. The grouping result may be refined based on spectral clustering generating a more detailed visualization of the flow pattern, especially further off the core lines. We aim at supporting CFD engineers researching the biological implications of embedded vortices.", "keywords": "Blood Flow, Aneurysm, Clustering, Vortex Dynamics, Embedded Vortices", "link": "http://dx.doi.org/10.1109/TVCG.2015.2467203", "refList": ["10.1109/tvcg.2014.2346406", "10.1007/bf01386390", "10.1111/j.1467-8659.2012.03099.x", "10.1017/s0022112069000991", "10.1109/tvcg.2006.104", "10.1109/tvcg.2013.2297914", "10.2514/3.25224", "10.3174/ajnr.a3678", "10.1016/s1474-4422(11)70109-0", "10.1016/s0169-7439(01)00111-3", "10.1002/cnm.1424", "10.1109/tvcg.2011.155", "10.3174/ajnr.a2419", "10.1145/321992.321993", "10.1111/j.1467-8659.2011.02064.x", "10.1111/j.1467-8659.2008.01238.x", "10.1103/revmodphys.63.991", "10.1109/tvcg.2012.150", "10.1109/tmi.2003.815056", "10.1016/j.csda.2009.09.020", "10.1016/j.neuroimage.2008.12.023", "10.2312/vissym/vissym04/155-164", "10.1109/tvcg.2013.189", "10.1111/cgf.12112", "10.3174/ajnr.a2274", "10.2312/pe.eurovisshort.eurovisshort2013.061-065", "10.1109/visual.2002.1183789", "10.1016/j.compfluid.2012.02.020", "10.1016/s0168-874x(96)00038-8", "10.1109/tvcg.2012.202", "10.1016/b978-012387582-2/50016-2", "10.1109/visual.2004.59", "10.1109/tvcg.2006.199", "10.1109/tvcg.2006.201", "10.1002/j.1538-7305.1957.tb01515.x", "10.1111/j.1467-8659.2003.00723.x", "10.1002/cnm.1235", "10.1109/tmi.2005.844159", "10.1109/tvcg.2009.138", "10.1109/tvcg.2007.1053", "10.1109/pacificvis.2013.6596137"], "wos": 1, "children": [{"doi": "10.1111/cgf.13411", "year": "2018", "title": "Explorative Blood Flow Visualization using Dynamic Line Filtering based on Surface Features", "conferenceName": "EuroVis", "authors": "Benjamin Behrendt;Philipp Berg;Oliver Beuing;Bernhard Preim;Sylvia Saalfeld", "citationCount": "2", "affiliation": "Behrendt, B (Corresponding Author), Res Campus STIMULATE, Magdeburg, Germany.\nBehrendt, B (Corresponding Author), Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nBehrendt, B.; Berg, P.; Beuing, O.; Preim, B.; Saalfeld, S., Res Campus STIMULATE, Magdeburg, Germany.\nBehrendt, B.; Preim, B.; Saalfeld, S., Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nBerg, P., Univ Magdeburg, Dept Fluid Dynam \\& Tech Flows, Magdeburg, Germany.\nBeuing, O., Univ Hosp Magdeburg, Inst Neuroradiol, Magdeburg, Germany.", "countries": "Germany", "abstract": "Rupture risk assessment is a key to devise patient-specific treatment plans of cerebral aneurysms. To understand and predict the development of aneurysms and other vascular diseases over time, both hemodynamic flow patterns and their effect on the vessel surface need to be analyzed. Flow structures close to the vessel wall often correlate directly with local changes in surface parameters, such as pressure or wall shear stress. Yet, in many existing applications, the analyses of flow and surface features are either somewhat detached from one another or only globally available. Especially for the identification of specific blood flow characteristics that cause local startling parameters on the vessel surface, like elevated pressure values, an interactive analysis tool is missing. The explorative visualization of flow data is challenging due to the complexity of the underlying data. In order to find meaningful structures in the entirety of the flow, the data has to be filtered based on the respective explorative aim. In this paper, we present a combination of visualization, filtering and interaction techniques for explorative analysis of blood flow with a focus on the relation of local surface parameters and underlying flow structures. Coherent bundles of pathlines can be interactively selected based on their relation to features of the vessel wall and further refined based on their own hemodynamic features. This allows the user to interactively select and explore flow structures locally affecting a certain region on the vessel wall and therefore to understand the cause and effect relationship between these entities. Additionally, multiple selected flow structures can be compared with respect to their quantitative parameters, such as flow speed. We confirmed the usefulness of our approach by conducting an informal interview with two expert neuroradiologists and an expert in flow simulation. In addition, we recorded several insights the neuroradiologists were able to gain with the help of our tool.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13411", "refList": ["10.1109/tvcg.2012.318", "10.1109/tvcg.2006.104", "10.3171/2009.2.focus0921", "10.1109/tvcg.2015.2467961", "10.1109/tvcg.2013.2297914", "10.1109/tvcg.2009.58", "10.3174/ajnr.a5358", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2011.243", "10.2312/vcbm/vcbm10/025-032", "10.3174/ajnr.a5088", "10.3174/ajnr.a3710", "10.1109/tvcg.2013.189", "10.1111/cgf.12112", "10.1515/bmt-2012-0119", "10.1109/pacificvis.2011.5742376", "10.1109/tvcg.2015.2467203", "10.1109/tvcg.2010.153", "10.1016/s0140-6736(03)13860-3", "10.1109/tvcg.2012.202", "10.1109/tvcg.2009.198", "10.1115/1.4026108", "10.1161/01.str.0000260955.51401.cd"], "wos": 1, "children": [{"doi": "10.1111/cgf.14036", "year": "2020", "title": "A Survey of Seed Placement and Streamline Selection Techniques", "conferenceName": "EuroVis", "authors": "Sudhanshu Sane;Roxana Bujack;Christoph Garth;Hank Childs", "citationCount": "0", "affiliation": "Sane, S (Corresponding Author), Univ Oregon, Eugene, OR 97403 USA.\nSane, Sudhanshu; Childs, Hank, Univ Oregon, Eugene, OR 97403 USA.\nBujack, Roxana, Los Alamos Natl Lab, Los Alamos, NM USA.\nGarth, Christoph, Univ Kaiserslautern, Kaiserslautern, Germany.", "countries": "Germany;USA", "abstract": "Streamlines are an extensively utilized flow visualization technique for understanding, verifying, and exploring computational fluid dynamics simulations. One of the major challenges associated with the technique is selecting which streamlines to display. Using a large number of streamlines results in dense, cluttered visualizations, often containing redundant information and occluding important regions, whereas using a small number of streamlines could result in missing key features of the flow. Many solutions to select a representative set of streamlines have been proposed by researchers over the past two decades. In this state-of-the-art report, we analyze and classify seed placement and streamline selection (SPSS) techniques used by the scientific flow visualization community. At a high-level, we classify techniques into automatic and manual techniques, and further divide automatic techniques into three strategies: density-based, feature-based, and similarity-based. Our analysis evaluates the identified strategy groups with respect to focus on regions of interest, minimization of redundancy, and overall computational performance. Finally, we consider the application contexts and tasks for which SPSS techniques are currently applied and have potential applications in the future.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14036", "refList": ["10.1109/visual.1998.745295", "10.1007/978-3-540-70823-0\\_1", "10.1109/pacificvis.2014.14", "10.1111/j.1467-8659.2004.00753.x", "10.1109/visual.2000.885690", "10.1007/s00791-014-0229-4", "10.1109/tvcg.2012.143", "10.1109/mcg.2018.2881523", "10.1111/j.1467-8659.2009.01352.x", "10.1111/cgf.12356", "10.1109/tvcg.2005.87", "10.1007/s00371-007-0204-x", "10.1109/pacificvis.2015.7156350", "10.1080/14786440009463897", "10.1145/160985.161150", "10.1145/984952.984987", "10.1117/12.2001887", "10.1109/tvcg.2010.182", "10.1117/12.765736", "10.1109/mcg.2019.2936674", "10.1145/79505.79507", "10.1109/tvcg.2013.2297914", "10.1007/978-3-7091-6876-9\\_5", "10.1109/mcse.2007.82", "10.1109/ipec.2014.6869823", "10.1109/tvcg.2010.212", "10.1109/ldav.2015.7348070", "10.1111/cgf.12031", "10.3233/ica-130447", "10.1109/visual.1999.809918", "10.1109/mec.2013.6885356", "10.1109/83.623193", "10.1109/icsmc.2009.5346286", "10.1109/ihmsc.2019.00041", "10.1109/pacificvis.2011.5742376", "10.1109/pacificvis.2009.4906832", "10.1111/cgf.13411", "10.1109/tvcg.2011.260", "10.1016/j.cag.2015.06.003", "10.1109/tvcg.2009.206", "10.1109/cvpr.2007.383096", "10.1016/j.media.2007.10.003", "10.1016/j.cag.2016.08.001", "10.1109/tvcg.2006.95", "10.1109/ldav.2014.7013206", "10.1109/tvcg.2015.2467204", "10.1109/visual.1996.567777", "10.1109/visual.1992.235211", "10.1109/tvcg.2006.116", "10.1109/cis.2011.260", "10.1111/j.1467-8659.2011.02064.x", "10.1109/pacificvis.2013.6596153", "10.1109/tvcg.2012.150", "10.1016/j.gmod.2015.01.002", "10.1145/7529.8927", "10.1109/tvcg.2014.2325043", "10.1145/2461912.2461930", "10.1109/tvcg.2010.131", "10.1145/321796.321811", "10.1109/cis.2010.58", "10.1109/visual.2002.1183821", "10.1109/tvcg.2004.49", "10.1111/j.1467-8659.2011.01901.x", "10.1109/tvcg.2007.70595", "10.1109/cadgraphics.2015.48", "10.1109/tvcg.2011.215", "10.1109/icris.2016.3", "10.1126/science.1136800", "10.1109/tvcg.2006.104", "10.1111/j.1467-8659.2012.03102.x", "10.1109/tvcg.2014.2312009", "10.1109/visual.2000.885745", "10.1109/tvcg.2011.155", "10.2312/vissym/eurovis07/227-234", "10.1117/12.2038253", "10.1109/pacificvis.2014.12", "10.1016/j.cag.2015.01.002", "10.1109/tvcg.2007.1009", "10.1109/pacificvis.2010.5429603", "10.1109/visual.1998.745317", "10.1109/tvcg.2004.13", "10.1111/j.1467-8659.2010.01650.x", "10.1016/j.cag.2012.04.014", "10.1109/tvcg.2004.1260771", "10.1109/visual.2003.1250378", "10.1109/visual.2004.59", "10.1109/visual.2003.1250376", "10.1109/visual.1994.346312", "10.1111/cgf.12336", "10.1111/j.1467-8659.2003.00723.x", "10.1017/s0022112095000462", "10.1109/cis.2009.194"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.13422", "year": "2018", "title": "An Approximate Parallel Vectors Operator for Multiple Vector Fields", "conferenceName": "EuroVis", "authors": "Tim Gerrits;Christian R{\\\"{o}}ssl;Holger Theisel", "citationCount": "1", "affiliation": "Gerrits, T (Corresponding Author), Univ Magdeburg, Visual Comp Grp, Magdeburg, Germany.\nGerrits, Tim; Roessl, Christian; Theisel, Holger, Univ Magdeburg, Visual Comp Grp, Magdeburg, Germany.", "countries": "Germany", "abstract": "The Parallel Vectors (PV) Operator extracts the locations of points where two vector fields are parallel. In general, these features are line structures. The PV operator has been used successfully for a variety of problems, which include finding vortex-core lines or extremum lines. We present a new generic feature extraction method for multiple 3D vector fields: The Approximate Parallel Vectors (APV) Operator extracts lines where all fields are approximately parallel. The definition of the APV operator is based on the application of PV for two vector fields that are derived from the given set of fields. The APV operator enables the direct visualization of features of vector field ensembles without processing fields individually and without causing visual clutter. We give a theoretical analysis of the APV operator and demonstrate its utility for a number of ensemble data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13422", "refList": ["10.1109/tvcg.2013.143", "10.1109/tvcg.2015.2467204", "10.1109/pacificvis.2016.7465256", "10.1615/int.j.uncertaintyquantification.2012003966", "10.1111/cgf.12898", "10.1109/tvcg.2013.144", "10.1109/tvcg.2013.2297914", "10.1016/0734-189x(83)90094-4", "10.1109/2945.468404", "10.1109/tvcg.2014.2346455", "10.1109/visual.1998.745297", "10.1109/visual.1999.809896", "10.1109/tvcg.2011.78", "10.1109/2945.506222", "10.3174/ajnr.a4157", "10.1109/tvcg.2015.2467203", "10.1109/tvcg.2009.11", "10.1115/1.4031794", "10.1007/s12650-016-0388-0", "10.1109/tvcg.2010.93", "10.1111/j.1467-8659.2011.01924.x", "10.1109/vast.2015.7347634", "10.1111/j.1467-8659.2003.00723.x", "10.1109/visual.1998.745296", "10.1017/s0022112095000462", "10.1109/tvcg.2004.39"], "wos": 1, "children": [{"doi": "10.1111/cgf.13687", "year": "2019", "title": "The Dependent Vectors Operator", "conferenceName": "EuroVis", "authors": "Lutz Hofmann;Filip Sadlo", "citationCount": "1", "affiliation": "Hofmann, L (Corresponding Author), Heidelberg Univ, Heidelberg, Germany.\nHofmann, Lutz; Sadlo, Filip, Heidelberg Univ, Heidelberg, Germany.", "countries": "Germany", "abstract": "In this paper, we generalize the parallel vectors operator due to Peikert and Roth to arbitrary dimension, i.e., to four-dimensional fields and beyond. Whereas the original operator tested for parallelism of two (derived) 2D or 3D vector fields, we reformulate the concept in terms of linear dependency of sets of vector fields, and propose a generic technique to extract and filter the solution manifolds. We exemplify our approach for vortex cores, bifurcations, and ridges as well as valleys in higher dimensions.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13687", "refList": ["10.1109/tvcg.2007.70633", "10.1111/cgf.12885", "10.1109/visual.2004.68", "10.1111/cgf.13421", "10.1109/tvcg.2014.2346412", "10.2514/3.25224", "10.1145/502512.502530", "10.1088/1742-6596/78/1/012007", "10.1146/annurev.fl.19.010187.001013", "10.1016/j.physd.2005.10.007", "10.1109/visual.1998.745297", "10.1007/bf01262402", "10.1109/visual.1999.809896", "10.1016/j.comgeo.2007.11.001", "10.1007/bf01898350", "10.1109/tvcg.2009.11", "10.1109/visual.1993.398859", "10.1109/tvcg.2010.93", "10.1111/j.1467-8659.2011.01924.x", "10.1111/cgf.13423", "10.1145/37402.37422", "10.1109/tvcg.2007.70545", "10.1109/tvcg.2004.1260765", "10.1109/visual.1998.745296", "10.1109/visual.1996.568103", "10.1111/cgf.13422"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.13689", "year": "2019", "title": "Robust Reference Frame Extraction from Unsteady 2D Vector Fields with Convolutional Neural Networks", "conferenceName": "EuroVis", "authors": "Byungsoo Kim;Tobias G{\\\"{u}}nther", "citationCount": "3", "affiliation": "Kim, B (Corresponding Author), Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.\nKim, Byungsoo; Guenther, Tobias, Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "Robust feature extraction is an integral part of scientific visualization. In unsteady vector field analysis, researchers recently directed their attention towards the computation of near-steady reference frames for vortex extraction, which is a numerically challenging endeavor. In this paper, we utilize a convolutional neural network to combine two steps of the visualization pipeline in an end-to-end manner: the filtering and the feature extraction. We use neural networks for the extraction of a steady reference frame for a given unsteady 2D vector field. By conditioning the neural network to noisy inputs and resampling artifacts, we obtain numerically stabler results than existing optimization-based approaches. Supervised deep learning typically requires a large amount of training data. Thus, our second contribution is the creation of a vector field benchmark data set, which is generally useful for any local deep learning-based feature extraction. Based on Vatistas velocity profile, we formulate a parametric vector field mixture model that we parameterize based on numerically-computed example vector fields in near-steady reference frames. Given the parametric model, we can efficiently synthesize thousands of vector fields that serve as input to our deep learning architecture. The proposed network is evaluated on an unseen numerical fluid flow simulation.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13689", "refList": ["10.1016/0377-0257(79)87004-4", "10.1111/cgf.12358", "10.1109/tvcg.2018.2864828", "10.1016/0167-2789(91)90088-q", "10.1007/978-3-540-70823-0\\_9", "10.1016/b978-012387582-2/50040-x", "10.1111/cgf.13405", "10.1111/cgf.13319", "10.1109/tvcg.2018.2843369", "10.1007/bf00538235", "10.23940/ijpe.18.03", "10.1017/jfm.2016.151", "10.1109/visual.1999.809896", "10.1146/annurev.fluid.23.1.601", "10.1109/tvcg.2007.1036", "10.1109/tvcg.2018.2864839", "10.1007/978-3-319-54024-5\\_6", "10.1109/tvcg.2013.189", "10.1145/3072959.3073684", "10.1109/tvcg.2015.2467203", "10.2514/2.957", "10.1016/0960-0779(94)90137-6", "10.1109/visual.1991.175773", "10.1109/visual.1996.568137", "10.1017/s0022112004002526", "10.1109/pacificvis.2016.7465253", "10.1007/bf00849110", "10.1007/bf00198434", "10.1109/tvcg.2007.70545", "10.3390/informatics4030027", "10.1137/140983665", "10.1016/0011-7471(70)90059-8", "10.1017/s0022112095000462", "10.1145/1183287.1183290"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3028947", "title": "A Fluid Flow Data Set for Machine Learning and its Application to Neural Flow Map Interpolation", "year": "2020", "conferenceName": "SciVis", "authors": "Jakob Jakob;Markus H. Gross;Tobias Günther", "citationCount": "0", "affiliation": "Jakob, J (Corresponding Author), Swiss Fed Inst Technol, Zurich, Switzerland. Jakob, Jakob; Gross, Markus; Guenther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "In recent years, deep learning has opened countless research opportunities across many different disciplines. At present, visualization is mainly applied to explore and explain neural networks. Its counterpart-the application of deep learning to visualization problems-requires us to share data more openly in order to enable more scientists to engage in data-driven research. In this paper, we construct a large fluid flow data set and apply it to a deep learning problem in scientific visualization. Parameterized by the Reynolds number, the data set contains a wide spectrum of laminar and turbulent fluid flow regimes. The full data set was simulated on a high-performance compute cluster and contains 8000 time-dependent 2D vector fields, accumulating to more than 16 TB in size. Using our public fluid data set, we trained deep convolutional neural networks in order to set a benchmark for an improved post-hoc Lagrangian fluid flow analysis. In in-situ settings, flow maps are exported and interpolated in order to assess the transport characteristics of time-dependent fluids. Using deep learning, we improve the accuracy of flow map interpolations, allowing a more precise flow analysis at a reduced memory IO footprint.", "keywords": "Scientific visualization,deep learning,flow maps", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028947", "refList": ["10.1007/978-3-319-10593-2\\_25", "10.1145/3355089.3356560", "10.1109/access.2019.2903582", "10.1111/cgf.13405", "10.1109/tmm.2019.2919431", "10.1017/jfm.2016.151", "10.1016/j.physd.2005.10.007", "10.1007/978-3-030-00533-7\\_36", "10.3390/rs11161921", "10.1007/978-3-030-48457-6\\_1", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/tvcg.2007.70554", "10.1109/mcg.2018.2881523", "10.1109/cvpr.2016.207", "10.1145/1073204.1073264", "10.1145/3072959.3073643", "10.1109/tpami.2015.2439281", "10.2312/pgv", "10.4208/cicp.oa-2018-0035", "10.1109/cvpr.2017.693", "10.1109/tvcg.2013.128", "10.1109/igarss.2018.8519261", "10.1063/1.3270044", "10.2312/pgv.20191115", "10.1145/3197517.3201304", "10.1145/3065386", "10.1145/1360612.1360649", "10.1109/mcse.2015.103", "10.1145/3355089.3356575", "10.1109/mcg.2018.2881502", "10.1029/2019jd032121", "10.3390/informatics4030027", "10.1109/access.2019.2931781", "10.1007/s12650-018-0523-1", "10.1109/tvcg.2019.2934332", "10.1146/annurev.fluid.32.1.165", "10.1007/978-3-319-46475-6\\_43", "10.1126/science.1127647", "10.1007/978-3-319-46475-6\\_25", "10.1111/cgf.13689"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.8737", "year": "2020", "title": "SSR-VFD: Spatial Super-Resolution for Vector Field Data Analysis and Visualization", "conferenceName": "PacificVis", "authors": "Li Guo;Shaojie Ye;Jun Han;Hao Zheng;Han Gao;Danny Z. Chen;Jian{-}Xun Wang;Chaoli Wang", "citationCount": "1", "affiliation": "Guo, L (Corresponding Author), Nankai Univ, Tianjin, Peoples R China.\nGuo, Li, Nankai Univ, Tianjin, Peoples R China.\nYe, Shaojie, Zhejiang Univ, Hangzhou, Zhejiang, Peoples R China.\nHan, Jun; Zheng, Hao; Gao, Han; Chen, Danny Z.; Wang, Jian-Xun; Wang, Chaoli, Univ Notre Dame, Notre Dame, IN 46556 USA.", "countries": "USA;China", "abstract": "We present SSR-VFD, a novel deep learning framework that produces coherent spatial super-resolution (SSR) of three-dimensional vector field data (VFD). SSR-VFD is the first work that advocates a machine learning approach to generate high-resolution vector fields from low-resolution ones. The core of SSR-VFD lies in the use of three separate neural nets that take the three components of a low-resolution vector field as input and jointly output a synthesized high-resolution vector field. To capture spatial coherence, we take into account magnitude and angle losses in network optimization. Our method can work in the in situ scenario where VFD are down-sampled at simulation time for storage saving and these reduced VFD are upsampled back to their original resolution during postprocessing. To demonstrate the effectiveness of SSR-VFD, we show quantitative and qualitative results with several vector field data sets of different characteristics and compare our method against volume upscaling using bicubic interpolation, and two solutions based on CNN and GAN, respectively.", "keywords": "Spatial super-resolution; vector field data; convolutional neural network; deep learning", "link": "https://doi.org/10.1109/PacificVis48177.2020.8737", "refList": ["10.1016/j.ijvsm.2017.05.001", "10.1016/j.jvs.2005.01.020", "10.1109/iccv.2015.123", "10.1111/cgf.13620", "10.1109/cvpr.2019.00831", "10.1109/cvpr.2019.00817", "10.1109/cvpr.2019.00399", "10.1109/tvcg.2019.2934312", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/tvcg.2018.2816059", "10.1109/mcg.2018.2881523", "10.1109/tpami.2015.2439281", "10.1109/bigdata.2018.8622520", "10.1145/3197517.3201304", "10.1109/tvcg.2018.2796085", "10.1109/tvcg.2019.2934255", "10.1109/cvpr.2016.90", "10.1109/pacificvis.2019.00041", "10.1111/cgf.13689"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030374", "title": "VC-Net: Deep Volume-Composition Networks for Segmentation and Visualization of Highly Sparse and Noisy Image Data", "year": "2020", "conferenceName": "SciVis", "authors": "Yifan Wang;Guoli Yan;Haikuan Zhu;Sagar Buch;Ying Wang;E. Mark Haacke;Jing Hua;Zichun Zhong", "citationCount": "0", "affiliation": "Wang, YF (Corresponding Author), Wayne State Univ, Dept Comp Sci, Detroit, MI 48202 USA. Wang, Yifan; Yan, Guoli; Zhu, Haikuan; Hua, Jing; Zhong, Zichun, Wayne State Univ, Dept Comp Sci, Detroit, MI 48202 USA. Buch, Sagar; Wang, Ying; Haacke, Ewart Mark, Wayne State Univ, Dept Radiol, Detroit, MI 48201 USA.", "countries": "USA", "abstract": "The fundamental motivation of the proposed work is to present a new visualization-guided computing paradigm to combine direct 3D volume processing and volume rendered clues for effective 3D exploration. For example, extracting and visualizing microstructures in-vivo have been a long-standing challenging problem. However, due to the high sparseness and noisiness in cerebrovasculature data as well as highly complex geometry and topology variations of micro vessels, it is still extremely challenging to extract the complete 3D vessel structure and visualize it in 3D with high fidelity. In this paper, we present an end-to-end deep learning method, VC-Net, for robust extraction of 3D microvascular structure through embedding the image composition, generated by maximum intensity projection (MIP), into the 3D volumetric image learning process to enhance the overall performance. The core novelty is to automatically leverage the volume visualization technique (e.g., MIP - a volume rendering scheme for 3D volume images) to enhance the 3D data exploration at the deep learning level. The MIP embedding features can enhance the local vessel signal (through canceling out the noise) and adapt to the geometric variability and scalability of vessels, which is of great importance in microvascular tracking. A multi-stream convolutional neural network (CNN) framework is proposed to effectively learn the 3D volume and 2D MIP feature vectors, respectively, and then explore their inter-dependencies in a joint volume-composition embedding space by unprojecting the 2D feature vectors into the 3D volume embedding space. It is noted that the proposed framework can better capture the small/micro vessels and improve the vessel connectivity. To our knowledge, this is the first time that a deep learning framework is proposed to construct a joint convolutional embedding space, where the computed vessel probabilities from volume rendering based 2D projection and 3D volume can be explored and integrated synergistically. Experimental results are evaluated and compared with the traditional 3D vessel segmentation methods and the state-of-the-art in deep learning, by using extensive public and real patient (micro- )cerebrovascular image datasets. The application of this accurate segmentation and visualization of sparse and complicated 3D microvascular structure facilitated by our method demonstrates the potential in a powerful MR arteriogram and venogram diagnosis of vascular disease.", "keywords": "Deep neural network,3D cerebrovascular segmentation and visualization,maximum intensity projection (MIP),joint embedding", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030374", "refList": ["10.1109/cluster.2018.00036", "10.1109/iccv.2015.123", "10.1109/tvcg.2013.133", "10.1109/cvpr.2017.19", "10.1109/tvcg.2019.2934312", "10.1007/978-3-319-46487-9\\_40", "10.1109/tvcg.2006.175", "10.1109/tvcg.2007.70523", "10.1109/tvcg.2018.2880207", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/iccv.2017.244", "10.1109/cvpr.2017.632", "10.1109/tvcg.2018.2816059", "10.1109/pacificvis.2009.4906852", "10.1109/tvcg.2018.2864808", "10.1109/mcg.2018.2881523", "10.1109/tvcg.2015.2467431", "10.1109/tpami.2015.2439281", "10.1109/pacificvis48177.2020.8737", "10.1109/cvpr.2019.00244", "10.1109/tvcg.2006.165", "10.1109/bigdata.2018.8622520", "10.1007/978-3-319-46466-4\\_29", "10.1109/visual.2019.8933759", "10.1145/3197517.3201304", "10.1109/pacificvis.2011.5742378", "10.1109/cvpr.2006.91", "10.1109/pacificvis.2011.5742369", "10.1109/tvcg.2019.2934255", "10.1109/cvpr.2016.90", "10.1007/978-3-319-24574-4\\_28", "10.1109/pacificvis.2019.00041", "10.1109/tvcg.2019.2934332", "10.1109/cvpr.2018.00916", "10.1007/978-3-319-46475-6\\_43"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}], "len": 17}, "index": 443, "embedding": [-0.5019773840904236, 1.1386054754257202, -1.03950035572052, -1.5685631036758423, -0.41775816679000854, 0.16650904715061188, -0.7477038502693176, 2.3466598987579346, 2.7869629859924316, -0.7806206345558167, 2.3761422634124756, 0.4950725734233856, 2.545783281326294, 2.925152063369751, -0.32575345039367676, 0.1071387231349945, 1.086969256401062, 0.06584581732749939, 0.7722725868225098, 2.89727520942688, -0.06630208343267441, -0.3321577310562134, 0.009392229840159416, 1.4488322734832764, -2.4589109420776367, 1.9110978841781616, -0.4969606399536133, 0.44583845138549805, 1.628618836402893, -2.6684696674346924, 1.36646568775177, 0.7400127053260803], "projection": [1.077090859413147, 8.394428253173828], "size": 9, "height": 4, "width": 4}