{"data": {"doi": "10.1109/tvcg.2015.2467331", "title": "JiTTree: A Just-in-Time Compiled Sparse GPU Volume Data Structure", "year": "2015", "conferenceName": "SciVis", "authors": "Matthias Labschutz;Stefan Bruckner;M. Eduard Gröller;Markus Hadwiger;Peter Rautek", "citationCount": "11", "affiliation": "Labschutz, M (Corresponding Author), KAUST, Thuwal, Saudi Arabia. Labschuetz, Matthias; Hadwiger, Markus; Rautek, Peter, KAUST, Thuwal, Saudi Arabia. Bruckner, Stefan, Univ Bergen, N-5020 Bergen, Norway. Groeller, M. Eduard, TU Wien, Vienna, Austria. Groeller, M. Eduard, VrVis Res Ctr, Vienna, Austria.", "countries": "Norway;Arabia;Austria", "abstract": "Sparse volume data structures enable the efficient representation of large but sparse volumes in GPU memory for computation and visualization. However, the choice of a specific data structure for a given data set depends on several factors, such as the memory budget, the sparsity of the data, and data access patterns. In general, there is no single optimal sparse data structure, but a set of several candidates with individual strengths and drawbacks. One solution to this problem are hybrid data structures which locally adapt themselves to the sparsity. However, they typically suffer from increased traversal overhead which limits their utility in many applications. This paper presents JiTTree, a novel sparse hybrid volume data structure that uses just-in-time compilation to overcome these problems. By combining multiple sparse data structures and reducing traversal overhead we leverage their individual advantages. We demonstrate that hybrid data structures adapt well to a large range of data sets. They are especially superior to other sparse data structures for data sets that locally vary in sparsity. Possible optimization criteria are memory, performance and a combination thereof. Through just-in-time (JIT) compilation, JiTTree reduces the traversal overhead of the resulting optimal data structure. As a result, our hybrid volume data structure enables efficient computations on the GPU, while being superior in terms of memory usage when compared to non-hybrid data structures.", "keywords": "Data Transformation and Representation, GPUs and Multi-core Architectures, Volume Rendering", "link": "http://dx.doi.org/10.1109/TVCG.2015.2467331", "refList": ["10.1145/1071866.1071869", "10.1145/2480359.2429128", "10.1145/2184319.2184345", "10.1145/1507149.1507152", "10.1016/j.cag.2004.06.010", "10.1111/j.1467-8659.2009.01377.x", "10.1007/bf00288933", "10.1109/tvcg.2012.240", "10.1145/1122501.1122505", "10.1145/1141911.1141926", "10.1145/2584665", "10.1145/358728.358741", "10.1145/361002.361007", "10.1109/hpca.2011.5749745", "10.1109/icip.1999.822944", "10.1145/280277.280279"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2016.2599043", "title": "A Versatile and Efficient GPU Data Structure for Spatial Indexing", "year": "2016", "conferenceName": "SciVis", "authors": "Jens Schneider;Peter Rautek", "citationCount": "4", "affiliation": "Schneider, J (Corresponding Author), King Abdullah Univ Sci \\& Technol KAUST, Visual Comp Ctr, Thuwal, Saudi Arabia. Schneider, Jens; Rautek, Peter, King Abdullah Univ Sci \\& Technol KAUST, Visual Comp Ctr, Thuwal, Saudi Arabia.", "countries": "Arabia", "abstract": "In this paper we present a novel GPU-based data structure for spatial indexing. Based on Fenwick trees-a special type of binary indexed trees-our data structure allows construction in linear time. Updates and prefixes can be computed in logarithmic time, whereas point queries require only constant time on average. Unlike competing data structures such as summed-area tables and spatial hashing, our data structure requires a constant amount of bits for each data element, and it offers unconstrained point queries. This property makes our data structure ideally suited for applications requiring unconstrained indexing of large data, such as block-storage of large and block-sparse volumes. Finally, we provide asymptotic bounds on both run-time and memory requirements, and we show applications for which our new data structure is useful.", "keywords": "GPU-based Data Structures;Binary Index Trees;Sparse Data", "link": "http://dx.doi.org/10.1109/TVCG.2016.2599043", "refList": ["10.1002/spe.4380240306", "10.1145/1507149.1507152", "10.1007/bf02476026", "10.1137/s0036141095289051", "10.1111/j.1467-8659.2005.00880.x", "10.1145/322217.322232", "10.1111/j.1467-8659.2008.01182.x", "10.1109/tvcg.2015.2467331", "10.1145/1141911.1141926", "10.1109/12.42122"], "wos": 1, "children": [{"doi": "10.1109/pacificvis.2019.00033", "year": "2019", "title": "A Linear Time BVH Construction Algorithm for Sparse Volumes", "conferenceName": "PacificVis", "authors": "Stefan Zellmann;Matthias Hellmann;Ulrich Lang", "citationCount": "1", "affiliation": "Zellmann, S (Corresponding Author), Univ Cologne, Cologne, Germany.\nZellmann, Stefan; Hellmann, Matthias; Lang, Ulrich, Univ Cologne, Cologne, Germany.", "countries": "Germany", "abstract": "While fast spatial index construction for triangle meshes has gained a lot of attention from the research community in recent years, fast tree construction algorithms for volume data are still rare and usually do not focus on real-time processing. We propose a linear time bounding volume hierarchy construction algorithm based on a popular method for surface ray tracing of triangle meshes that we adapt for direct volume rendering with sparse volumes. We aim at interactive to real-time construction rates and evaluate our algorithm using a GPU implementation.", "keywords": "Computing methodologies; Visualization; Visualization application domains; Scientific visualization; Computing methodologies; Computer Graphics; Rendering; Ray tracing", "link": "https://doi.org/10.1109/PacificVis.2019.00033", "refList": ["10.2312/eggh/hpg12/033-037", "10.2312/pgv.20181097", "10.1145/2018323", "10.1109/tvcg.2016.2599043", "10.1145/1572769.1572792", "10.1109/tvcg.2012.151", "10.1109/rt.2007.4342588", "10.1111/j.1467-8659.2009.01377.x"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2017.2744238", "title": "SparseLeap: Efficient Empty Space Skipping for Large-Scale Volume Rendering", "year": "2017", "conferenceName": "SciVis", "authors": "Markus Hadwiger;Ali K. Al-Awami;Johanna Beyer;Marco Agus;Hanspeter Pfister", "citationCount": "9", "affiliation": "Hadwiger, M (Corresponding Author), KAUST, Thuwal 239556900, Saudi Arabia. Hadwiger, Markus; Al-Awami, Ali K.; Agus, Marco, KAUST, Thuwal 239556900, Saudi Arabia. Beyer, Johanna; Pfister, Hanspeter, Harvard Univ, John A Paulson Sch Engn \\& Appl Sci, Cambridge, MA 02138 USA.", "countries": "USA;Arabia", "abstract": "Recent advances in data acquisition produce volume data of very high resolution and large size, such as terabyte-sized microscopy volumes. These data often contain many fine and intricate structures, which pose huge challenges for volume rendering, and make it particularly important to efficiently skip empty space. This paper addresses two major challenges: (1) The complexity of large volumes containing fine structures often leads to highly fragmented space subdivisions that make empty regions hard to skip efficiently. (2) The classification of space into empty and non-empty regions changes frequently, because the user or the evaluation of an interactive query activate a different set of objects, which makes it unfeasible to pre-compute a well-adapted space subdivision. We describe the novel SparseLeap method for efficient empty space skipping in very large volumes, even around fine structures. The main performance characteristic of SparseLeap is that it moves the major cost of empty space skipping out of the ray-casting stage. We achieve this via a hybrid strategy that balances the computational load between determining empty ray segments in a rasterization (object-order) stage, and sampling non-empty volume data in the ray-casting (image-order) stage. Before ray-casting, we exploit the fast hardware rasterization of GPUs to create a ray segment list for each pixel, which identifies non-empty regions along the ray. The ray-casting stage then leaps over empty space without hierarchy traversal. Ray segment lists are created by rasterizing a set of fine-grained, view-independent bounding boxes. Frame coherence is exploited by re-using the same bounding boxes unless the set of active objects changes. We show that SparseLeap scales better to large, sparse data than standard octree empty space skipping.", "keywords": "Empty Space Skipping,Volume Rendering,Segmented Volume Data,Hybrid Image/Object-Order Approaches", "link": "http://dx.doi.org/10.1109/TVCG.2017.2744238", "refList": ["10.1109/ldav.2013.6675157", "10.1145/353888.353889", "10.1145/1073204.1073277", "10.1111/j.1467-8659.2010.01725.x", "10.1364/boe.2.002888", "10.1007/pl00013406", "10.1007/s00371-010-0453-y", "10.1109/visual.2002.1183775", "10.1145/1071866.1071869", "10.1111/j.1467-8659.2005.00855.x", "10.1109/tvcg.2009.161", "10.1109/visual.1999.809908", "10.1109/visual.1995.480792", "10.1109/tvcg.2012.240", "10.1109/visual.1992.235231", "10.1109/tvcg.2015.2467331", "10.1109/visual.1990.146377", "10.1111/cgf.12605", "10.1007/s00371-008-0261-9", "10.1109/tvcg.2003.1207442", "10.1109/visual.2004.63", "10.1111/j.1467-8659.2007.01064.x", "10.1109/tvcg.2013.142", "10.1145/1730804.1730814", "10.1109/visual.2003.1250388", "10.1145/1507149.1507152", "10.1145/1618452.1618498", "10.1109/tvcg.2007.70532", "10.1109/tvcg.2006.197", "10.1109/visual.2003.1250384", "10.1109/tvcg.2012.274", "10.1109/pacificvis.2011.5742355", "10.1109/bigdata.2013.6691717", "10.1109/visual.2001.964521", "10.1109/visual.1999.809911", "10.1111/j.1467-8659.2009.01466.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864847", "title": "Culling for Extreme-Scale Segmentation Volumes: A Hybrid Deterministic and Probabilistic Approach", "year": "2018", "conferenceName": "SciVis", "authors": "Johanna Beyer;Haneen Mohammed;Marco Agus;Ali K. Al-Awami;Hanspeter Pfister;Markus Hadwiger", "citationCount": "2", "affiliation": "Beyer, J (Corresponding Author), Harvard Univ, Cambridge, MA 02138 USA. Beyer, Johanna; Mohammed, Haneen; Pfister, Hanspeter, Harvard Univ, Cambridge, MA 02138 USA. Mohammed, Haneen; Agus, Marco; Hadwiger, Markus, KAUST, Thuwal, Saudi Arabia. Al-Awami, Ali K., KAUST, Dhahran, Saudi Arabia. Al-Awami, Ali K., Saudi Aramco, Dhahran, Saudi Arabia.", "countries": "Arabia;USA", "abstract": "With the rapid increase in raw volume data sizes, such as terabyte-sized microscopy volumes, the corresponding segmentation label volumes have become extremely large as well. We focus on integer label data, whose efficient representation in memory, as well as fast random data access, pose an even greater challenge than the raw image data. Often, it is crucial to be able to rapidly identify which segments are located where, whether for empty space skipping for fast rendering, or for spatial proximity queries. We refer to this process as<i>culling</i>. In order to enable efficient culling of millions of labeled segments, we present a novel hybrid approach that combines deterministic and probabilistic representations of label data in a data-adaptive hierarchical data structure that we call the label list tree. In each node, we adaptively encode label data using either a probabilistic constant-time access representation for fast conservative culling, or a deterministic logarithmic-time access representation for exact queries. We choose the best data structures for representing the labels of each spatial region while building the label list tree. At run time, we further employ a novel<i>query-adaptive</i>culling strategy. While filtering a query down the tree, we prune it successively, and in each node adaptively select the representation that is best suited for evaluating the pruned query, depending on its size. We show an analysis of the efficiency of our approach with several large data sets from connectomics, including a brain scan with more than 13 million labeled segments, and compare our method to conventional culling approaches. Our approach achieves significant reductions in storage size as well as faster query times.", "keywords": "Hierarchical Culling,Segmented Volume Data,Bloom Filter,Volume Rendering,Spatial Queries", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864847", "refList": ["10.1145/362686.362692", "10.1109/tvcg.2005.59", "10.1364/boe.2.002888", "10.1109/tvcg.2009.121", "10.1007/pl00013406", "10.1111/j.1467-8659.2005.00855.x", "10.1145/2674005.2674994", "10.1002/spe.2402", "10.1109/visual.1999.809908", "10.1109/visual.1995.480792", "10.1016/j.cell.2015.06.054", "10.1109/tvcg.2012.240", "10.1109/visual.1992.235231", "10.1002/spe.2325", "10.1109/visual.1990.146377", "10.1111/cgf.12605", "10.1002/spe.2560", "10.1007/s00371-008-0261-9", "10.1145/78973.78977", "10.1109/90.851975", "10.1109/visual.2003.1250386", "10.1109/tvcg.2013.142", "10.1007/978-3-319-66182-7\\_89", "10.1145/1507149.1507152", "10.1145/263407.263545", "10.1109/visual.2003.1250384", "10.1109/pacificvis.2011.5742370", "10.1016/j.media.2015.02.001", "10.1109/mcg.2013.55", "10.1109/tvcg.2017.2744238", "10.1109/visual.2001.964521"], "wos": 1, "children": [{"doi": "10.1111/cgf.13700", "year": "2019", "title": "Interactive Volumetric Visual Analysis of Glycogen-derived Energy Absorption in Nanometric Brain Structures", "conferenceName": "EuroVis", "authors": "Marco Agus;Corrado Cal{\\`{\\i}};Ali K. Al{-}Awami;Enrico Gobbetti;Pierre J. Magistretti;Markus Hadwiger", "citationCount": "3", "affiliation": "Agus, M (Corresponding Author), KAUST, Thuwal, Saudi Arabia.\nAgus, M (Corresponding Author), VCC, Thuwal, Saudi Arabia.\nAgus, M (Corresponding Author), Ctr Adv Studies Res \\& Dev Sardinia CRS4, Visual Comp Grp, Cagliari, Italy.\nAgus, M.; Cali, C.; Al-Awami, A.; Magistretti, P.; Hadwiger, M., KAUST, Thuwal, Saudi Arabia.\nAgus, M.; Al-Awami, A.; Hadwiger, M., VCC, Thuwal, Saudi Arabia.\nCali, C.; Magistretti, P., BESE, Thuwal, Saudi Arabia.\nAgus, M.; Gobbetti, E., Ctr Adv Studies Res \\& Dev Sardinia CRS4, Visual Comp Grp, Cagliari, Italy.\nAl-Awami, A., Saudi Aramco \\& EXPEC Comp Ctr, Dharhan, Saudi Arabia.", "countries": "Italy;Arabia", "abstract": "Digital acquisition and processing techniques are changing the way neuroscience investigation is carried out. Emerging applications range from statistical analysis on image stacks to complex connectomics visual analysis tools targeted to develop and test hypotheses of brain development and activity. In this work, we focus on neuroenergetics, a field where neuroscientists analyze nanoscale brain morphology and relate energy consumption to glucose storage in form of glycogen granules. In order to facilitate the understanding of neuroenergetic mechanisms, we propose a novel customized pipeline for the visual analysis of nanometric-level reconstructions based on electron microscopy image data. Our framework supports analysis tasks by combining i) a scalable volume visualization architecture able to selectively render image stacks and corresponding labelled data, ii) a method for highlighting distance-based energy absorption probabilities in form of glow maps, and iii) a hybrid connectivitybased and absorption-based interactive layout representation able to support queries for selective analysis of areas of interest and potential activity within the segmented datasets. This working pipeline is currently used in a variety of studies in the neuroenergetics domain. Here, we discuss a test case in which the framework was successfully used by domain scientists for the analysis of aging effects on glycogen metabolism, extracting knowledge from a series of nanoscale brain stacks of rodents somatosensory cortex.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13700", "refList": ["10.1371/journal.pone.0038011", "10.1016/j.coisb.2017.07.011", "10.1145/234535.234538", "10.1109/tvcg.2018.2864847", "10.2312/conf/eg2012/stars/053-074", "10.3389/fnins.2018.00664", "10.1109/tpami.2018.2835450", "10.1109/tvcg.2014.2346312", "10.1109/tvcg.2009.121", "10.1002/glia.23020", "10.1117/1.jbo.18.5.050902", "10.1111/cgf.12927", "10.1038/nn.3837", "10.1109/isbi.2011.5872394", "10.3868/j.issn.2096-0689.2017.04.004", "10.1111/cgf.12792", "10.1016/j.neuroscience.2012.09.077", "10.1109/tvcg.2012.240", "10.1523/jneurosci.4825-12.2013", "10.1002/cne.23852", "10.2312/vcbm.20151213", "10.1111/cgf.12605", "10.1016/j.cag.2018.04.007", "10.1038/s41592-018-0049-4", "10.1007/s00371-015-1151-6", "10.1109/tvcg.2018.2864852", "10.1109/ic3d.2016.7823463", "10.3389/fncel.2019.00082", "10.1111/boc.201600024", "10.2312/vg/vg10/053-060", "10.1109/tvcg.2013.142", "10.1371/journal.pone.0198131", "10.1111/cgf.12280", "10.1038/nature22356", "10.1109/tvcg.2015.2467441", "10.1016/j.neuron.2015.03.035", "10.2312/vcbm.20161276", "10.1016/j.neuroscience.2007.07.014", "10.1109/tvcg.2017.2744238", "10.1002/glia.23250", "10.3389/fncel.2018.00308", "10.1016/j.cell.2018.06.019", "10.1109/tvcg.2017.2744278", "10.1109/biovis.2013.6664349", "10.1179/000870403235002042"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2019.2934257", "title": "Toward Localized Topological Data Structures: Querying the Forest for the Tree", "year": "2019", "conferenceName": "SciVis", "authors": "Pavol Klacansky;Attila Gyulassy;Peer-Timo Bremer;Valerio Pascucci", "citationCount": "1", "affiliation": "Klacansky, P (Corresponding Author), Univ Utah, Sci Comp \\& Imaging Inst, Salt Lake City, UT 84112 USA. Klacansky, Pavol; Gyulassy, Attila; Pascucci, Valerio, Univ Utah, Sci Comp \\& Imaging Inst, Salt Lake City, UT 84112 USA. Bremer, Peer-Timo, Lawrence Livermore Natl Lab, Livermore, CA USA.", "countries": "USA", "abstract": "Topological approaches to data analysis can answer complex questions about the number, connectivity, and scale of intrinsic features in scalar data. However, the global nature of many topological structures makes their computation challenging at scale, and thus often limits the size of data that can be processed. One key quality to achieving scalability and performance on modern architectures is data locality, i.e., a process operates on data that resides in a nearby memory system, avoiding frequent jumps in data access patterns. From this perspective, topological computations are particularly challenging because the implied data structures represent features that can span the entire data set, often requiring a global traversal phase that limits their scalability. Traditionally, expensive preprocessing is considered an acceptable trade-off as it accelerates all subsequent queries. Most published use cases, however, explore only a fraction of all possible queries, most often those returning small, local features. In these cases, much of the global information is not utilized, yet computing it dominates the overall response time. We address this challenge for merge trees, one of the most commonly used topological structures. In particular, we propose an alternative representation, the merge forest, a collection of local trees corresponding to regions in a domain decomposition. Local trees are connected by a bridge set that allows us to recover any necessary global information at query time. The resulting system couples (i) a preprocessing that scales linearly in practice with (ii) fast runtime queries that provide the same functionality as traditional queries of a global merge tree. We test the scalability of our approach on a shared-memory parallel computer and demonstrate how data structure locality enables the analysis of large data with an order of magnitude performance improvement over the status quo. Furthermore, a merge forest reduces the memory overhead compared to a global merge tree and enables the processing of data sets that are an order of magnitude larger than possible with previous algorithms.", "keywords": "Merge tree,parallel computation,topology", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934257", "refList": ["10.1109/ldav.2017.8231846", "10.1145/276884.276892", "10.1090/mbk/069", "10.1007/s00454-002-2885-2", "10.1109/tvcg.2015.2452919", "10.1016/0956-0521(91)90014-v", "10.1145/262839.269238", "10.1145/364099.364331", "10.1016/j.comgeo.2006.05.009", "10.1109/ldav.2016.7874333", "10.1080/16864360.2017.1419648", "10.1016/s0925-7721(02)00093-7", "10.1145/2517327.2442526", "10.1109/tvcg.2017.2743938", "10.1016/j.proci.2014.05.147", "10.1109/tvcg.2010.253", "10.1103/physrevlett.113.155005", "10.1007/978-3-319-44684-420", "10.1109/ldav.2016.7874312", "10.1007/b106657\\_2", "10.1109/sc.2014.88", "10.1109/ldav.2015.7348066", "10.1007/978-3-319-04099-86", "10.1109/ldav.2012.6378962", "10.1109/pacificvis.2017.8031584", "10.2140/camcos.2016.11.37", "10.1016/j.combustflame.2014.08.021", "10.1109/tvcg.2006.22", "10.1007/pl00009159", "10.1007/s00453-003-1052-3", "10.1109/tvcg.2007.47", "10.1017/jfm.2015.268", "10.1007/s00454-017-9901-z", "10.1145/62.2160", "10.1145/2996913.2996952", "10.1145/1868237.1868249", "10.1145/77635.77639", "10.1016/j.comgeo.2004.05.002", "10.1088/1742-6596/180/1/012086", "10.1109/pacificvis.2015.7156387", "10.1109/tpds.2019.2898436", "10.1145/1463822.1463869", "10.1109/tvcg.2017.2744238", "10.1109/hipc.2012.6507496", "10.1109/tvcg.2006.162", "10.1017/s0022112004009681", "10.2307/2317380"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13700", "year": "2019", "title": "Interactive Volumetric Visual Analysis of Glycogen-derived Energy Absorption in Nanometric Brain Structures", "conferenceName": "EuroVis", "authors": "Marco Agus;Corrado Cal{\\`{\\i}};Ali K. Al{-}Awami;Enrico Gobbetti;Pierre J. Magistretti;Markus Hadwiger", "citationCount": "3", "affiliation": "Agus, M (Corresponding Author), KAUST, Thuwal, Saudi Arabia.\nAgus, M (Corresponding Author), VCC, Thuwal, Saudi Arabia.\nAgus, M (Corresponding Author), Ctr Adv Studies Res \\& Dev Sardinia CRS4, Visual Comp Grp, Cagliari, Italy.\nAgus, M.; Cali, C.; Al-Awami, A.; Magistretti, P.; Hadwiger, M., KAUST, Thuwal, Saudi Arabia.\nAgus, M.; Al-Awami, A.; Hadwiger, M., VCC, Thuwal, Saudi Arabia.\nCali, C.; Magistretti, P., BESE, Thuwal, Saudi Arabia.\nAgus, M.; Gobbetti, E., Ctr Adv Studies Res \\& Dev Sardinia CRS4, Visual Comp Grp, Cagliari, Italy.\nAl-Awami, A., Saudi Aramco \\& EXPEC Comp Ctr, Dharhan, Saudi Arabia.", "countries": "Italy;Arabia", "abstract": "Digital acquisition and processing techniques are changing the way neuroscience investigation is carried out. Emerging applications range from statistical analysis on image stacks to complex connectomics visual analysis tools targeted to develop and test hypotheses of brain development and activity. In this work, we focus on neuroenergetics, a field where neuroscientists analyze nanoscale brain morphology and relate energy consumption to glucose storage in form of glycogen granules. In order to facilitate the understanding of neuroenergetic mechanisms, we propose a novel customized pipeline for the visual analysis of nanometric-level reconstructions based on electron microscopy image data. Our framework supports analysis tasks by combining i) a scalable volume visualization architecture able to selectively render image stacks and corresponding labelled data, ii) a method for highlighting distance-based energy absorption probabilities in form of glow maps, and iii) a hybrid connectivitybased and absorption-based interactive layout representation able to support queries for selective analysis of areas of interest and potential activity within the segmented datasets. This working pipeline is currently used in a variety of studies in the neuroenergetics domain. Here, we discuss a test case in which the framework was successfully used by domain scientists for the analysis of aging effects on glycogen metabolism, extracting knowledge from a series of nanoscale brain stacks of rodents somatosensory cortex.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13700", "refList": ["10.1371/journal.pone.0038011", "10.1016/j.coisb.2017.07.011", "10.1145/234535.234538", "10.1109/tvcg.2018.2864847", "10.2312/conf/eg2012/stars/053-074", "10.3389/fnins.2018.00664", "10.1109/tpami.2018.2835450", "10.1109/tvcg.2014.2346312", "10.1109/tvcg.2009.121", "10.1002/glia.23020", "10.1117/1.jbo.18.5.050902", "10.1111/cgf.12927", "10.1038/nn.3837", "10.1109/isbi.2011.5872394", "10.3868/j.issn.2096-0689.2017.04.004", "10.1111/cgf.12792", "10.1016/j.neuroscience.2012.09.077", "10.1109/tvcg.2012.240", "10.1523/jneurosci.4825-12.2013", "10.1002/cne.23852", "10.2312/vcbm.20151213", "10.1111/cgf.12605", "10.1016/j.cag.2018.04.007", "10.1038/s41592-018-0049-4", "10.1007/s00371-015-1151-6", "10.1109/tvcg.2018.2864852", "10.1109/ic3d.2016.7823463", "10.3389/fncel.2019.00082", "10.1111/boc.201600024", "10.2312/vg/vg10/053-060", "10.1109/tvcg.2013.142", "10.1371/journal.pone.0198131", "10.1111/cgf.12280", "10.1038/nature22356", "10.1109/tvcg.2015.2467441", "10.1016/j.neuron.2015.03.035", "10.2312/vcbm.20161276", "10.1016/j.neuroscience.2007.07.014", "10.1109/tvcg.2017.2744238", "10.1002/glia.23250", "10.3389/fncel.2018.00308", "10.1016/j.cell.2018.06.019", "10.1109/tvcg.2017.2744278", "10.1109/biovis.2013.6664349", "10.1179/000870403235002042"], "wos": 1, "children": [], "len": 1}], "len": 9}], "len": 15}, "index": 456, "embedding": [0.08494289964437485, 0.9032419919967651, -1.0222129821777344, -1.4795129299163818, -0.630656361579895, 0.16650904715061188, -0.7150075435638428, 1.438258409500122, -0.4060705304145813, 0.6099424958229065, 0.05161124840378761, 0.26934120059013367, 0.10407781600952148, 0.23458082973957062, -0.660598874092102, 1.2228456735610962, 0.39926499128341675, 1.777032494544983, -0.6329802870750427, 1.1589953899383545, -0.06630208343267441, 1.0979650020599365, -0.7330083847045898, 1.2215912342071533, -2.458800792694092, 0.6377875208854675, -0.5019459128379822, 0.6366093158721924, 1.5788642168045044, -1.1703230142593384, -0.14383606612682343, 0.6078281998634338], "projection": [-0.3730791509151459, 8.035012245178223], "size": 8, "height": 4, "width": 4}