{"data": {"doi": "10.1109/tvcg.2015.2467831", "title": "Visual Mementos: Reflecting Memories with Personal Data", "year": "2015", "conferenceName": "InfoVis", "authors": "Alice Thudt;Dominikus Baur;Samuel Huron;Sheelagh Carpendale", "citationCount": "25", "affiliation": "Thudt, A (Corresponding Author), Univ Calgary, Calgary, AB T2N 1N4, Canada. Thudt, Alice; Huron, Samuel; Carpendale, Sheelagh, Univ Calgary, Calgary, AB T2N 1N4, Canada. Huron, Samuel, IRI, Chicago, IL USA.", "countries": "Canada;USA", "abstract": "In this paper we discuss the creation of visual mementos as a new application area for visualization. We define visual mementos as visualizations of personally relevant data for the purpose of reminiscing, and sharing of life experiences. Today more people collect digital information about their life than ever before. The shift from physical to digital archives poses new challenges and opportunities for self-reflection and self-representation. Drawing on research on autobiographical memory and on the role of artifacts in reminiscing, we identified design challenges for visual mementos: mapping data to evoke familiarity, expressing subjectivity, and obscuring sensitive details for sharing. Visual mementos can make use of the known strengths of visualization in revealing patterns to show the familiar instead of the unexpected, and extend representational mappings beyond the objective to include the more subjective. To understand whether people's subjective views on their past can be reflected in a visual representation, we developed, deployed and studied a technology probe that exemplifies our concept of visual mementos. Our results show how reminiscing has been supported and reveal promising new directions for self-reflection and sharing through visual mementos of personal experiences.", "keywords": "Visual Memento, Memories, Personal Visualization, Movement Data, World Wide Web", "link": "http://dx.doi.org/10.1109/TVCG.2015.2467831", "refList": ["10.1016/j.ijhcs.2013.09.009", "10.1111/1467-9280.00087", "10.1145/1409635.1409685", "10.1017/s0144686x98006862", "10.1086/448619", "10.1007/s00779-007-0177-9", "10.1177/1473871611413180", "10.1109/tvcg.2007.70541", "10.1109/tvcg.2010.206", "10.1177/1354067x02008001618", "10.1037//0033-295x.107.2.261", "10.1145/2207676.2207723", "10.1145/1735223.1735243", "10.1145/2556288.2557372", "10.1145/2598510.2598577", "10.1145/587078.587102", "10.1145/2207676.2208600", "10.1016/j.ijhcs.2009.09.007", "10.1145/1240624.1240636", "10.1145/2254556.2254645", "10.1145/1345448.1345455", "10.1007/s00779-009-0279-7", "10.1109/tvcg.2014.2352953", "10.1109/tvcg.2011.279", "10.1145/2598510.2598579", "10.1145/2598510.2598558", "10.1145/2390034.2390039", "10.1007/978-0-85729-247-6", "10.1007/s00779-006-0090-7", "10.1162/leon\\_a\\_00011", "10.1145/2207676", "10.1007/s10902-005-3889-4", "10.1016/j.ijhcs.2010.12.004", "10.1145/1240624.1240789", "10.1145/1107458.1107489", "10.1145/2047196.2047206", "10.1145/2470654.2466215", "10.1007/s00779-003-0220-4", "10.1145/1517664.1517678", "10.1109/tvcg.2014.2359887"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934804", "title": "Construct-A-Vis: Exploring the Free-Form Visualization Processes of Children", "year": "2019", "conferenceName": "InfoVis", "authors": "Fearn Bishop;Johannes Zagermann;Ulrike Pfeil;Gemma Sanderson;Harald Reiterer;Uta Hinrichs", "citationCount": "1", "affiliation": "Bishop, F (Corresponding Author), Univ St Andrews, St Andrews, Fife, Scotland. Bishop, Fearn; Hinrichs, Uta, Univ St Andrews, St Andrews, Fife, Scotland. Zagermann, Johannes; Pfeil, Ulrike; Reiterer, Harald, Univ Konstanz, Constance, Germany. Sanderson, Gemma, Fife Council, Glenrothes, Scotland.", "countries": "Scotland;Germany", "abstract": "Building data analysis skills is part of modern elementary school curricula. Recent research has explored how to facilitate children's understanding of visual data representations through completion exercises which highlight links between concrete and abstract mappings. This approach scaffolds visualization activities by presenting a target visualization to children. But how can we engage children in more free-form visual data mapping exercises that are driven by their own mapping ideas? How can we scaffold a creative exploration of visualization techniques and mapping possibilities? We present Construct-A-Vis, a tablet-based tool designed to explore the feasibility of free-form and constructive visualization activities with elementary school children. Construct-A-Vis provides adjustable levels of scaffolding visual mapping processes. It can be used by children individually or as part of collaborative activities. Findings from a study with elementary school children using Construct-A-Vis individually and in pairs highlight the potential of this free-form constructive approach, as visible in children's diverse visualization outcomes and their critical engagement with the data and mapping processes. Based on our study findings we contribute insights into the design of free-form visualization tools for children, including the role of tool-based scaffolding mechanisms and shared interactions to guide visualization activities with children.", "keywords": "Visualization in Education,Visualization with Children,Qualitative Evaluation,Visualization System and Toolkit Design", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934804", "refList": ["10.1109/tvcg.2011.287", "10.1145/2858036.2858435", "10.2312/pe.eurovisshort.eurovisshort2013.019-023", "10.1145/2998181.2998231", "10.1109/tvcg.2014.2346984", "10.1145/3025453.3025942", "10.1145/3173574.3174212", "10.1002/j.2168-9830.2004.tb00809.x", "10.1145/2669485.2669500", "10.1109/mcg.2018.032421650", "10.1111/j.1469-7610.1976.tb00381.x", "10.1109/tvcg.2014.2346292", "10.1145/2598784.2598806", "10.1145/2598510.2598566", "10.1145/234757.234765", "10.1016/j.compedu.2009.09.023", "10.1145/2485760.2485814", "10.1145/2207676.2208355", "10.1007/978-3-319-19773-9\\_130", "10.1145/2207676", "10.1016/j.sbspro.2011.12.091", "10.1109/tvcg.2010.164", "10.1145/1592761.1592779", "10.1145/3025453.3025537", "10.1109/tvcg.2015.2467831", "10.1007/s10648-014-9249-3", "10.1145/3025453.3025877"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030412", "title": "Sea of Genes: A Reflection on Visualising Metagenomic Data for Museums", "year": "2020", "conferenceName": "SciVis", "authors": "Keshav Dasu;Kwan-Liu Ma;Joyce Ma;Jennifer Frazier", "citationCount": "0", "affiliation": "Dasu, K (Corresponding Author), Univ Calif Davis, Davis, CA 95616 USA. Dasu, Keshav; Ma, Kwan-Liu, Univ Calif Davis, Davis, CA 95616 USA. Ma, Joyce; Frazier, Jennifer, Exploratorium, San Francisco, CA 94100 USA.", "countries": "USA", "abstract": "We examine the process of designing an exhibit to communicate scientific findings from a complex dataset and unfamiliar domain to the public in a science museum. Our exhibit sought to communicate new lessons based on scientific findings from the domain of metagenomics. This multi-user exhibit had three goals: (1) to inform the public about microbial communities and their daily cycles; (2) to link microbes' activity to the concept of gene expression; (3) and to highlight scientists' use of gene expression data to understand the role of microbes. To address these three goals, we derived visualization designs with three corresponding stories, each corresponding to a goal. We present three successive rounds of design and evaluation of our attempts to convey these goals. We could successfully present one story but had limited success with our second and third goals. This work presents a detailed account of an attempt to explain tightly coupled relationships through storytelling and animation in a multi-user, informal learning environment to a public with varying prior knowledge on the domain and identify lessons for future design.", "keywords": "Narrative visualization,storytelling,animation,evaluation,user studies,informal learning environments", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030412", "refList": ["10.1007/978-1-4471-6596-5", "10.1037/a0025595", "10.3389/fpsyg.2014.00283", "10.1145/2658537.2662985", "10.1177/1473871615594652", "10.28945/4441", "10.9743/jir.2013.6", "10.1145/2559206.2580098", "10.1007/s40593-015-0070-z", "10.1016/j.biopsycho.2015.01.008", "10.1145/3341215.3356283", "10.1348/000709906x143902", "10.1111/j.1467-8624.2011.01603.x", "10.2505/4/jcst15\\_", "10.1371/journal.pone.0082328", "10.1109/tvcg.2014.2346984", "10.4324/9781315735634", "10.1037/0022-3514.62.4.625", "10.1111/j.1467-8535.2012.01326.x", "10.1109/infvis.2005.1532136", "10.1177/1555412005281767", "10.1080/08839510590910165", "10.1109/mcg.2018.032421650", "10.1109/tvcg.2014.2346292", "10.1145/960492.960494", "10.1007/978-1-4471-6596-55", "10.1145/2598784.2598806", "10.1108/10748120110424816", "10.1145/2598510.2598566", "10.1073/pnas.1807180116", "10.1109/tvcg.2019.2934804", "10.1016/j.compedu.2015.04.001", "10.1111/j.1467-8535.2009.009695.x", "10.1080/00933104.2017.1400483", "10.1017/s1351324901002807", "10.1177/0963662514549688", "10.1111/cdev.12287", "10.1111/j.1468-2958.2004.tb00736.x", "10.1111/j.1365-2929.2004.01916.x", "10.1111/1467-8535.00121", "10.1145/3025453.3025877", "10.2190/119m-brmu-j8hc-xm6f"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2019.2934283", "title": "What is Interaction for Data Visualization?", "year": "2019", "conferenceName": "InfoVis", "authors": "Evanthia Dimara;Charles Perin", "citationCount": "1", "affiliation": "Dimara, E (Corresponding Author), Sorbonne Univ, Paris, France. Dimara, Evanthia, Sorbonne Univ, Paris, France. Perin, Charles, Univ Victoria, Victoria, BC, Canada.", "countries": "Canada;France", "abstract": "Interaction is fundamental to data visualization, but what “interaction” means in the context of visualization is ambiguous and confusing. We argue that this confusion is due to a lack of consensual definition. To tackle this problem, we start by synthesizing an inclusive view of interaction in the visualization community – including insights from information visualization, visual analytics and scientific visualization, as well as the input of both senior and junior visualization researchers. Once this view takes shape, we look at how interaction is defined in the field of human-computer interaction (HCI). By extracting commonalities and differences between the views of interaction in visualization and in HCI, we synthesize a definition of interaction for visualization. Our definition is meant to be a thinking tool and inspire novel and bolder interaction design practices. We hope that by better understanding what interaction in visualization is and what it can be, we will enrich the quality of interaction in visualization systems and empower those who use them.", "keywords": "interaction,visualization,data,definition,human-computer interaction", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934283", "refList": ["10.1057/ivs.2009.22", "10.1515/icom-2017-0027", "10.1145/2493102.2493104", "10.1007/978-3-319-06793-3\\_6", "10.1080/03640210801898177", "10.1109/mcg.2010.30", "10.1109/tvcg.2013.134", "10.1109/tvcg.2017.2745958", "10.1109/tvcg.2018.2865237", "10.1109/2945.981847", "10.1145/2598784.2598806", "10.1109/tvcg.2013.130", "10.1109/tvcg.2007.70577", "10.1109/mic.2015.129", "10.1145/2909132.2909267", "10.1080/01449290500330331", "10.1109/tvcg.2018.2865233", "10.1109/tvcg.2015.2467831", "10.1109/iv.2015.34", "10.1109/tvcg.2009.111", "10.1145/3290605.3300565", "10.1145/3173574.3173797", "10.1145/948496.948514", "10.1145/3025453.3025765", "10.1109/tvcg.2015.2467613", "10.1145/2659796", "10.1109/tvcg.2014.2346311", "10.1145/3025453.3025524", "10.1080/17452759.2011.558588", "10.1145/3027063.3053113", "10.1109/infvis.2005.1532136", "10.1145/2470654.2481307", "10.1109/tvcg.2018.2864913", "10.1145/345513.345267", "10.3102/00028312005004437", "10.1109/tvcg.2007.70436", "10.1037/0033-295x.106.4.643", "10.1145/2133416.2146416", "10.1109/tvcg.2013.191", "10.1109/tvcg.2010.177", "10.1145/960201.957206", "10.1109/tvcg.2007.70515", "10.1109/infvis.2000.885092", "10.1145/2636240.2636844", "10.1037/h0055392", "10.1177/1473871611413180", "10.1109/vl.1996.545307", "10.1111/j.1471-1842.2009.00848.x", "10.1145/989863.989865", "10.1109/tvcg.2013.124", "10.1109/tvcg.2008.109", "10.1145/1166253.1166265", "10.1145/2702123.2702180", "10.1109/tvcg.2016.2598620", "10.1080/07370024.2016.1226139", "10.1145/3173574.3173909", "10.1109/pacificvis.2010.5429613", "10.1111/j.1467-6478.2006.00368.x", "10.1109/tvcg.2012.204", "10.1109/tvcg.2013.120", "10.1179/1743277412y.0000000019", "10.1145/1936652.1936684", "10.2307/1269768", "10.1109/infvis.1996.559213", "10.1109/tvcg.2016.2598839", "10.1145/2642918.2647360", "10.1057/palgrave.ivs.9500099", "10.1016/j.cag.2009.06.004", "10.1109/mc.2013.178", "10.1109/tvcg.2007.70541", "10.1109/vast.2011.6102473", "10.1145/358886.358895", "10.1109/tvcg.2014.2346573", "10.1109/tvcg.2018.2865159", "10.1145/2207676.2207741", "10.1109/tvcg.2015.2396062", "10.1145/2207676.2208572", "10.1109/tvcg.2016.2598608", "10.1057/ivs.2008.31", "10.1177/001316446002000104", "10.1109/tvcg.2017.2680452", "10.1109/tvcg.2006.80", "10.1145/2598510.2598566", "10.1037/0003-066x.51.4.355", "10.7146/dpb.v16i224.7586", "10.1109/infvis.1998.729560", "10.1162/leon\\_a\\_00011", "10.1109/tvcg.2010.157", "10.1109/tvcg.2014.2359887"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13447", "year": "2018", "title": "State of the Art of Sports Data Visualization", "conferenceName": "EuroVis", "authors": "Charles Perin;Romain Vuillemot;Charles D. Stolper;John T. Stasko;Jo Wood;Sheelagh Carpendale", "citationCount": "11", "affiliation": "Perin, C (Corresponding Author), City Univ London, Dept Comp Sci, London, England.\nPerin, C (Corresponding Author), Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nPerin, C.; Wood, J., City Univ London, Dept Comp Sci, London, England.\nPerin, C.; Carpendale, S., Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nVuillemot, R., Univ Lyon, Ecole Cent Lyon, Lyon, France.\nStolper, C. D., Southwestern Univ, Dept Math \\& Comp Sci, Georgetown, TX USA.\nStasko, J. T., Georgia Inst Technol, Sch Interact Comp, Atlanta, GA 30332 USA.", "countries": "Canada;USA;England;France", "abstract": "In this report, we organize and reflect on recent advances and challenges in the field of sports data visualization. The exponentially-growing body of visualization research based on sports data is a prime indication of the importance and timeliness of this report. Sports data visualization research encompasses the breadth of visualization tasks and goals: exploring the design of new visualization techniques; adapting existing visualizations to a novel domain; and conducting design studies and evaluations in close collaboration with experts, including practitioners, enthusiasts, and journalists. Frequently this research has impact beyond sports in both academia and in industry because it is i) grounded in realistic, highly heterogeneous data, ii) applied to real-world problems, and iii) designed in close collaboration with domain experts. In this report, we analyze current research contributions through the lens of three categories of sports data: box score data (data containing statistical summaries of a sport event such as a game), tracking data (data about in-game actions and trajectories), and meta-data (data about the sport and its participants but not necessarily a given game). We conclude this report with a high-level discussion of sports visualization research informed by our analysisidentifying critical research gaps and valuable opportunities for the visualization community. More information is available at the STAR's website: .", "keywords": "", "link": "https://doi.org/10.1111/cgf.13447", "refList": ["10.1145/3054132", "10.1214/14-aoas799", "10.1145/2556288.2557379", "10.1109/icdmw.2014.167", "10.1109/tvcg.2017.2745181", "10.1145/2493432.2493518", "10.1109/38.595272", "10.1080/15265161.2016.1251633", "10.1111/j.1467-8659.2012.03118.x", "10.3390/data2010002", "10.1145/2702123.2702237", "10.1109/mcg.2016.90", "10.1007/s10618-017-0513-2", "10.1016/j.cag.2017.08.006", "10.1109/tvcg.2013.192", "10.1145/2702123.2702213", "10.1109/tvcg.2017.2744218", "10.1109/visual.2001.964496", "10.1186/s13661-016-0718-0", "10.1109/isai.2016.0010", "10.1109/mcg.2016.124", "10.1109/mcg.2016.100", "10.1109/tmm.2016.2614221", "10.1145/2556288.2557144", "10.1109/mcg.2016.101", "10.1109/tvcg.2013.210", "10.1109/mcg.2015.25", "10.1109/tvcg.2007.70537", "10.1145/3105576", "10.1080/026404102320675675", "10.1108/oir-02-2015-0067", "10.1109/isai.2016.59", "10.1109/iv.2011.57", "10.1111/cgf.13189", "10.1109/tvcg.2014.2352953", "10.1109/mcg.2015.71", "10.1109/tvcg.2012.263", "10.1016/j.trc.2014.03.007", "10.1109/vast.2014.7042477", "10.1109/vast.2014.7042478", "10.1145/2909132.2909267", "10.1177/1473871613511959", "10.1109/tvcg.2012.213", "10.3390/ijgi4042159", "10.2519/jospt.2010.3166", "10.1109/tvcg.2015.2467831", "10.1109/mcg.2016.102", "10.1075/idj.23.1.07thu", "10.1109/cgiv.2006.85", "10.1145/2540930.2540970", "10.1371/journal.pone.0010937", "10.1109/tvcg.2014.2346445", "10.1109/tvcg.2014.2359887"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934630", "title": "Tac-Simur: Tactic-based Simulative Visual Analytics of Table Tennis", "year": "2019", "conferenceName": "VAST", "authors": "Jiachen Wang;Kejian Zhao;Dazhen Deng;Anqi Cao;Xiao Xie;Zheng Zhou;Hui Zhang;Yingcai Wu", "citationCount": "3", "affiliation": "Wang, JC (Corresponding Author), Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Zhejiang, Peoples R China. Wang, Jiachen; Zhao, Kejian; Deng, Dazhen; Cao, Anqi; Xie, Xiao; Wu, Yingcai, Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Zhejiang, Peoples R China. Zhou, Zheng; Zhang, Hui, Zhejiang Univ, Dept Sport Sci, Hangzhou, Zhejiang, Peoples R China.", "countries": "China", "abstract": "Simulative analysis in competitive sports can provide prospective insights, which can help improve the performance of players in future matches. However, adequately simulating the complex competition process and effectively explaining the simulation result to domain experts are typically challenging. This work presents a design study to address these challenges in table tennis. We propose a well-established hybrid second-order Markov chain model to characterize and simulate the competition process in table tennis. Compared with existing methods, our approach is the first to support the effective simulation of tactics, which represent high-level competition strategies in table tennis. Furthermore, we introduce a visual analytics system called Tac-Simur based on the proposed model for simulative visual analytics. Tac-Simur enables users to easily navigate different players and their tactics based on their respective performance in matches to identify the player and the tactics of interest for further analysis. Then, users can utilize the system to interactively explore diverse simulation tasks and visually explain the simulation results. The effectiveness and usefulness of this work are demonstrated by two case studies, in which domain experts utilize Tac-Simur to find interesting and valuable insights. The domain experts also provide positive feedback on the usability of Tac-Simur. Our work can be extended to other similar sports such as tennis and badminton.", "keywords": "Simulative Visual Analytics,Table Tennis,Design Study", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934630", "refList": ["10.1140/epjds29", "10.1002/nav.20017", "10.1016/j.eswa.2015.09.004", "10.1145/3200491", "10.1111/j.1467-8659.2012.03118.x", "10.1145/2939672.2939764", "10.1109/tvcg.2013.192", "10.1109/tvcg.2017.2744218", "10.1515/ijcss-2016-0002", "10.1109/icdm.2015.26", "10.1145/2362383.2362387", "10.1007/s12650-018-0521-3", "10.1109/mcg.2016.124", "10.1109/tmm.2016.2614221", "10.1007/s12650-015-0337-3", "10.1080/02640414.2013.805885", "10.1109/mcg.2016.101", "10.1111/cgf.13210", "10.16829/j.slxb.201702001", "10.1155/2013/409539", "10.1080/02640414.2013.792948", "10.1109/tvcg.2012.263", "10.1109/tvcg.2018.2865041", "10.1109/vast.2014.7042478", "10.1515/hukin-2017-0002", "10.1145/2783258.2788598", "10.2312/eurovisshort.20151137", "10.1111/cgf.13447", "10.1145/3097983.3098045", "10.1111/j.2517-6161.1985.tb01383.x", "10.1109/mmul.2012.54", "10.1515/1559-0410.1416", "10.1111/cgf.13436", "10.1260/1747-9541.5.2.205", "10.1080/02640414.2018.1450073", "10.1109/tvcg.2014.2346445", "10.1109/tvcg.2016.2598432"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3028958", "title": "Auditing the Sensitivity of Graph-based Ranking with Visual Analytics", "year": "2020", "conferenceName": "VAST", "authors": "Tiankai Xie;Yuxin Ma;Hanghang Tong;My T. Thai;Ross Maciejewski", "citationCount": "0", "affiliation": "Xie, TK (Corresponding Author), Arizona State Univ, Tempe, AZ 85287 USA. Xie, Tiankai; Ma, Yuxin; Maciejewski, Ross, Arizona State Univ, Tempe, AZ 85287 USA. Tong, Hanghang, Univ Illinois, Urbana, IL USA. Thai, My T., Univ Florida, Gainesville, FL 32611 USA.", "countries": "USA", "abstract": "Graph mining plays a pivotal role across a number of disciplines, and a variety of algorithms have been developed to answer who/what type questions. For example, what items shall we recommend to a given user on an e-commerce platform? The answers to such questions are typically returned in the form of a ranked list, and graph-based ranking methods are widely used in industrial information retrieval settings. However, these ranking algorithms have a variety of sensitivities, and even small changes in rank can lead to vast reductions in product sales and page hits. As such, there is a need for tools and methods that can help model developers and analysts explore the sensitivities of graph ranking algorithms with respect to perturbations within the graph structure. In this paper, we present a visual analytics framework for explaining and exploring the sensitivity of any graph-based ranking algorithm by performing perturbation-based what-if analysis. We demonstrate our framework through three case studies inspecting the sensitivity of two classic graph-based ranking algorithms (PageRank and HITS) as applied to rankings in political news media and social networks.", "keywords": "Graph-based ranking,sensitivity analysis,visual analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028958", "refList": ["10.1109/wsc.2017.8247800", "10.1023/a:1022649401552", "10.1515/1559-0410.11416", "10.1109/tvcg.2016.2598919", "10.1177/1473871611416549", "10.1109/tvcg.2019.2934630", "10.1140/epjds29", "10.1109/tvcg.2019.2934670", "10.1016/j.eswa.2015.09.004", "10.1145/2702123.2702509", "10.1016/j.visinf.2018.12.001", "10.2307/3002000", "10.1109/tvcg.2019.2934399", "10.1007/s41060-016-0032-z", "10.1111/cgf.13198", "10.14778/2350229.2350254", "10.1145/2939672.2939764", "10.1016/j.visinf.2017.01.006", "10.1145/2858036.2858529", "10.1109/vast.2017.8585647", "10.1007/bf01187020", "10.1109/icdm.2015.26", "10.1145/2362383.2362387", "10.1177/0049124104268644", "10.1109/vast.2011.6102442", "10.1109/infvis.2003.1249025", "10.1109/tvcg.2018.2864475", "10.1109/tvcg.2007.70528", "10.1109/tvcg.2015.2467691", "10.1111/cgf.13210", "10.1214/aos/1176344136", "10.1109/tvcg.2015.2424872", "10.1016/j.visinf.2018.09.001", "10.1177/089443939100900106", "10.1109/tvcg.2015.2467931", "10.1162/neco.1997.9.8.1735", "10.1007/s11162-011-9241-4", "10.1111/cgf.13680", "10.1145/3065386", "10.1109/tvcg.2018.2864889", "10.1177/003804070808100402", "10.1109/icdm.2010.62", "10.1038/s41598-020-59669-x", "10.1162/153244303321897717", "10.1109/tvcg.2019.2934619", "10.1007/bf00356088", "10.1109/tvcg.2016.2598432", "10.1109/tvcg.2016.2598831"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030358", "title": "Once Upon A Time In Visualization: Understanding the Use of Textual Narratives for Causality", "year": "2020", "conferenceName": "VAST", "authors": "Arjun Choudhry;Mandar Sharma;Pramod Chundury;Thomas Kapler;Derek W. S. Gray;Naren Ramakrishnan;Niklas Elmqvist", "citationCount": "0", "affiliation": "Choudhry, A (Corresponding Author), Virginia Tech, Arlington, VA 24061 USA. Choudhry, Arjun; Sharma, Mandar; Ramakrishnan, Naren, Virginia Tech, Arlington, VA 24061 USA. Chundury, Pramod; Elmqvist, Niklas, Univ Maryland, College Pk, MD 20742 USA. Kapler, Thomas; Gray, Derek W. S., Uncharted Software, Toronto, ON, Canada.", "countries": "Canada;USA", "abstract": "Causality visualization can help people understand temporal chains of events, such as messages sent in a distributed system, cause and effect in a historical conflict, or the interplay between political actors over time. However, as the scale and complexity of these event sequences grows, even these visualizations can become overwhelming to use. In this paper, we propose the use of textual narratives as a data-driven storytelling method to augment causality visualization. We first propose a design space for how textual narratives can be used to describe causal data. We then present results from a crowdsourced user study where participants were asked to recover causality information from two causality visualizations-causal graphs and Hasse diagrams-with and without an associated textual narrative. Finally, we describe Causeworks, a causality visualization system for understanding how specific interventions influence a causal model. The system incorporates an automatic textual narrative mechanism based on our design space. We validate Causeworks through interviews with experts who used the system for understanding complex events.", "keywords": "Causality visualization,natural language generation,data-driven storytelling,temporal data,quantitative studies", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030358", "refList": ["10.1371/journal.pone.0171156", "10.1007/s11424-013-2290-3", "10.1109/tvcg.2019.2934630", "10.1515/hukin-2015-0013", "10.1109/tvcg.2017.2745181", "10.1111/j.1467-8659.2012.03118.x", "10.1007/s10618-017-0513-2", "10.1371/journal.pone.0029638", "10.1016/j.visinf.2019.10.002", "10.1109/tvcg.2013.192", "10.1109/tvcg.2017.2744218", "10.1590/s1980-65742014000300004", "10.1186/1471-2105-16-s13-s8", "10.1109/mcg.2016.124", "10.1109/tmm.2016.2614221", "10.1145/3219819.3219832", "10.1007/s11424-013-2291-2", "10.1198/016214506000000302", "10.1109/tvcg.2019.2934243", "10.1109/iv.2011.57", "10.1111/cgf.13189", "10.1109/tvcg.2018.2865041", "10.1109/vast.2014.7042477", "10.1177/1473871613511959", "10.1109/iv.2010.39", "10.3390/ijgi4042159", "10.1111/cgf.13436", "10.1016/j.visinf.2017.01.005", "10.1109/tvcg.2014.2346445"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13965", "year": "2020", "title": "Bombalytics: Visualization of Competition and Collaboration Strategies of Players in a Bomb Laying Game", "conferenceName": "EuroVis", "authors": "Shivam Agarwal;G{\\\"{u}}nter Wallner;Fabian Beck", "citationCount": "0", "affiliation": "Agarwal, S (Corresponding Author), Univ Duisburg Essen, Duisburg, Germany.\nAgarwal, Shivam; Beck, Fabian, Univ Duisburg Essen, Duisburg, Germany.\nWallner, Gunter, Eindhoven Univ Technol, Eindhoven, Netherlands.\nWallner, Gunter, Univ Appl Arts Vienna, Vienna, Austria.", "countries": "Germany;Austria;Netherlands", "abstract": "Competition and collaboration form complex interaction patterns between the agents and objects involved. Only by understanding these interaction patterns, we can reveal the strategies the participating parties applied. In this paper, we study such competition and collaboration behavior for a computer game. Serving as a testbed for artificial intelligence, the multiplayer bomb laying game Pommerman provides a rich source of advanced behavior of computer agents. We propose a visualization approach that shows an overview of multiple games, with a detailed timeline-based visualization for exploring the specifics of each game. Since an analyst can only fully understand the data when considering the direct and indirect interactions between agents, we suggest various visual encodings of these interactions. Based on feedback from expert users and an application example, we demonstrate that the approach helps identify central competition strategies and provides insights on collaboration.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13965", "refList": ["10.1145/1822348.1822349", "10.1016/j.cag.2013.11.010", "10.1145/2793107.2793112", "10.1109/tvcg.2019.2934630", "10.1145/3343055.3360747", "10.1016/j.intcom.2010.04.004", "10.1109/cig.2019.8848091", "10.1007/s11554-013-0347-0", "10.1007/s12650-019-00566-5", "10.1109/bigdata.2018.8622571", "10.1007/978-3-319-63519-4", "10.1109/tciaig.2014.2365470", "10.1016/j.entcom.2013.02.002", "10.1609/aimag.v34i3.2492", "10.1145/3311350.3357716", "10.1109/tvcg.2018.2864885", "10.1177/1473871617718377", "10.1109/tvcg.2018.2864504", "10.1111/cgf.12919", "10.1109/tvcg.2019.2934243", "10.1109/tvcg.2018.2859969", "10.1145/3235765.3235812", "10.1109/tvcg.2017.2745320", "10.1109/tvcg.2016.2598415", "10.1109/tciaig.2012.2188528", "10.1109/iscas.2019.8702471", "10.2307/350902", "10.1109/mc.2018.2890217", "10.1145/3027063.3053146", "10.1111/cgf.13436", "10.1145/3130859.3131439", "10.1016/j.compedu.2011.11.015"], "wos": 1, "children": [], "len": 1}], "len": 7}, {"doi": "10.1111/cgf.14031", "year": "2020", "title": "The State of the Art in Map-Like Visualization", "conferenceName": "EuroVis", "authors": "Marius Hogr{\\\"{a}}fer;Magnus Heitzler;Hans{-}J{\\\"{o}}rg Schulz", "citationCount": "0", "affiliation": "Hografer, M (Corresponding Author), Aarhus Univ, Dept Comp Sci, Aarhus, Denmark.\nHografer, Marius; Schulz, Hans-Jorg, Aarhus Univ, Dept Comp Sci, Aarhus, Denmark.\nHeitzler, Magnus, Swiss Fed Inst Technol, Inst Cartog \\& Geoinformat, Zurich, Switzerland.", "countries": "Switzerland;Denmark", "abstract": "Cartographic maps have been shown to provide cognitive benefits when interpreting data in relation to a geographic location. In visualization, the term map-like describes techniques that incorporate characteristics of cartographic maps in their representation of abstract data. However, the field of map-like visualization is vast and currently lacks a clear classification of the existing techniques. Moreover, choosing the right technique to support a particular visualization task is further complicated, as techniques are scattered across different domains, with each considering different characteristics as map-like. In this paper, we give an overview of the literature on map-like visualization and provide a hierarchical classification of existing techniques along two general perspectives: imitation and schematization of cartographic maps. Each perspective is further divided into four principal categories that group common map-like techniques along the visual primitives they affect. We further discuss this classification from a task-centered view and highlight open research questions.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14031", "refList": ["10.1111/j.0020-2754.1998.00269.x.21", "10.1109/iv.2005.26", "10.2307/2980460", "10.1109/tvcg.2017.2743959", "10.1016/j.jvlc.2011.11.004", "10.1145/2501988.2502046", "10.1559/1523040042742402", "10.1007/s00779-011-0500-3", "10.1111/cgf.12932", "10.1109/tvcg.2010.89", "10.1111/cgf.13200", "10.1080/15230406.2016.1160797", "10.1179/000870410x12825500202896", "10.1109/tvcg.2007.70596", "10.5167/80972.19uzh-80972", "10.1007/978-3-319-11593-1\\_2", "10.1037/aca0000175", "10.1080/17538947.2014.923942", "10.1109/tvcg.2015.2467321", "10.1109/vissof.2005.1684299", "10.1559/152304098782383034", "10.1007/978-3-642-36763-2\\_38", "10.1109/tvcg.2013.130", "10.1109/tvcg.2014.2346274", "10.1111/cgf.12648", "10.1111/0004-5608.00242", "10.1177/1473871617724212", "10.1109/iv.2004.1320123", "10.1371/journal.pcbi.1006907", "10.1109/tvcg.2016.2599030", "10.1559/1523040042742411", "10.3390/informatics5030031", "10.1111/cgf.13079", "10.1109/tvcg.2015.2467811", "10.1016/j.tics.2003.12.004", "10.1007/s00799-016-0168-4", "10.1109/infvis.2004.57", "10.1007/s10021-007-9038-7", "10.1109/pacificvis.2015.7156366", "10.1007/978-3-319-27261-0\\_1", "10.1007/978-1-4471-2804-5\\_6", "10.1109/access.2019.2939977", "10.1109/tvcg.2017.2747545", "10.1109/icdm.2003.1250978", "10.1111/cgf.13167", "10.1016/0010-0285(78)90006-3", "10.3138/nj8v-8514-871t-221k", "10.1016/j.cag.2009.06.002", "10.1111/j.1467-8659.2011.01937.x", "10.1016/b978-044451020-4/50035-9", "10.1111/1467-8659.00566", "10.5220/0006618101080119", "10.1109/pacificvis.2012.6183571", "10.1145/2038558.2038579", "10.1109/tvcg.2010.191", "10.1111/j.0033-0124.1985.00075.x", "10.1109/tvcg.2004.1260761", "10.1007/978-3-642-34848-8\\_6", "10.1145/2968220.2968239", "10.1145/3002151.3002160", "10.1109/tst.2013.6509098", "10.1109/tvcg.2013.91", "10.1177/1473871615597077", "10.1016/j.jvlc.2011.02.001", "10.1080/17445647.2014.935502", "10.1177/1687814017740710", "10.1111/1744-7917.12601", "10.1073/pnas.0400280101", "10.1111/cgf.13672", "10.1109/mcg.2006.90", "10.1002/asi.21712", "10.1007/978-3-642-33024-7\\_3", "10.1145/2801040.2801056", "10.1109/mcg.2010.101", "10.1179/003962607x165041", "10.1057/palgrave.ivs.9500039", "10.1109/vast.2016.7883510", "10.1559/152304009788988288", "10.1080/23729333.2017.1301346", "10.1109/tvcg.2013.66", "10.1111/j.1467-8659.2012.03085.x", "10.1109/tvcg.2011.288", "10.3390/ijgi9040253", "10.1109/infvis.2005.1532150", "10.1145/2254556.2254636", "10.20382//jocg.v4i1a9", "10.1016/0010-0285(81)90016-5", "10.1145/2556288.2557224", "10.1109/iv.2001.942043", "10.1021/ed1000203", "10.1016/0169-7439(87)80084-9", "10.1109/tvcg.2010.154", "10.1016/j.jvlc.2015.10.003", "10.1109/tvcg.2019.2903945", "10.1109/tvcg.2013.120", "10.1109/tvcg.2019.2934263", "10.1146/annurev-ecolsys-102209-144718", "10.1109/tvcg.2008.165", "10.3138/a477-3202-7876-n514", "10.1080/23729333.2017.1288535", "10.1111/j.0020-2754.1998.00269.x", "10.1109/mcg.2004.41", "10.1109/vast.2009.5332593", "10.1002/smr.414", "10.1007/s12650-019-00584-3", "10.1145/22949.22950", "10.1179/1743277413y.0000000036", "10.1080/15230406.2016.1262280", "10.1016/s0341-8162(01)00164-3", "10.22224/gistbok/2017.3.8", "10.1109/tvcg.2008.155", "10.1057/ivs.2008.31", "10.1016/j.cag.2004.03.012", "10.1179/1743277412y.0000000007", "10.1016/j.soncn.2011.02.001", "10.1179/caj.1987.24.1.27", "10.3138/carto.48.3.1691", "10.5220/0004267205150524", "10.1109/38.974518", "10.1145/102377.115768", "10.1057/palgrave.ivs.9500186", "10.1109/5.58325", "10.5167/80972.uzh-80972", "10.1177/030913339602000204", "10.1007/978-3-642-22300-6\\_14", "10.1109/iv.2004.1320189", "10.1111/cgf.13447", "10.1007/s11192-017-2596-3", "10.1559/1523040053722150", "10.1007/978-3-662-45803-7\\_34"], "wos": 1, "children": [], "len": 1}], "len": 11}], "len": 19}, "index": 502, "embedding": [0.8869255185127258, 1.2250018119812012, -1.0366979837417603, -2.298758029937744, -0.5042189359664917, 0.16650904715061188, -0.6933266520500183, 1.0145421028137207, 0.19393634796142578, 0.6291691660881042, 0.3110988438129425, 0.7243128418922424, 0.924116849899292, 0.5421603918075562, -0.9044764637947083, 1.3603181838989258, 1.5524250268936157, 0.3883950114250183, -0.2556331157684326, 2.1131536960601807, -0.06630208343267441, -0.16625623404979706, -0.48022186756134033, 1.8761959075927734, -2.388123035430908, 1.1509603261947632, -0.561912477016449, 1.3624756336212158, 1.723535418510437, -1.6402090787887573, 0.6028703451156616, 1.0430407524108887], "projection": [0.371787428855896, 8.41763973236084], "size": 10, "height": 4, "width": 3}