{"data": {"doi": "10.1109/tvcg.2015.2467961", "title": "Occlusion-free Blood Flow Animation with Wall Thickness Visualization", "year": "2015", "conferenceName": "SciVis", "authors": "Kai Lawonn;Sylvia Saalfeld;Anna Vilanova;Bernhard Preim;Tobias Isenberg", "citationCount": "17", "affiliation": "Lawonn, K (Corresponding Author), Univ Magdeburg, D-39106 Magdeburg, Germany. Lawonn, Kai; Glasser, Sylvia; Preim, Bernhard, Univ Magdeburg, D-39106 Magdeburg, Germany. Lawonn, Kai; Vilanova, Anna, Delft Univ Technol, Delft, Netherlands. Lawonn, Kai; Isenberg, Tobias, Inria, Saclay Ile De France, France.", "countries": "Germany;France;Netherlands", "abstract": "We present the first visualization tool that combines pathlines from blood flow and wall thickness information. Our method uses illustrative techniques to provide occlusion-free visualization of the flow. We thus offer medical researchers an effective visual analysis tool for aneurysm treatment risk assessment. Such aneurysms bear a high risk of rupture and significant treatment-related risks. Therefore, to get a fully informed decision it is essential to both investigate the vessel morphology and the hemodynamic data. Ongoing research emphasizes the importance of analyzing the wall thickness in risk assessment. Our combination of blood flow visualization and wall thickness representation is a significant improvement for the exploration and analysis of aneurysms. As all presented information is spatially intertwined, occlusion problems occur. We solve these occlusion problems by dynamic cutaway surfaces. We combine this approach with a glyph-based blood flow representation and a visual mapping of wall thickness onto the vessel surface. We developed a GPU-based implementation of our visualizations which facilitates wall thickness analysis through real-time rendering and flexible interactive data exploration mechanisms. We designed our techniques in collaboration with domain experts, and we provide details about the evaluation of the technique and tool.", "keywords": "Medical visualization, aneurysms, blood flow, wall thickness, illustrative visualization", "link": "http://dx.doi.org/10.1109/TVCG.2015.2467961", "refList": ["10.1145/1409060.1409107", "10.1109/tvcg.2014.2346406", "10.1109/tvcg.2011.215", "10.1109/visual.2004.48", "10.1145/1111411.1111431", "10.1016/b978-0-12-415873-3.00023-7", "10.2312/pe/pg/pg2011sh0rt/105-110", "10.1117/12.535534", "10.1109/tvcg.2011.243", "10.1145/1239451.1239482", "10.2312/vcbm/vcbm10/025-032", "10.1007/s007910050004", "10.1002/jmri.23632", "10.1111/1467-8659.t01-3-00700", "10.1111/cgf.12112", "10.1007/978-1-4471-6497-5\\_25", "10.2312/pe/pg/pg2011short/105-110", "10.1109/tvcg.2010.153", "10.1007/978-1-4471-6497-5-25", "10.3174/ajnr.a2274", "10.1145/2503713.2503714", "10.1136/neurintsurg-2012-010285", "10.1016/j.compfluid.2012.02.020", "10.1002/fld.1590", "10.3174/ajnr.a2121", "10.1109/pacificvis.2012.6183590", "10.1161/01.str.0000140636.30204.da", "10.1145/2448531.2448537", "10.1111/cgf.12355", "10.1111/cgf.12165", "10.1109/tmi.2005.844159", "10.1109/tvcg.2009.138", "10.1007/s11517-008-0420-1", "10.1145/984952.984987", "10.1109/pacificvis.2013.6596137", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2016.2598795", "title": "Combined Visualization of Vessel Deformation and Hemodynamics in Cerebral Aneurysms", "year": "2016", "conferenceName": "SciVis", "authors": "Monique Meuschke;Samuel Voß;Oliver Beuing;Bernhard Preim;Kai Lawonn", "citationCount": "9", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, D-39106 Magdeburg, Germany. Meuschke, M (Corresponding Author), Res Campus STIMULATE, D-39106 Magdeburg, Germany. Meuschke, Monique; Voss, Samuel; Beuing, Oliver; Preim, Bernhard, Univ Magdeburg, D-39106 Magdeburg, Germany. Meuschke, Monique; Voss, Samuel; Beuing, Oliver; Preim, Bernhard, Res Campus STIMULATE, D-39106 Magdeburg, Germany. Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany.", "countries": "Germany", "abstract": "We present the first visualization tool that combines patient-specific hemodynamics with information about the vessel wall deformation and wall thickness in cerebral aneurysms. Such aneurysms bear the risk of rupture, whereas their treatment also carries considerable risks for the patient. For the patient-specific rupture risk evaluation and treatment analysis, both morphological and hemodynamic data have to be investigated. Medical researchers emphasize the importance of analyzing correlations between wall properties such as the wall deformation and thickness, and hemodynamic attributes like the Wall Shear Stress and near-wall flow. Our method uses a linked 2.5D and 3D depiction of the aneurysm together with blood flow information that enables the simultaneous exploration of wall characteristics and hemodynamic attributes during the cardiac cycle. We thus offer medical researchers an effective visual exploration tool for aneurysm treatment risk assessment. The 2.5D view serves as an overview that comprises a projection of the vessel surface to a 2D map, providing an occlusion-free surface visualization combined with a glyph-based depiction of the local wall thickness. The 3D view represents the focus upon which the data exploration takes place. To support the time-dependent parameter exploration and expert collaboration, a camera path is calculated automatically, where the user can place landmarks for further exploration of the properties. We developed a GPU-based implementation of our visualizations with a flexible interactive data exploration mechanism. We designed our techniques in collaboration with domain experts, and provide details about the evaluation.", "keywords": "Medical visualizations;aneurysms;blood flow;wall thickness;wall deformation;projections", "link": "http://dx.doi.org/10.1109/TVCG.2016.2598795", "refList": ["10.1136/neurintsurg-2014-011247", "10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1109/tvcg.2011.215", "10.1148/rg.233025036", "10.1111/j.1467-8659.2012.03099.x", "10.1016/j.jbiomech.2011.07.026", "10.1109/pacificvis.2014.14", "10.1109/tvcg.2012.318", "10.3174/ajnr.a3949", "10.1109/tvcg.2006.104", "10.3171/2009.2.focus0921", "10.1109/tvcg.2015.2467961", "10.1109/tvcg.2013.2297914", "10.1111/cgf.12369", "10.1109/tvcg.2011.243", "10.1227/neu.0b013e318225b2d3", "10.1007/s10439-012-0632-2", "10.1007/s007910050004", "10.1109/tvcg.2013.189", "10.1111/cgf.12112", "10.1111/j.1467-8659.2011.01930.x", "10.1109/tvcg.2010.153", "10.3174/ajnr.a4157", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.1111/j.1467-8659.2003.00717.x", "10.3174/ajnr.a3558", "10.1109/tvcg.2012.202", "10.1109/tdpvt.2004.1335277", "10.1007/s00466-009-0421-4", "10.1111/cgf.12355", "10.1098/rsif.2011.0490", "10.1145/984952.984987", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864509", "title": "Visual Analysis of Aneurysm Data using Statistical Graphics", "year": "2018", "conferenceName": "SciVis", "authors": "Monique Meuschke;Tobias Günther;Philipp Berg;Ralph Wickenhöfer;Bernhard Preim;Kai Lawonn", "citationCount": "1", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Magdeburg, Germany. Meuschke, M (Corresponding Author), Res Campus STIMULATE, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Univ Magdeburg, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Res Campus STIMULATE, Magdeburg, Germany. Gunther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland. Wickenhoefer, Ralph, Heart Jesus Hosp, Dernbach, Germany. Lawonn, Kai, Univ Koblenz Landau, Koblenz, Germany.", "countries": "Germany;Switzerland", "abstract": "This paper presents a framework to explore multi-field data of aneurysms occurring at intracranial and cardiac arteries by using statistical graphics. The rupture of an aneurysm is often a fatal scenario, whereas during treatment serious complications for the patient can occur. Whether an aneurysm ruptures or whether a treatment is successful depends on the interaction of different morphological such as wall deformation and thickness, and hemodynamic attributes like wall shear stress and pressure. Therefore, medical researchers are very interested in better understanding these relationships. However, the required analysis is a time-consuming process, where suspicious wall regions are difficult to detect due to the time-dependent behavior of the data. Our proposed visualization framework enables medical researchers to efficiently assess aneurysm risk and treatment options. This comprises a powerful set of views including 2D and 3D depictions of the aneurysm morphology as well as statistical plots of different scalar fields. Brushing and linking aids the user to identify interesting wall regions and to understand the influence of different attributes on the aneurysm's state. Moreover, a visual comparison of pre- and post-treatment as well as different treatment options is provided. Our analysis techniques are designed in collaboration with domain experts, e.g., physicians, and we provide details about the evaluation.", "keywords": "Medical visualizations,aneurysms,blood flow,parametrization", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864509", "refList": ["10.1109/tvcg.2013.139", "10.1136/neurintsurg-2014-011247", "10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1111/j.1467-8659.2008.01289.x", "10.3171/2009.2.focus0921", "10.1109/tvcg.2011.235", "10.1080/03610910903168603", "10.1111/cgf.12911", "10.1145/2516971.2516977", "10.1590/s2179-83972012000100014", "10.1109/mcg.2018.032421654", "10.1109/tvcg.2016.2598795", "10.1016/b978-0-12-811018-8.00014-x", "10.1145/1360612.1360643", "10.1111/cgf.12369", "10.1109/smi.2005.17", "10.1186/s12968-015-0174-5", "10.2312/conf/eg2013/stars/039-063", "10.1109/enc.2004.1342596", "10.1067/mje.2002.123374", "10.1016/j.jbiomech.2015.09.039", "10.2312/vissym/vissym04/147-154", "10.1115/1.4033082", "10.1016/j.cag.2011.01.011", "10.1002/jmri.20361", "10.1007/s007910050004", "10.1109/tvcg.2010.111", "10.1016/j.cag.2016.05.024", "10.1109/tvcg.2010.153", "10.1109/visual.2000.885739", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.1007/978-3-662-46224-9\\_45", "10.1109/iv.2005.3", "10.3171/2013.12.jns13945", "10.1007/s00115-011-3372-x", "10.2307/2032161", "10.1109/tvcg.2016.2598866", "10.1115/1.4026108", "10.1161/01.str.0000260955.51401.cd", "10.1111/cgf.13171", "10.1111/cgf.12355", "10.1098/rsif.2011.0490", "10.1109/34.868688", "10.1109/42.875181", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 5}, {"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13411", "year": "2018", "title": "Explorative Blood Flow Visualization using Dynamic Line Filtering based on Surface Features", "conferenceName": "EuroVis", "authors": "Benjamin Behrendt;Philipp Berg;Oliver Beuing;Bernhard Preim;Sylvia Saalfeld", "citationCount": "2", "affiliation": "Behrendt, B (Corresponding Author), Res Campus STIMULATE, Magdeburg, Germany.\nBehrendt, B (Corresponding Author), Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nBehrendt, B.; Berg, P.; Beuing, O.; Preim, B.; Saalfeld, S., Res Campus STIMULATE, Magdeburg, Germany.\nBehrendt, B.; Preim, B.; Saalfeld, S., Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nBerg, P., Univ Magdeburg, Dept Fluid Dynam \\& Tech Flows, Magdeburg, Germany.\nBeuing, O., Univ Hosp Magdeburg, Inst Neuroradiol, Magdeburg, Germany.", "countries": "Germany", "abstract": "Rupture risk assessment is a key to devise patient-specific treatment plans of cerebral aneurysms. To understand and predict the development of aneurysms and other vascular diseases over time, both hemodynamic flow patterns and their effect on the vessel surface need to be analyzed. Flow structures close to the vessel wall often correlate directly with local changes in surface parameters, such as pressure or wall shear stress. Yet, in many existing applications, the analyses of flow and surface features are either somewhat detached from one another or only globally available. Especially for the identification of specific blood flow characteristics that cause local startling parameters on the vessel surface, like elevated pressure values, an interactive analysis tool is missing. The explorative visualization of flow data is challenging due to the complexity of the underlying data. In order to find meaningful structures in the entirety of the flow, the data has to be filtered based on the respective explorative aim. In this paper, we present a combination of visualization, filtering and interaction techniques for explorative analysis of blood flow with a focus on the relation of local surface parameters and underlying flow structures. Coherent bundles of pathlines can be interactively selected based on their relation to features of the vessel wall and further refined based on their own hemodynamic features. This allows the user to interactively select and explore flow structures locally affecting a certain region on the vessel wall and therefore to understand the cause and effect relationship between these entities. Additionally, multiple selected flow structures can be compared with respect to their quantitative parameters, such as flow speed. We confirmed the usefulness of our approach by conducting an informal interview with two expert neuroradiologists and an expert in flow simulation. In addition, we recorded several insights the neuroradiologists were able to gain with the help of our tool.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13411", "refList": ["10.1109/tvcg.2012.318", "10.1109/tvcg.2006.104", "10.3171/2009.2.focus0921", "10.1109/tvcg.2015.2467961", "10.1109/tvcg.2013.2297914", "10.1109/tvcg.2009.58", "10.3174/ajnr.a5358", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2011.243", "10.2312/vcbm/vcbm10/025-032", "10.3174/ajnr.a5088", "10.3174/ajnr.a3710", "10.1109/tvcg.2013.189", "10.1111/cgf.12112", "10.1515/bmt-2012-0119", "10.1109/pacificvis.2011.5742376", "10.1109/tvcg.2015.2467203", "10.1109/tvcg.2010.153", "10.1016/s0140-6736(03)13860-3", "10.1109/tvcg.2012.202", "10.1109/tvcg.2009.198", "10.1115/1.4026108", "10.1161/01.str.0000260955.51401.cd"], "wos": 1, "children": [{"doi": "10.1111/cgf.14036", "year": "2020", "title": "A Survey of Seed Placement and Streamline Selection Techniques", "conferenceName": "EuroVis", "authors": "Sudhanshu Sane;Roxana Bujack;Christoph Garth;Hank Childs", "citationCount": "0", "affiliation": "Sane, S (Corresponding Author), Univ Oregon, Eugene, OR 97403 USA.\nSane, Sudhanshu; Childs, Hank, Univ Oregon, Eugene, OR 97403 USA.\nBujack, Roxana, Los Alamos Natl Lab, Los Alamos, NM USA.\nGarth, Christoph, Univ Kaiserslautern, Kaiserslautern, Germany.", "countries": "Germany;USA", "abstract": "Streamlines are an extensively utilized flow visualization technique for understanding, verifying, and exploring computational fluid dynamics simulations. One of the major challenges associated with the technique is selecting which streamlines to display. Using a large number of streamlines results in dense, cluttered visualizations, often containing redundant information and occluding important regions, whereas using a small number of streamlines could result in missing key features of the flow. Many solutions to select a representative set of streamlines have been proposed by researchers over the past two decades. In this state-of-the-art report, we analyze and classify seed placement and streamline selection (SPSS) techniques used by the scientific flow visualization community. At a high-level, we classify techniques into automatic and manual techniques, and further divide automatic techniques into three strategies: density-based, feature-based, and similarity-based. Our analysis evaluates the identified strategy groups with respect to focus on regions of interest, minimization of redundancy, and overall computational performance. Finally, we consider the application contexts and tasks for which SPSS techniques are currently applied and have potential applications in the future.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14036", "refList": ["10.1109/visual.1998.745295", "10.1007/978-3-540-70823-0\\_1", "10.1109/pacificvis.2014.14", "10.1111/j.1467-8659.2004.00753.x", "10.1109/visual.2000.885690", "10.1007/s00791-014-0229-4", "10.1109/tvcg.2012.143", "10.1109/mcg.2018.2881523", "10.1111/j.1467-8659.2009.01352.x", "10.1111/cgf.12356", "10.1109/tvcg.2005.87", "10.1007/s00371-007-0204-x", "10.1109/pacificvis.2015.7156350", "10.1080/14786440009463897", "10.1145/160985.161150", "10.1145/984952.984987", "10.1117/12.2001887", "10.1109/tvcg.2010.182", "10.1117/12.765736", "10.1109/mcg.2019.2936674", "10.1145/79505.79507", "10.1109/tvcg.2013.2297914", "10.1007/978-3-7091-6876-9\\_5", "10.1109/mcse.2007.82", "10.1109/ipec.2014.6869823", "10.1109/tvcg.2010.212", "10.1109/ldav.2015.7348070", "10.1111/cgf.12031", "10.3233/ica-130447", "10.1109/visual.1999.809918", "10.1109/mec.2013.6885356", "10.1109/83.623193", "10.1109/icsmc.2009.5346286", "10.1109/ihmsc.2019.00041", "10.1109/pacificvis.2011.5742376", "10.1109/pacificvis.2009.4906832", "10.1111/cgf.13411", "10.1109/tvcg.2011.260", "10.1016/j.cag.2015.06.003", "10.1109/tvcg.2009.206", "10.1109/cvpr.2007.383096", "10.1016/j.media.2007.10.003", "10.1016/j.cag.2016.08.001", "10.1109/tvcg.2006.95", "10.1109/ldav.2014.7013206", "10.1109/tvcg.2015.2467204", "10.1109/visual.1996.567777", "10.1109/visual.1992.235211", "10.1109/tvcg.2006.116", "10.1109/cis.2011.260", "10.1111/j.1467-8659.2011.02064.x", "10.1109/pacificvis.2013.6596153", "10.1109/tvcg.2012.150", "10.1016/j.gmod.2015.01.002", "10.1145/7529.8927", "10.1109/tvcg.2014.2325043", "10.1145/2461912.2461930", "10.1109/tvcg.2010.131", "10.1145/321796.321811", "10.1109/cis.2010.58", "10.1109/visual.2002.1183821", "10.1109/tvcg.2004.49", "10.1111/j.1467-8659.2011.01901.x", "10.1109/tvcg.2007.70595", "10.1109/cadgraphics.2015.48", "10.1109/tvcg.2011.215", "10.1109/icris.2016.3", "10.1126/science.1136800", "10.1109/tvcg.2006.104", "10.1111/j.1467-8659.2012.03102.x", "10.1109/tvcg.2014.2312009", "10.1109/visual.2000.885745", "10.1109/tvcg.2011.155", "10.2312/vissym/eurovis07/227-234", "10.1117/12.2038253", "10.1109/pacificvis.2014.12", "10.1016/j.cag.2015.01.002", "10.1109/tvcg.2007.1009", "10.1109/pacificvis.2010.5429603", "10.1109/visual.1998.745317", "10.1109/tvcg.2004.13", "10.1111/j.1467-8659.2010.01650.x", "10.1016/j.cag.2012.04.014", "10.1109/tvcg.2004.1260771", "10.1109/visual.2003.1250378", "10.1109/visual.2004.59", "10.1109/visual.2003.1250376", "10.1109/visual.1994.346312", "10.1111/cgf.12336", "10.1111/j.1467-8659.2003.00723.x", "10.1017/s0022112095000462", "10.1109/cis.2009.194"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.13445", "year": "2018", "title": "A Survey of Flattening-Based Medical Visualization Techniques", "conferenceName": "EuroVis", "authors": "Julian Kreiser;Monique Meuschke;Gabriel Mistelbauer;Bernhard Preim;Timo Ropinski", "citationCount": "12", "affiliation": "Kreiser, J (Corresponding Author), Ulm Univ, Visual Comp Grp, Ulm, Germany.\nKreiser, J.; Ropinski, T., Ulm Univ, Visual Comp Grp, Ulm, Germany.\nMeuschke, M.; Mistelbauer, G.; Preim, B., Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.", "countries": "Germany", "abstract": "In many areas of medicine, visualization research can help with task simplification, abstraction or complexity reduction. A common visualization approach is to facilitate parameterization techniques which flatten a usually 3D object into a 2D plane. Within this state of the art report (STAR), we review such techniques used in medical visualization and investigate how they can be classified with respect to the handled data and the underlying tasks. Many of these techniques are inspired by mesh parameterization algorithms which help to project a triangulation in (3) to a simpler domain in (2). It is often claimed that this makes complex structures easier to understand and compare by humans and machines. Within this STAR we review such flattening techniques which have been developed for the analysis of the following medical entities: the circulation system, the colon, the brain, tumors, and bones. For each of these five application scenarios, we have analyzed the tasks and requirements, and classified the reviewed techniques with respect to a developed coding system. Furthermore, we present guidelines for the future development of flattening techniques in these areas.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13445", "refList": ["10.1016/j.neuroimage.2009.12.048", "10.1109/tvcg.2010.200", "10.1162/089892900562561", "10.1016/j.neuroimage.2010.02.008", "10.1111/cgf.12110", "10.1109/42.796283", "10.1109/tvcg.2011.182", "10.1111/cgf.12111", "10.1109/tvcg.2014.2346405", "10.1109/tmi.2004.831226", "10.1109/tvcg.2007.1061", "10.1109/isbi.2014.6868097", "10.1109/tvcg.2015.2467413", "10.3322/caac.21395", "10.1109/tvcg.2009.136", "10.1162/jocn.1996.8.1.1", "10.1161/hc0402.102975", "10.1016/s1361-8415(02)00054-3", "10.1109/tvcg.2011.192", "10.1109/tmi.2011.2168233", "10.1109/tip.2007.896637", "10.1136/jamia.2001.0080443", "10.1111/j.1467-8659.2009.01665.x", "10.1109/visual.2003.1250353", "10.1148/radiol.10091096", "10.1016/j.neuroimage.2009.10.086", "10.1109/tmi.2013.2241651", "10.2312/8168", "10.1117/12.466985", "10.1007/s10654-015-0082-x", "10.1007/978-3-319-12508-4\\_8", "10.1137/130950008", "10.1109/tvcg.2010.134", "10.1016/j.neuroimage.2004.07.042", "10.1109/tmi.2007.895464", "10.1007/s00330-015-3598-2", "10.1016/j.neuroimage.2005.06.055", "10.2214/ajr.170.4.9530029", "10.1016/j.compmedimag.2008.08.002", "10.1109/tvcg.2007.70550", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1109/visual.2002.1183754", "10.1109/tvcg.2016.2598795", "10.1007/3-540-26808-1\\_9", "10.1109/isbi.2015.7164103", "10.1137/080738386", "10.1109/visual.2001.964555", "10.1002/jmri.25622", "10.1016/j.media.2008.04.002", "10.1109/tvcg.2011.207", "10.1007/978-3-662-46224-9\\_45", "10.1006/nimg.1998.0396", "10.1016/j.cag.2011.03.008", "10.1007/978-3-540-85988-8\\_70", "10.1112/plms/s3-13.1.743", "10.1093/cercor/bhn016", "10.1002/ima.20140", "10.1109/pacificvis.2012.6183596", "10.1098/rsif.2011.0490", "10.1016/j.media.2004.06.020", "10.1145/2668020", "10.1177/1473871611416549", "10.1109/tvcg.2017.2674938", "10.1016/j.acra.2016.09.022", "10.1109/tvcg.2016.2598791", "10.1016/j.neuroimage.2004.07.018", "10.1002/jmri.21634", "10.1016/j.cag.2016.05.024", "10.1016/s0167-8396(03)00002-5", "10.1007/978-981-10-0266-3\\_65", "10.1088/0031-9155/50/19/007", "10.1007/978-3-642-25719-3\\_16", "10.1007/978-3-642-17274-8\\_52", "10.1007/978-3-642-23629-7\\_41", "10.1109/tvcg.2004.24", "10.1111/j.1467-8659.2012.03114.x", "10.1088/0031-9155/52/10/015", "10.1117/12.878295", "10.1016/j.cmpb.2014.10.004", "10.1016/j.neuroimage.2008.10.045", "10.1109/tvcg.2013.215", "10.1561/0600000011", "10.1109/tvcg.2013.139", "10.1109/cvpr.2013.290", "10.1016/j.acra.2016.09.018", "10.1007/s00330-004-2289-1", "10.1117/12.387731", "10.1016/j.neuroimage.2012.01.021", "10.1109/34.35506", "10.1016/s0167-8396(96)00031-3", "10.1117/12.534480", "10.1109/visual.2001.964540", "10.1016/s1076-6332(03)80579-2", "10.1109/tmi.2004.839368", "10.1016/j.clinimag.2015.03.005", "10.1016/j.compmedimag.2007.06.007", "10.1007/978-3-642-25719-3\\_17", "10.1109/42.875181", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934258", "title": "Scale-Space Splatting: Reforming Spacetime for Cross-Scale Exploration of Integral Measures in Molecular Dynamics", "year": "2019", "conferenceName": "SciVis", "authors": "Juraj Pálenik;Jan Byska;Stefan Bruckner;Helwig Hauser", "citationCount": "0", "affiliation": "Palenik, J (Corresponding Author), Univ Bergen, Bergen, Norway. Palenik, Juraj; Byska, Jan; Bruckner, Stefan; Hauser, Helwig, Univ Bergen, Bergen, Norway. Byska, Jan, Masaryk Univ, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "Understanding large amounts of spatiotemporal data from particle-based simulations, such as molecular dynamics, often relies on the computation and analysis of aggregate measures. These, however, by virtue of aggregation, hide structural information about the space/time localization of the studied phenomena. This leads to degenerate cases where the measures fail to capture distinct behaviour. In order to drill into these aggregate values, we propose a multi-scale visual exploration technique. Our novel representation, based on partial domain aggregation, enables the construction of a continuous scale-space for discrete datasets and the simultaneous exploration of scales in both space and time. We link these two scale-spaces in a scale-space space-time cube and model linked views as orthogonal slices through this cube, thus enabling the rapid identification of spatio-temporal patterns at multiple scales. To demonstrate the effectiveness of our approach, we showcase an advanced exploration of a protein-ligand simulation.", "keywords": "Scale space,time-series,scientific simulation,multi-scale analysis,space-time cube,molecular dynamics", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934258", "refList": ["10.1111/cgf.13445", "10.1109/tvcg.2012.191", "10.1201/b14876", "10.1145/827051.827056", "10.1080/07391102.2005.10531229", "10.1021/acs.jcim.7b00070", "10.1007/978-3-8348-9190-729", "10.1111/cgf.13427", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1016/0021-9991(82)90025-0", "10.1111/cgf.13177", "10.1007/978-1-4757-6465-9", "10.1145/1044588.1044615", "10.2307/2669996", "10.1109/tvcg.2018.2865049", "10.1007/978-3-540-70823-0\\_3", "10.1111/cgf.13640", "10.1109/tvcg.2010.253", "10.1109/tvcg.2009.177", "10.1016/j.csda.2018.03.014", "10.1109/tvcg.2009.200", "10.1109/visual.2003.1250353", "10.2312/eurovisshort.20171146", "10.1109/tvcg.2010.148", "10.1002/9780470316849", "10.1109/visual.1993.398859", "10.1007/978-1-4612-4026-6", "10.1016/j.jmb.2018.09.004", "10.1111/cgf.13415", "10.2312/molva.20181102", "10.1371/journal.pcbi.1002708", "10.1007/s10851-010-0242-2", "10.1016/0263-7855(96)00018-5", "10.1109/visual.2003.1250402", "10.1007/bf01936872", "10.1002/wics.79", "10.1111/j.1467-8659.2009.01684.x", "10.1109/tvcg.2018.2864510", "10.1111/cgf.12804", "10.1117/12.904668", "10.1002/jcc.20289", "10.1088/0965-0393/18/1/015012", "10.1109/34.56205", "10.1111/j.1435-5597.1970.tb01464.x", "10.1007/978-0-85729-079-3", "10.1007/s11263-005-1838-7"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}, {"doi": "10.1111/cgf.13987", "year": "2020", "title": "Augmenting Node-Link Diagrams with Topographic Attribute Maps", "conferenceName": "EuroVis", "authors": "Reinhold Preiner;Johanna Schmidt;Katharina Kr{\\\"{o}}sl;Tobias Schreck;Gabriel Mistelbauer", "citationCount": "0", "affiliation": "Preiner, R (Corresponding Author), Graz Univ Technol, Inst Comp Graph \\& Knowledge Visualizat, Graz, Austria.\nPreiner, R.; Schreck, T., Graz Univ Technol, Inst Comp Graph \\& Knowledge Visualizat, Graz, Austria.\nSchmidt, J.; Kroesl, K., Virtual Real \\& Visualisierung Forsch GmbH, VRVis Zentrum, Vienna, Austria.\nKroesl, K., TU Wien, Inst Visual Comp \\& Human Ctr Technol, Vienna, Austria.\nMistelbauer, G., Otto von Guericke Univ, Dept Simulat \\& Graph, Magdeburg, Germany.", "countries": "Germany;Austria", "abstract": "We propose a novel visualization technique for graphs that are attributed with scalar data. In many scenarios, these attributes (e.g., birth date in a family network) provide ambient context information for the graph structure, whose consideration is important for different visual graph analysis tasks. Graph attributes are usually conveyed using different visual representations (e.g., color, size, shape) or by reordering the graph structure according to the attribute domain (e.g., timelines). While visual encodings allow graphs to be arranged in a readable layout, assessing contextual information such as the relative similarities of attributes across the graph is often cumbersome. In contrast, attribute-based graph reordering serves the comparison task of attributes, but typically strongly impairs the readability of the structural information given by the graph's topology. In this work, we augment force-directed node-link diagrams with a continuous ambient representation of the attribute context. This way, we provide a consistent overview of the graph's topological structure as well as its attributes, supporting a wide range of graph-related analysis tasks. We resort to an intuitive height field metaphor, illustrated by a topographic map rendering using contour lines and suitable color maps. Contour lines visually connect nodes of similar attribute values, and depict their relative arrangement within the global context. Moreover, our contextual representation supports visualizing attribute value ranges associated with graph nodes (e.g., lifespans in a family network) as trajectories routed through this height field. We discuss how user interaction with both the structural and the contextual information fosters exploratory graph analysis tasks. The effectiveness and versatility of our technique is confirmed in a user study and case studies from various application domains.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13987", "refList": ["10.1109/tvcg.2013.269", "10.1109/pacificvis.2010.5429590", "10.1073/pnas.0307654100", "10.1145/2505515.2505758", "10.1559/152304082783948286", "10.1109/pacificvis.2014.47", "10.1093/bioinformatics/btp432", "10.1111/j.1467-8659.2011.01898.x", "10.1111/cgf.12931", "10.1111/cgf.12880", "10.1109/tvcg.2014.2346422", "10.1111/j.1467-8659.2009.01706.x", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12800", "10.1109/tvcg.2014.2315995", "10.1111/cgf.12656", "10.1111/cgf.13728", "10.1109/tvcg.2009.122", "10.1111/cgf.13211", "10.1109/tvcg.2007.70596", "10.1109/infvis.2002.1173152", "10.1109/tvcg.2015.2467691", "10.1109/tvcg.2003.1196007", "10.1109/infvis.2005.1532150", "10.1145/3243250.3243266", "10.1080/02693799008941549", "10.1371/journal.pone.0058779", "10.1109/infvis.1995.528686", "10.1111/cgf.12872", "10.1002/spe.4380211102", "10.1109/38.974518", "10.1145/3097983.3098130", "10.1002/aris.1440370106", "10.1145/1360612.1360691", "10.1109/mc.2016.145", "10.2307/3006914", "10.1111/j.1467-8659.2009.01683.x", "10.1145/1639714.1639784"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13171", "year": "2017", "title": "Glyph-Based Comparative Stress Tensor Visualization in Cerebral Aneurysms", "conferenceName": "EuroVis", "authors": "Monique Meuschke;Samuel Vo{\\ss};Oliver Beuing;Bernhard Preim;Kai Lawonn", "citationCount": "7", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nMeuschke, M.; Preim, B., Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nVoss, S., Univ Magdeburg, Dept Fluid Dynam \\& Tech Flows, Magdeburg, Germany.\nBeuing, O., Univ Hosp, Dept Neuroradiol, Magdeburg, Germany.\nLawonn, K., Univ Koblenz Landau, Inst Computat Visualist, Mainz, Germany.", "countries": "Germany", "abstract": "We present the first visualization tool that enables a comparative depiction of structural stress tensor data for vessel walls of cerebral aneurysms. Such aneurysms bear the risk of rupture, whereas their treatment also carries considerable risks for the patient. Medical researchers emphasize the importance of analyzing the interaction of morphological and hemodynamic information for the patient-specific rupture risk evaluation and treatment analysis. Tensor data such as the stress inside the aneurysm walls characterizes the interplay between the morphology and blood flow and seems to be an important rupture-prone criterion. We use different glyph-based techniques to depict local stress tensors simultaneously and compare their applicability to cerebral aneurysms in a user study. We thus offer medical researchers an effective visual exploration tool to assess the aneurysm rupture risk. We developed a GPU-based implementation of our techniques with a flexible interactive data exploration mechanism. Our depictions are designed in collaboration with domain experts, and we provide details about the evaluation.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13171", "refList": ["10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1148/rg.233025036", "10.1177/1473871611416549", "10.3171/2009.2.focus0921", "10.1109/tvcg.2011.235", "10.1109/tvcg.2015.2467961", "10.1002/mrm.1910360612", "10.1109/visual.2002.1183797", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2011.243", "10.1161/strokeaha.113.004421", "10.2312/conf/eg2013/stars/039-063", "10.1007/978-3-319-24571-3\\_48", "10.2312/vissym/vissym04/147-154", "10.1016/j.cag.2011.01.011", "10.1007/s10439-012-0632-2", "10.1007/s007910050004", "10.3174/ajnr.a4157", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.3174/ajnr.a3558", "10.1111/j.1467-8659.2009.01711.x", "10.1155/2016/9307560", "10.1109/tvcg.2010.199", "10.1111/cgf.12119", "10.1111/cgf.12355", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864509", "title": "Visual Analysis of Aneurysm Data using Statistical Graphics", "year": "2018", "conferenceName": "SciVis", "authors": "Monique Meuschke;Tobias Günther;Philipp Berg;Ralph Wickenhöfer;Bernhard Preim;Kai Lawonn", "citationCount": "1", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Magdeburg, Germany. Meuschke, M (Corresponding Author), Res Campus STIMULATE, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Univ Magdeburg, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Res Campus STIMULATE, Magdeburg, Germany. Gunther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland. Wickenhoefer, Ralph, Heart Jesus Hosp, Dernbach, Germany. Lawonn, Kai, Univ Koblenz Landau, Koblenz, Germany.", "countries": "Germany;Switzerland", "abstract": "This paper presents a framework to explore multi-field data of aneurysms occurring at intracranial and cardiac arteries by using statistical graphics. The rupture of an aneurysm is often a fatal scenario, whereas during treatment serious complications for the patient can occur. Whether an aneurysm ruptures or whether a treatment is successful depends on the interaction of different morphological such as wall deformation and thickness, and hemodynamic attributes like wall shear stress and pressure. Therefore, medical researchers are very interested in better understanding these relationships. However, the required analysis is a time-consuming process, where suspicious wall regions are difficult to detect due to the time-dependent behavior of the data. Our proposed visualization framework enables medical researchers to efficiently assess aneurysm risk and treatment options. This comprises a powerful set of views including 2D and 3D depictions of the aneurysm morphology as well as statistical plots of different scalar fields. Brushing and linking aids the user to identify interesting wall regions and to understand the influence of different attributes on the aneurysm's state. Moreover, a visual comparison of pre- and post-treatment as well as different treatment options is provided. Our analysis techniques are designed in collaboration with domain experts, e.g., physicians, and we provide details about the evaluation.", "keywords": "Medical visualizations,aneurysms,blood flow,parametrization", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864509", "refList": ["10.1109/tvcg.2013.139", "10.1136/neurintsurg-2014-011247", "10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1111/j.1467-8659.2008.01289.x", "10.3171/2009.2.focus0921", "10.1109/tvcg.2011.235", "10.1080/03610910903168603", "10.1111/cgf.12911", "10.1145/2516971.2516977", "10.1590/s2179-83972012000100014", "10.1109/mcg.2018.032421654", "10.1109/tvcg.2016.2598795", "10.1016/b978-0-12-811018-8.00014-x", "10.1145/1360612.1360643", "10.1111/cgf.12369", "10.1109/smi.2005.17", "10.1186/s12968-015-0174-5", "10.2312/conf/eg2013/stars/039-063", "10.1109/enc.2004.1342596", "10.1067/mje.2002.123374", "10.1016/j.jbiomech.2015.09.039", "10.2312/vissym/vissym04/147-154", "10.1115/1.4033082", "10.1016/j.cag.2011.01.011", "10.1002/jmri.20361", "10.1007/s007910050004", "10.1109/tvcg.2010.111", "10.1016/j.cag.2016.05.024", "10.1109/tvcg.2010.153", "10.1109/visual.2000.885739", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.1007/978-3-662-46224-9\\_45", "10.1109/iv.2005.3", "10.3171/2013.12.jns13945", "10.1007/s00115-011-3372-x", "10.2307/2032161", "10.1109/tvcg.2016.2598866", "10.1115/1.4026108", "10.1161/01.str.0000260955.51401.cd", "10.1111/cgf.13171", "10.1111/cgf.12355", "10.1098/rsif.2011.0490", "10.1109/34.868688", "10.1109/42.875181", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 5}, {"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.1008", "year": "2020", "title": "Tensor Spines - A Hyperstreamlines Variant Suitable for Indefinite Symmetric Second-Order Tensors", "conferenceName": "PacificVis", "authors": "Vanessa Kretzschmar;Fabian G{\\\"{u}}nther;Markus Stommel;Gerik Scheuermann", "citationCount": "0", "affiliation": "Kretzschmar, V (Corresponding Author), TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, V (Corresponding Author), Univ Leipzig, Leipzig, Germany.\nKretzschmar, Vanessa; Guenther, Fabian; Stommel, Markus, TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, Vanessa; Scheuermann, Gerik, Univ Leipzig, Leipzig, Germany.", "countries": "Germany", "abstract": "Modern engineering uses optimization to design long-living and robust components. One part of this process is to find the optimal stress-aware design under given geometric constraints and loading conditions. Tensor visualization provides techniques to show and evaluate the stress distribution based on finite element method simulations. One such technique are hyperstreamlines. They allow us to explore the stress along a line following one principal stress direction while showing the other principal stress directions and their values. In this paper, we show shortcomings of this approach from an engineer's point of view and propose a variant called tensor spines. It provides an improved perception of the relation between the principal stresses helping engineers to optimize their designs further.", "keywords": "Human-centered computing; Visualization; Visualization techniques", "link": "https://doi.org/10.1109/PacificVis48177.2020.1008", "refList": ["10.1109/38.219447", "10.1002/nag.223", "10.1109/tvcg.2016.2598998", "10.1109/pacificvis.2014.51", "10.1111/cgf.13693", "10.1109/tvcg.2015.2484343", "10.1111/cgf.13434", "10.1007/s00371-017-1450-1", "10.1007/b106657\\_8", "10.1109/scivis.2015.7429491", "10.1111/j.1467-8659.2012.03231.x", "10.2312/vissym/vissym04/147-154", "10.1109/visual.2004.105", "10.1111/cgf.13423", "10.1109/visual.2003.1250379", "10.1111/cgf.13171", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13434", "year": "2018", "title": "Illustrative Multivariate Visualization for Geological Modelling", "conferenceName": "EuroVis", "authors": "Allan Rocha;Roberta C. Ramos Mota;Hamidreza Hamdi;Usman R. Alim;Mario Costa Sousa", "citationCount": "3", "affiliation": "Rocha, A (Corresponding Author), Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nRocha, A.; Mota, R. C. R.; Alim, U. R.; Sousa, M. Costa, Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nHamdi, H., Univ Calgary, Dept Geosci, Calgary, AB, Canada.", "countries": "Canada", "abstract": "In this paper, we present a novel illustrative multivariate visualization for geological modelling to assist geologists and reservoir engineers in visualizing multivariate datasets in superimposed representations, in contrast to the single-attribute visualizations supported by commercial software. Our approach extends the use of decals from a single surface to 3D irregular grids, using the layering concept to represent multiple attributes. We also build upon prior work to augment the design and implementation of different geological attributes (namely, rock type, porosity, and permeability). More specifically, we propose a new sampling strategy to generate decals for porosity on the geological grid, a hybrid visualization for permeability which combines 2D decals and 3D ellipsoid glyphs, and a perceptually-based design that allows us to visualize additional attributes (e.g., oil saturation) while avoiding visual interference between layers. Furthermore, our visual design draws from traditional geological illustrations, facilitating the understanding and communication between interdisciplinary teams. An evaluation by domain experts highlights the potential of our approach for geological modelling and interpretation in this complex domain.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13434", "refList": ["10.1145/1408626.1408633", "10.1145/2983310.2985762", "10.1177/1473871611416549", "10.1109/sibgrapi.2011.20", "10.1109/visual.1999.809905", "10.1109/tvcg.2012.34", "10.1145/2076354.2076390", "10.2312/egt.20061068", "10.1109/tvcg.2011.127", "10.1144/sp347.13", "10.1016/j.cag.2017.05.001", "10.1109/tvcg.2008.170", "10.2312/envirvis.20161099", "10.1109/tvcg.2017.2747545", "10.1111/cgf.13322", "10.1109/tvcg.2013.124", "10.2312/conf/eg2013/stars/039-063", "10.2312/vissym/vissym04/147-154", "10.1016/j.cag.2011.01.011", "10.1111/cgf.12127", "10.1145/1179849.1180035", "10.1016/j.gmod.2016.02.001", "10.1109/sibgrapi.2015.12", "10.1111/j.1467-8659.2009.01429.x", "10.3997/2214-4609.201411305", "10.1016/j.cag.2017.05.005", "10.1144/petgeo2012-074", "10.1109/tvcg.2012.110", "10.1007/s11390-015-1535-0", "10.1109/sibgrapi.2011.45", "10.1145/1281500.1281671", "10.1145/2448531.2448537", "10.20380/gi2014.19", "10.2312/envirvis.20171101", "10.1111/cgf.13171", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/pacificvis48177.2020.1008", "year": "2020", "title": "Tensor Spines - A Hyperstreamlines Variant Suitable for Indefinite Symmetric Second-Order Tensors", "conferenceName": "PacificVis", "authors": "Vanessa Kretzschmar;Fabian G{\\\"{u}}nther;Markus Stommel;Gerik Scheuermann", "citationCount": "0", "affiliation": "Kretzschmar, V (Corresponding Author), TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, V (Corresponding Author), Univ Leipzig, Leipzig, Germany.\nKretzschmar, Vanessa; Guenther, Fabian; Stommel, Markus, TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, Vanessa; Scheuermann, Gerik, Univ Leipzig, Leipzig, Germany.", "countries": "Germany", "abstract": "Modern engineering uses optimization to design long-living and robust components. One part of this process is to find the optimal stress-aware design under given geometric constraints and loading conditions. Tensor visualization provides techniques to show and evaluate the stress distribution based on finite element method simulations. One such technique are hyperstreamlines. They allow us to explore the stress along a line following one principal stress direction while showing the other principal stress directions and their values. In this paper, we show shortcomings of this approach from an engineer's point of view and propose a variant called tensor spines. It provides an improved perception of the relation between the principal stresses helping engineers to optimize their designs further.", "keywords": "Human-centered computing; Visualization; Visualization techniques", "link": "https://doi.org/10.1109/PacificVis48177.2020.1008", "refList": ["10.1109/38.219447", "10.1002/nag.223", "10.1109/tvcg.2016.2598998", "10.1109/pacificvis.2014.51", "10.1111/cgf.13693", "10.1109/tvcg.2015.2484343", "10.1111/cgf.13434", "10.1007/s00371-017-1450-1", "10.1007/b106657\\_8", "10.1109/scivis.2015.7429491", "10.1111/j.1467-8659.2012.03231.x", "10.2312/vissym/vissym04/147-154", "10.1109/visual.2004.105", "10.1111/cgf.13423", "10.1109/visual.2003.1250379", "10.1111/cgf.13171", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.7567", "year": "2020", "title": "PINGU Principles of Interactive Navigation for Geospatial Understanding", "conferenceName": "PacificVis", "authors": "Zolt{\\'{a}}n Or{\\'{e}}mus;Kahin Akram Hassan;Jir{\\'{\\i}} Chmel{\\'{\\i}}k;Michaela Knazkov{\\'{a}};Jan Byska;Renata Georgia Raidou;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nOremus, Zoltan; Chmelik, Jiri; Knazkova, Michaela; Byska, Jan; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nHassan, Kahin Akram, Linkoping Univ, Linkoping, Sweden.\nRaidou, Renata Georgia, TU Wien, Vienna, Austria.", "countries": "Sweden;Republic;Austria", "abstract": "Monitoring conditions in the periglacial areas of Antarctica helps geographers and geologists to understand physical processes associated with mesoscale land systems. Analyzing these unique temporal datasets poses a significant challenge for domain experts, due to the complex and often incomplete data, for which corresponding exploratory tools are not available. In this paper, we present a novel visual analysis tool for extraction and interactive exploration of temporal measurements captured at the polar station at the James Ross Island in Antarctica. The tool allows domain experts to quickly extract information about the snow level, originating from a series of photos acquired by trail cameras. Using linked views, the domain experts can interactively explore and combine this information with other spatial and non-spatial measures, such as temperature or wind speed, to reveal the interplay of periglacial and aeolian processes. An abstracted interactive map of the area indicates the position of measurement spots to facilitate navigation. The design of the tool was made in tight collaboration with geographers, which resulted in an early prototype, tested in the pilot study. The following version of the tool and its usability has been evaluated in the user study with five domain experts and their feedback was incorporated into the final version, presented in this paper. This version was again discussed with two experts in an informal interview. Within these evaluations, they confirmed the significant benefit of the tool for their research tasks.", "keywords": "Human-centered computing; Visualization; Visualization techniques; Treemaps; Human-centered computing; Visualization; Visualization design and evaluation methods", "link": "https://doi.org/10.1109/PacificVis48177.2020.7567", "refList": ["10.1109/vast.2012.6400553", "10.2307/1269768", "10.1109/iv.2005.135", "10.1145/1456650.1456652", "10.1016/j.cag.2013.01.010", "10.1109/vast.2014.7042489", "10.1002/2017gl074039", "10.1109/tvcg.2013.126", "10.1111/j.1467-8306.2005.00449.x", "10.1177/1473871612457601", "10.1002/fee.1222", "10.1029/2009jf001306", "10.1088/1742-6596/500/18/182006", "10.1109/visual.1991.175794", "10.1109/tvcg.2008.170", "10.1109/vl.1996.545307", "10.1109/cmv.2004.1319531", "10.1007/bf01898350", "10.5194/tc-7-1399-2013", "10.1007/s00267-008-9086-6", "10.1109/tvcg.2011.181", "10.1007/s10109-004-0127-2", "10.1109/iv.2005.3", "10.1007/978-3-540-33037-0\\_10", "10.1109/tvcg.2017.2779501", "10.1111/j.1467-8659.2012.03184.x", "10.1038/sj.bdj.2008.292", "10.1016/j.jvlc.2011.04.001", "10.1111/cgf.12390", "10.1111/cgf.12650", "10.1111/j.1467-8659.2011.01947.x", "10.1111/cgf.13434", "10.1364/oe.15.000033", "10.1111/cgf.13279", "10.1109/tvcg.2008.139", "10.1007/978-3-540-33037-010", "10.1016/j.cag.2007.01.030", "10.1029/2001jd000927", "10.1016/s0167-9473(02)00295-5"], "wos": 1, "children": [], "len": 1}], "len": 5}], "len": 17}], "len": 45}, {"doi": "10.1109/tvcg.2016.2598826", "title": "PelVis: Atlas-based Surgical Planning for Oncological Pelvic Surgery", "year": "2016", "conferenceName": "SciVis", "authors": "Noeska N. Smit;Kai Lawonn;Annelot Kraima;Marco C. DeRuiter;Hessam Sokooti;Stefan Bruckner;Elmar Eisemann;Anna Vilanova", "citationCount": "9", "affiliation": "Smit, N (Corresponding Author), Delft Univ Technol, NL-2600 AA Delft, Netherlands. Smit, N (Corresponding Author), Univ Bergen, N-5020 Bergen, Norway. Smit, Noeska; Eisemann, Elmar; Vilanova, Anna, Delft Univ Technol, NL-2600 AA Delft, Netherlands. Smit, Noeska; Bruckner, Stefan, Univ Bergen, N-5020 Bergen, Norway. Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Kraima, Annelot; DeRuiter, Marco, Leiden Univ, Med Ctr, NL-2300 RA Leiden, Netherlands.", "countries": "Norway;Germany;Netherlands", "abstract": "Due to the intricate relationship between the pelvic organs and vital structures, such as vessels and nerves, pelvic anatomy is often considered to be complex to comprehend. In oncological pelvic surgery, a trade-off has to be made between complete tumor resection and preserving function by preventing damage to the nerves. Damage to the autonomic nerves causes undesirable post-operative side-effects such as fecal and urinal incontinence, as well as sexual dysfunction in up to 80 percent of the cases. Since these autonomic nerves are not visible in pre-operative MRI scans or during surgery, avoiding nerve damage during such a surgical procedure becomes challenging. In this work, we present visualization methods to represent context, target, and risk structures for surgical planning. We employ distance-based and occlusion management techniques in an atlas-based surgical planning tool for oncological pelvic surgery. Patient-specific pre-operative MRI scans are registered to an atlas model that includes nerve information. Through several interactive linked views, the spatial relationships and distances between the organs, tumor and risk zones are visualized to improve understanding, while avoiding occlusion. In this way, the surgeon can examine surgically relevant structures and plan the procedure before going into the operating theater, thus raising awareness of the autonomic nerve zone regions and potentially reducing post-operative complications. Furthermore, we present the results of a domain expert evaluation with surgical oncologists that demonstrates the advantages of our approach.", "keywords": "Atlas;surgical planning;medical visualization", "link": "http://dx.doi.org/10.1109/TVCG.2016.2598826", "refList": ["10.1007/s11548-009-0359-1", "10.1109/tmi.2004.842454", "10.1109/tvcg.2011.189", "10.1007/s11263-008-0168-y", "10.1016/s0097-8493(02)00055-9", "10.1007/s00464-002-8877-8", "10.1109/visual.2003.1250400", "10.1109/tvcg.2013.143", "10.1109/tvcg.2015.2467961", "10.1109/tbme.2004.826606", "10.1145/300523.300526", "10.1016/j.ejca.2012.06.025", "10.1007/s11548-010-0410-2", "10.1109/tip.2009.2030955", "10.1002/bjs.5540", "10.1097/dcr.0000000000000171", "10.1016/0146-664x(80)90054-4", "10.1046/j.0007-1323.2001.02024.x", "10.1109/2945.597794", "10.1109/tvcg.2008.180", "10.2312/vcbm/vcbm10/025-032", "10.1016/j.ejca.2012.12.027", "10.1200/jco.2007.12.7027", "10.1016/j.media.2005.04.005", "10.1007/s00464-005-0855-5", "10.1111/j.1467-8659.2011.01930.x", "10.1109/tmi.2009.2035616", "10.1109/tvcg.2011.207", "10.1109/42.796284", "10.1002/ca.20275", "10.2214/ajr.182.2.1820431", "10.1109/visual.2002.1183769", "10.1007/s10151-013-1095-7", "10.1002/bjs.1800691019", "10.2312/egs.20031054", "10.1016/j.ejca.2008.12.014", "10.2312/compaesth/compaesth05/209-216", "10.1200/jco.2002.07.010", "10.1016/j.cmpb.2008.07.007", "10.1200/jco.2008.17.3062"], "wos": 1, "children": [{"doi": "10.1111/cgf.13173", "year": "2017", "title": "Overview + Detail Visualization for Ensembles of Diffusion Tensors", "conferenceName": "EuroVis", "authors": "Changgong Zhang;Matthan W. A. Caan;Thomas H{\\\"{o}}llt;Elmar Eisemann;Anna Vilanova", "citationCount": "5", "affiliation": "Zhang, C (Corresponding Author), Delft Univ Technol, Comp Graph \\& Visualizat, Delft, Netherlands.\nZhang, C.; Hollt, T.; Eisemann, E.; Vilanova, A., Delft Univ Technol, Comp Graph \\& Visualizat, Delft, Netherlands.\nCaan, M. W. A., Univ Amsterdam, Acad Med Ctr, Brain Imaging Ctr, Amsterdam, Netherlands.\nHollt, T., Leiden Univ, Computat Biol Ctr, Med Ctr, Leiden, Netherlands.", "countries": "Netherlands", "abstract": "A Diffusion Tensor Imaging (DTI) group study consists of a collection of volumetric diffusion tensor datasets (i.e., an ensemble) acquired from a group of subjects. The multivariate nature of the diffusion tensor imposes challenges on the analysis and the visualization. These challenges are commonly tackled by reducing the diffusion tensors to scalar-valued quantities that can be analyzed with common statistical tools. However, reducing tensors to scalars poses the risk of losing intrinsic information about the tensor. Visualization of tensor ensemble data without loss of information is still a largely unsolved problem. In this work, we propose an overview + detail visualization to facilitate the tensor ensemble exploration. We define an ensemble representative tensor and variations in terms of the three intrinsic tensor properties (i.e., scale, shape, and orientation) separately. The ensemble summary information is visually encoded into the newly designed aggregate tensor glyph which, in a spatial layout, functions as the overview. The aggregate tensor glyph guides the analyst to interesting areas that would need further detailed inspection. The detail views reveal the original information that is lost during aggregation. It helps the analyst to further understand the sources of variation and formulate hypotheses. To illustrate the applicability of our prototype, we compare with most relevant previous work through a user study and we present a case study on the analysis of a brain diffusion tensor dataset ensemble from healthy volunteers.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13173", "refList": ["10.1109/tvcg.2013.143", "10.1111/j.2044-8317.1972.tb00491.x", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2015.2467435", "10.1109/tmi.2003.815059", "10.1109/mcg.2007.323435", "10.1109/tmi.2007.907277", "10.1002/mrm.1910360612", "10.1109/icdmw.2009.55", "10.1111/cgf.12890", "10.1109/tvcg.2015.2467031", "10.1002/mrm.20741", "10.1002/mrm.20931", "10.1109/tvcg.2010.247", "10.1111/j.1467-8659.2009.01677.x", "10.1109/pacificvis.2009.4906851", "10.1111/j.1467-8659.2011.01944.x", "10.1109/tvcg.2013.92", "10.1109/vl.1996.545307", "10.1109/tvcg.2014.2346455", "10.1109/tvcg.2010.181", "10.1016/j.jmr.2011.09.022", "10.2312/envirvis.20161099", "10.1145/1980462.1980470", "10.1007/978-1-4471-6497-5\\_1", "10.1016/j.sigpro.2006.02.050", "10.2312/conf/eg2013/stars/039-063", "10.2312/vissym/vissym04/147-154", "10.1111/cgf.12935", "10.1006/nimg.2002.1148", "10.1109/pacificvis.2012.6183591", "10.1016/j.neuroimage.2010.12.008", "10.1016/j.neuroimage.2010.11.029", "10.1016/s0006-3495(94)80775-1", "10.1109/tvcg.2011.203", "10.1111/j.1467-8659.2009.01675.x", "10.1109/pacificvis.2011.5742374", "10.1016/j.neuroimage.2006.07.021", "10.1109/tvcg.2014.2307892", "10.1109/tvcg.2010.199", "10.1002/mrm.22365", "10.1002/(sici)1522-2594(199909)42:3", "10.1109/vast.2015.7347634", "10.1016/j.neuroimage.2011.11.094", "10.1109/tvcg.2014.2346325", "10.1109/mcg.2005.71", "10.1111/j.1467-8659.2011.01942.x", "10.1007/978-3-642-33418-4\\_61", "10.1002/mrm.21229", "10.1016/j.media.2006.06.004", "10.1109/tvcg.2016.2598826"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864825", "title": "EnsembleLens: Ensemble-based Visual Exploration of Anomaly Detection Algorithms with Multidimensional Data", "year": "2018", "conferenceName": "VAST", "authors": "Ke Xu;Meng Xia;Xing Mu;Yun Wang 0012;Nan Cao", "citationCount": "3", "affiliation": "Cao, N (Corresponding Author), Tongji Univ, IDVx Lab, Shanghai, Peoples R China. Xu, Ke; Xia, Meng; Mu, Xing; Wang, Yun, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Cao, Nan, Tongji Univ, IDVx Lab, Shanghai, Peoples R China.", "countries": "China", "abstract": "The results of anomaly detection are sensitive to the choice of detection algorithms as they are specialized for different properties of data, especially for multidimensional data. Thus, it is vital to select the algorithm appropriately. To systematically select the algorithms, ensemble analysis techniques have been developed to support the assembly and comparison of heterogeneous algorithms. However, challenges remain due to the absence of the ground truth, interpretation, or evaluation of these anomaly detectors. In this paper, we present a visual analytics system named EnsembleLens that evaluates anomaly detection algorithms based on the ensemble analysis process. The system visualizes the ensemble processes and results by a set of novel visual designs and multiple coordinated contextual views to meet the requirements of correlation analysis, assessment and reasoning of anomaly detection algorithms. We also introduce an interactive analysis workflow that dynamically produces contextualized and interpretable data summaries that allow further refinements of exploration results based on user feedback. We demonstrate the effectiveness of EnsembleLens through a quantitative evaluation, three case studies with real-world data and interviews with two domain experts.", "keywords": "Algorithm Evaluation,Ensemble Analysis,Anomaly Detection,Visual Analysis,Multidimensional Data", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864825", "refList": ["10.1109/icde.2011.5767916", "10.1007/978-1-4615-0953-0\\_4", "10.1109/tvcg.2017.2745178", "10.1016/j.inffus.2005.01.008", "10.1109/tvcg.2013.265", "10.1111/cgf.12898", "10.1109/tvcg.2015.2410278", "10.1371/journal.pone.0152173", "10.1145/1772690.1772749", "10.1109/tvcg.2017.2744419", "10.1109/icdmw.2009.55", "10.1023/b:aire.0000045502.10941.a9", "10.14778/1920841.1921021", "10.1007/s10462-009-9124-7", "10.1023/b:dami.0000023676.72185.7c", "10.1145/2890508", "10.2307/1412159", "10.1109/tvcg.2010.181", "10.1109/scivis.2015.7429487", "10.1109/wsc.2007.4419664", "10.1137/1.9781611972818.2", "10.1177/1473871616686635", "10.1002/sam.11161", "10.1109/mcg.2014.52", "10.1007/s007780050006", "10.1007/3-540-45014-9\\_1", "10.1109/icpr.2004.1334558", "10.1007/s10618-012-0300-z", "10.1109/intellisys.2015.7361141", "10.1007/978-3-642-12026-8\\_29", "10.1109/icdm.2008.17", "10.1109/pacificvis.2012.6183572", "10.1109/tvcg.2014.2346922", "10.1109/tpami.2005.237", "10.1007/s10115-007-0093-3", "10.1007/978-3-319-14142-8\\_8", "10.1109/cec.2002.1004386", "10.1016/s0167-7152(98)00006-6", "10.1137/1.9781611972825.90", "10.1145/956750.956758", "10.1111/1467-842x.00110", "10.1145/2830544.2830549", "10.1109/tvcg.2015.2468093", "10.1109/34.58871", "10.1145/1081870.1081891", "10.1111/cgf.12390", "10.1002/sam.v1:3", "10.2307/2332226", "10.1145/2481244.2481252", "10.1111/cgf.13173", "10.1109/tvcg.2014.2346448", "10.1007/978-4-431-68057-4\\_3", "10.1145/3097983.3098154", "10.1109/tvcg.2016.2598830", "10.1007/bf02289565", "10.1145/1541880.1541882", "10.1145/1961189.1961199"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030368", "title": "Implicit Multidimensional Projection of Local Subspaces", "year": "2020", "conferenceName": "InfoVis", "authors": "Rongzheng Bian;Yumeng Xue;Liang Zhou;Jian Zhang 0070;Baoquan Chen;Daniel Weiskopf;Yunhai Wang", "citationCount": "1", "affiliation": "Wang, YH (Corresponding Author), Shandong Univ, Qingdao, Peoples R China. Zhou, L (Corresponding Author), Univ Utah, Salt Lake City, UT 84112 USA. Bian, Rongzheng; Xue, Yumeng; Wang, Yunhai, Shandong Univ, Qingdao, Peoples R China. Chen, Baoquan, Peking Univ, Beijing, Peoples R China. Zhang, Jian, Chinese Acad Sci, CNIC, Beijing, Peoples R China. Zhou, Liang, Univ Utah, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "We propose a visualization method to understand the effect of multidimensional projection on local subspaces, using implicit function differentiation. Here, we understand the local subspace as the multidimensional local neighborhood of data points. Existing methods focus on the projection of multidimensional data points, and the neighborhood information is ignored. Our method is able to analyze the shape and directional information of the local subspace to gain more insights into the global structure of the data through the perception of local structures. Local subspaces are fitted by multidimensional ellipses that are spanned by basis vectors. An accurate and efficient vector transformation method is proposed based on analytical differentiation of multidimensional projections formulated as implicit functions. The results are visualized as glyphs and analyzed using a full set of specifically-designed interactions supported in our efficient web-based visualization tool. The usefulness of our method is demonstrated using various multi- and high-dimensional benchmark datasets. Our implicit differentiation vector transformation is evaluated through numerical comparisons; the overall method is evaluated through exploration examples and use cases.", "keywords": "High-dimensional data visualization,dimensionality reduction,local linear subspaces,user interaction", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030368", "refList": ["10.3844/jcssp.2018.613.622", "10.1016/j.aci.2018.08.003", "10.3390/info9030065", "10.1016/j.visinf.2018.09.003", "10.1371/journal.pone.0118432", "10.1016/s0893-6080(05)80023-1", "10.1109/tvcg.2020.2986996", "10.1109/icst.2012.56", "10.1007/s10844-013-0250-y", "10.1109/tbdata.2018", "10.1145/1125451.1125659", "10.1109/tvcg.2013.125", "10.1177/1473871611412817", "10.1145/3290605.3300911", "10.1111/cgf.14034", "10.1007/s13721-013-0034-x", "10.1016/j.procs.2017.05.216", "10.1016/j.ins.2009.08.025", "10.1109/tvcg.2013.124", "10.1109/tvcg.2018.2864499", "10.1109/tvcg.2018.2864475", "10.1080/10447318.2020.1741118", "10.1016/j.imu.2019.100203", "10.1109/tvcg.2018.2865240", "10.1186/s12864-019-6413-7", "10.1109/tvcg.2015.2467551", "10.1002/widm.1249", "10.1007/978-3-319-66429-3\\_29", "10.1109/tvcg.2014.2346481", "10.1109/tvcg.2018.2864825", "10.1177/1473871620904671", "10.1109/tvcg.2019.2934267", "10.1136/bmjopen-2016-012799", "10.1109/smartgridcomm.2017.8340682", "10.1007/s10664-015-9401-9", "10.1145/1143844.1143874", "10.1111/cgf.12389", "10.1109/tvcg.2018.2872577", "10.1007/978-981-13-5802-9\\_20", "10.1016/j.ipm.2009.03.002", "10.5220/0006431602160222", "10.1109/mcg.2015.50", "10.1109/tvcg.2014.2346574", "10.1007/bf02289565", "10.1109/tvcg.2017.2744378", "10.1016/j.patrec.2008.08.010", "10.1023/a:1010933404324", "10.9735/2229-3981"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13683", "year": "2019", "title": "Oui! Outlier Interpretation on Multi-dimensional Data via Visual Analytics", "conferenceName": "EuroVis", "authors": "Xun Zhao;Weiwei Cui;Yanhong Wu;Haidong Zhang;Huamin Qu;Dongmei Zhang", "citationCount": "1", "affiliation": "Zhao, X (Corresponding Author), Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China.\nZhao, Xun; Qui, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China.\nZhao, Xun; Cui, Weiwei; Zhang, Haidong; Zhang, Dongmei, Microsoft Res Asia, Beijing, Peoples R China.\nWu, Yanhong, Visa Res, Palo Alto, CA USA.", "countries": "USA;China", "abstract": "Outliers, the data instances that do not conform with normal patterns in a dataset, are widely studied in various domains, such as cybersecurity, social analysis, and public health. By detecting and analyzing outliers, users can either gain insights into abnormal patterns or purge the data of errors. However, different domains usually have different considerations with respect to outliers. Understanding the defining characteristics of outliers is essential for users to select and filter appropriate outliers based on their domain requirements. Unfortunately, most existing work focuses on the efficiency and accuracy of outlier detection, neglecting the importance of outlier interpretation. To address these issues, we propose Oui, a visual analytic system that helps users understand, interpret, and select the outliers detected by various algorithms. We also present a usage scenario on a real dataset and a qualitative user study to demonstrate the effectiveness and usefulness of our system.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13683", "refList": ["10.1007/978-3-642-40994-3\\_20", "10.1016/j.actpsy.2012.04.004", "10.1162/089976600300015565", "10.1371/journal.pone.0152173", "10.1007/s10462-004-4304-y", "10.1080/10618600.1996.10474696", "10.1109/iciea.2017.8282889", "10.1145/2858036.2858529", "10.1002/sam.11161", "10.1137/1.9781611972818.2", "10.1177/1473871616686635", "10.1145/2939672.2939778", "10.2307/2685478", "10.1145/335191.335437", "10.1007/bf01898350", "10.1007/978-3-642-21329-8\\_4", "10.1109/icdm.2008.17", "10.1109/tvcg.2011.201", "10.1109/tvcg.2014.2346248", "10.1109/tvcg.2018.2864825", "10.1145/2594473.2594476", "10.1109/tvcg.2017.2711030", "10.1145/335191.335388", "10.1109/tvcg.2015.2467196", "10.1214/aos/1013203451", "10.1016/s0004-3702(98)00082-4", "10.1007/978-3-642-04898-2\\_455", "10.1109/titb.2006.880553", "10.1007/978-3-319-91476-3\\_3", "10.1145/1401890.1401946", "10.1145/3097983.3098154", "10.1145/1541880.1541882", "10.1109/tvcg.2017.2744378", "10.1023/a:1010933404324"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030443", "title": "CAVA: A Visual Analytics System for Exploratory Columnar Data Augmentation Using Knowledge Graphs", "year": "2020", "conferenceName": "VAST", "authors": "Dylan Cashman;Shenyu Xu;Subhajit Das;Florian Heimerl;Cong Liu;Shah Rukh Humayoun;Michael Gleicher;Alex Endert;Remco Chang", "citationCount": "0", "affiliation": "Cashman, D (Corresponding Author), Tufts Univ, Medford, MA 02155 USA. Cashman, Dylan; Liu, Cong; Chang, Remco, Tufts Univ, Medford, MA 02155 USA. Xu, Shenyu; Das, Subhajit; Endert, Alex, Georgia Tech, Atlanta, GA USA. Heimerl, Florian; Gleicher, Michael, Univ Wisconsin, Madison, WI 53706 USA. Humayoun, Shah Rukh, San Francisco State Univ, San Francisco, CA 94132 USA.", "countries": "USA", "abstract": "Most visual analytics systems assume that all foraging for data happens before the analytics process; once analysis begins, the set of data attributes considered is fixed. Such separation of data construction from analysis precludes iteration that can enable foraging informed by the needs that arise in-situ during the analysis. The separation of the foraging loop from the data analysis tasks can limit the pace and scope of analysis. In this paper, we present CAVA, a system that integrates data curation and data augmentation with the traditional data exploration and analysis tasks, enabling information foraging in-situ during analysis. Identifying attributes to add to the dataset is difficult because it requires human knowledge to determine which available attributes will be helpful for the ensuing analytical tasks. CAVA crawls knowledge graphs to provide users with a a broad set of attributes drawn from external data to choose from. Users can then specify complex operations on knowledge graphs to construct additional attributes. CAVA shows how visual analytics can help users forage for attributes by letting users visually explore the set of available data, and by serving as an interface for query construction. It also provides visualizations of the knowledge graph itself to help users understand complex joins such as multi-hop aggregations. We assess the ability of our system to enable users to perform complex data combinations without programming in a user study over two datasets. We then demonstrate the generalizability of CAVA through two additional usage scenarios. The results of the evaluation confirm that CAVA is effective in helping the user perform data foraging that leads to improved analysis outcomes, and offer evidence in support of integrating data augmentation as a part of the visual analytics pipeline.", "keywords": "Visual Analytics,Information Foraging,Data Augmentation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030443", "refList": ["10.1057/palgrave.ivs.9500122", "10.1109/tvcg.2016.2598867", "10.1111/cgf.13708", "10.1109/tvcg.2019.2934799", "10.1109/tvcg.2019.2934541", "10.1109/tvcg.2013.65", "10.1109/tvcg.2018.2875702", "10.1109/iv.2004.1320207", "10.1068/p260471", "10.1145/1778765.1778816", "10.1109/tvcg.2018.2808489", "10.1109/tvcg.2018.2864912", "10.1016/j.apgeog.2015.12.006", "10.1111/j.1467-8659.2011.01960.x", "10.1109/tvcg.2018.2864843", "10.1109/pacificvis.2010.5429604", "10.1109/tvcg.2014.2346898", "10.1109/5.726791", "10.1177/1475090214540874", "10.1109/icde.2016.7498287", "10.1145/1556262.1556289", "10.1109/tvcg.2007.70535", "10.1109/vast.2012.6400489", "10.1145/1056808.1056914", "10.1016/j.neucom.2014.09.063", "10.1145/7529.8927", "10.1109/tvcg.2016.2598495", "10.1109/tvcg.2016.2607204", "10.1109/vast47406.2019.8986943", "10.3758/bf03205986", "10.1109/infvis.2005.1532142", "10.1145/1150402.1150479", "10.1109/tvcg.2017.2674978", "10.1109/tvcg.2019.2945960", "10.1109/tvcg.2017.2744098", "10.1109/tvcg.2017.2674999", "10.1109/tvcg.2011.279", "10.1109/tvcg.2014.2346594", "10.1109/tvcg.2017.2744184", "10.1111/cgf.12876", "10.1007/s4095-020-0191-7", "10.1007/s11390-015-1535-0", "10.1111/cgf.12640", "10.1109/tvcg.2016.2598667", "10.1111/cgf.13683", "10.1109/tvcg.2013.153", "10.1109/tvcg.2019.2934208", "10.1109/tvcg.2019.2934655", "10.1111/cgf.12655", "10.1007/s11023-010-9221-z", "10.1109/vast.2012.6400487", "10.1145/2702123.2702585", "10.1007/bf00310175", "10.1109/tvcg.2017.2744378", "10.1103/physreve.64.061907", "10.1109/ldav.2017.8231848", "10.1109/tvcg.2016.2598831"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030432", "title": "Evaluation of Sampling Methods for Scatterplots", "year": "2020", "conferenceName": "VAST", "authors": "Jun Yuan;Shouxing Xiang;Jiazhi Xia;Lingyun Yu;Shixia Liu", "citationCount": "0", "affiliation": "Liu, SX (Corresponding Author), Tsinghua Univ, BNRist, Beijing, Peoples R China. Yuan, Jun; Xiang, Shouxing; Liu, Shixia, Tsinghua Univ, BNRist, Beijing, Peoples R China. Xia, Jiazhi, Cent South Univ, Changsha, Peoples R China. Yu, Lingyun, Xian Jiaotong Liverpool Univ, Suzhou, Peoples R China.", "countries": "China", "abstract": "Given a scatterplot with tens of thousands of points or even more, a natural question is which sampling method should be used to create a small but “good” scatterplot for a better abstraction. We present the results of a user study that investigates the influence of different sampling strategies on multi-class scatterplots. The main goal of this study is to understand the capability of sampling methods in preserving the density, outliers, and overall shape of a scatterplot. To this end, we comprehensively review the literature and select seven typical sampling strategies as well as eight representative datasets. We then design four experiments to understand the performance of different strategies in maintaining: 1) region density; 2) class density; 3) outliers; and 4) overall shape in the sampling results. The results show that: 1) random sampling is preferred for preserving region density; 2) blue noise sampling and random sampling have comparable performance with the three multi-class sampling strategies in preserving class density; 3) outlier biased density based sampling, recursive subdivision based sampling, and blue noise sampling perform the best in keeping outliers; and 4) blue noise sampling outperforms the others in maintaining the overall shape of a scatterplot.", "keywords": "Scatterplot,data sampling,empirical evaluation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030432", "refList": ["10.1057/palgrave.ivs.9500122", "10.1109/tvcg.2016.2598867", "10.1109/tvcg.2015.2467591", "10.1111/cgf.13708", "10.1109/tvcg.2019.2934799", "10.1109/tvcg.2019.2934541", "10.1109/tvcg.2013.65", "10.1109/iv.2004.1320207", "10.1068/p260471", "10.1145/1778765.1778816", "10.1109/tvcg.2018.2808489", "10.1109/tvcg.2018.2864912", "10.1016/j.apgeog.2015.12.006", "10.1111/j.1467-8659.2011.01960.x", "10.1109/tvcg.2018.2864843", "10.1109/pacificvis.2010.5429604", "10.1109/tvcg.2014.2346898", "10.1109/5.726791", "10.1177/1475090214540874", "10.1145/1556262.1556289", "10.1109/tvcg.2007.70535", "10.1109/vast.2012.6400489", "10.1145/1056808.1056914", "10.1016/j.neucom.2014.09.063", "10.1145/7529.8927", "10.1109/tvcg.2016.2607204", "10.1109/vast47406.2019.8986943", "10.3758/bf03205986", "10.1109/infvis.2005.1532142", "10.1145/1150402.1150479", "10.1109/tvcg.2017.2674978", "10.1109/tvcg.2017.2744098", "10.1109/tvcg.2017.2674999", "10.1109/tvcg.2011.279", "10.1109/tvcg.2014.2346594", "10.1109/tvcg.2017.2744184", "10.1111/cgf.12876", "10.1109/1011101.2019.2945960", "10.1007/s4095-020-0191-7", "10.1007/s11390-015-1535-0", "10.1111/cgf.12640", "10.1109/tvcg.2016.2598667", "10.1111/cgf.13683", "10.1109/tvcg.2013.153", "10.1109/tvcg.2019.2934208", "10.1109/tvcg.2019.2934655", "10.1111/cgf.12655", "10.1007/s11023-010-9221-z", "10.1109/vast.2012.6400487", "10.1145/2702123.2702585", "10.1007/bf00310175", "10.1109/tvcg.2017.2744378", "10.1103/physreve.64.061907", "10.1109/ldav.2017.8231848", "10.1109/tvcg.2016.2598831"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.14034", "year": "2020", "title": "The State of the Art in Enhancing Trust in Machine Learning Models with the Use of Visualizations", "conferenceName": "EuroVis", "authors": "Angelos Chatzimparmpas;Rafael Messias Martins;Ilir Jusufi;Kostiantyn Kucher;Fabrice Rossi;Andreas Kerren", "citationCount": "2", "affiliation": "Chatzimparmpas, A (Corresponding Author), Linnaeus Univ, Dept Comp Sci \\& Media Technol, Vaxjo, Sweden.\nChatzimparmpas, A.; Martins, R. M.; Jusufi, I.; Kucher, K.; Kerren, A., Linnaeus Univ, Dept Comp Sci \\& Media Technol, Vaxjo, Sweden.\nRossi, F., PSL Univ, Univ Paris Dauphine, Ceremade, Paris, France.", "countries": "Sweden;France", "abstract": "Machine learning (ML) models are nowadays used in complex applications in various domains, such as medicine, bioinformatics, and other sciences. Due to their black box nature, however, it may sometimes be hard to understand and trust the results they provide. This has increased the demand for reliable visualization tools related to enhancing trust in ML models, which has become a prominent topic of research in the visualization community over the past decades. To provide an overview and present the frontiers of current research on the topic, we present a State-of-the-Art Report (STAR) on enhancing trust in ML models with the use of interactive visualization. We define and describe the background of the topic, introduce a categorization for visualization techniques that aim to accomplish this goal, and discuss insights and opportunities for future research directions. Among our contributions is a categorization of trust against different facets of interactive ML, expanded and improved from previous research. Our results are investigated from different analytical perspectives: (a) providing a statistical overview, (b) summarizing key findings, (c) performing topic analyses, and (d) exploring the data sets used in the individual papers, all with the support of an interactive web-based survey browser. We intend this survey to be beneficial for visualization researchers whose interests involve making ML models more trustworthy, as well as researchers and practitioners from other disciplines in their search for effective visualization techniques suitable for solving their tasks with confidence and conveying meaning to their data.", "keywords": "trustworthy machine learning; visualization; interpretable machine learning; explainable machine learning", "link": "https://doi.org/10.1111/cgf.14034", "refList": ["10.1109/mcg.2018.2878902", "10.1109/tvcg.2008.153", "10.2312/mlvis.20181130", "10.1109/tvcg.2016.2598828", "10.1145/3290605.3300911", "10.1145/2993901.2993909", "10.2312/mlvis.20191158", "10.1109/tvcg.2016.2598446", "10.1111/j.1467-8659.2009.01475.x", "10.1145/3290605.3300809", "10.1109/pacificvis.2018.00031", "10.1055/s-0029-1216348", "10.1007/978-3-319-90403-0\\_13", "10.1109/tvcg.2017.2745085", "10.1111/j.1467-8659.2011.01938.x", "10.1007/978-3-319-54024-5\\_6", "10.1016/s0167-9473(01)00065-2", "10.1111/cgf.12895", "10.2312/eurovisshort.20141152.17", "10.2312/eurova.20151098.22", "10.1111/cgf.13667", "10.3115/1072228.1072378", "10.1109/tbdata.2018.2877350.16", "10.1109/lars.2009.5418323.25", "10.1109/tvcg.2017.2744878", "10.1016/j.combustflame.2005.09.018", "10.1016/j.cag.2014.01.006", "10.1109/tvcg.2016.2570755", "10.2312/mlvis.20191158.1,19", "10.1518/hfes.46.1.50.30392", "10.1145/3301275.3302280", "10.1145/3351095.3372834.1", "10.1016/s0377-2217(01)00264-8", "10.1111/cgf.13424", "10.1007/978-3-319-23485-4\\_53", "10.1007/978-94-007-0753-5\\_3623", "10.1109/tvcg.2013.101", "10.1111/cgf.12884", "10.1111/j.1467-8659.2010.01835.x", "10.1021/ci9901338", "10.4230/lipics.itcs:2017", "10.1109/mis.2013.24", "10.1109/tvcg.2014.2346482", "10.1109/tvcg.2018.2865230", "10.1073/pnas.1807180116", "10.1109/dsaa.2018.00018", "10.1109/tvcg.2009.153", "10.3115/1219840.1219855", "10.1109/tvcg.2018.2864812", "10.1109/tvcg.2018.2872577", "10.2312/trvis.20191183", "10.1109/cvpr:2004.383", "10.1109/vast.2008.4677350", "10.1145/302979.303001", "10.1109/tvcg.2018.2864499", "10.1111/cgf.13672", "10.1109/tvcg.2014.2346626", "10.23915/distill.00010.18", "10.1109/tvcg.2017.2744805", "10.2312/mlvis:20191160.18", "10.23915/distill:00016", "10.1109/pacificvis.2016.7465260", "10.1111/cgf.13683", "10.23915/distill.00016.19", "10.1145/32906053.300803.22", "10.1109/tvcg.2014.2346574", "10.1177/1473871615600010", "10.1109/tvcg.2016.2598831", "10.1145/3230623", "10.1109/visual.2019.8933744", "10.1145/2993901.2993915", "10.1016/j.visinf.2017.01.006", "10.1145/2993901.2993914", "10.1109/tvcg.2014.2346984", "10.1109/5.726791", "10.23915/distill.00010", "10.1109/tvcg.2018.2864825", "10.2307/2394164", "10.1109/tvcg.2017.2744458", "10.1145/2993901.2993917.28", "10.1111/cgf.13711", "10.1109/tvcg.2016.2598664", "10.2307/2530428", "10.1109/icdar.1997.620583", "10.1109/tvcg.2017.2744718", "10.1111/cgf.13425", "10.1109/tvcg.2019.2903943", "10.1145/1518701.1518895", "10.1109/tvcg.2018.2864838", "10.1145/62038.62043", "10.1111/j.1467-8659.2011.01920.x", "10.1145/3025171.3025208", "10.1145/355112.355124", "10.1109/vast.2010.5652398", "10.1109/tvcg.2014.2346578", "10.1145/3173574.3174209", "10.4178/epih/e2014008", "10.1109/beliv.2018.8634201.25,28", "10.1016/j.eswa.2007.12.020", "10.1111/cgf:13406", "10.1109/mcg.2011.103", "10.1631/fitee.1700808", "10.1109/tvcg.2017.2745158", "10.1073/pnas.0307752101", "10.1109/tvcg.2018.2816223", "10.1109/tvcg.2017.2745141", "10.1145/32232.32234", "10.1109/tvcg.2019.2934267", "10.1109/tvcg.2018.2864477", "10.1145/3132169", "10.2312/eurova.20151100.19", "10.1145/3172944.3172964", "10.1145/2601248.2601268", "10.1109/isai-nlp.2018.8693002.1", "10.1111/cgf.13404", "10.1007/s100320200071", "10.2312/trvis.20191183.16", "10.1111/cgf.12755", "10.1145/2702123.2702509", "10.1145/1401890.1402008.25", "10.1109/tvcg.2012.65", "10.1177/1473871617733996", "10.2312/trvis.20191187.7", "10.21236/ada273556", "10.1109/vast.2010.5652450", "10.1111/j.1467-8659.2011.01940.x", "10.1177/875647939000600106", "10.1109/tvcg.2017.2711030", "10.1016/j.immuni.2016.04.014", "10.1109/tvcg.2019.2934209", "10.1016/0095-0696(78)90006-2", "10.1016/j.jclinepi.2015.04.014", "10.1016/j.ress.2013.02.013", "10.1111/cgf.12640", "10.1145/1015330.1015388.25", "10.1111/j.1467-8659.2009.01468.x", "10.1145/1541880.1541882", "10.1109/vast.2011.6102453", "10.1016/s0008-8846(98)00165-3", "10.2312/trvis.20191186.7", "10.1007/s13748-013-0040-3", "10.1109/tvcg.2015.2467757", "10.1109/tbdata.2018.2877350", "10.1109/vast.2017.8585613", "10.1080/10556789208805504", "10.1109/vast.2012.6400484", "10.1145/3025171.3025181", "10.1007/978-3-319-90403-0\\_12", "10.1109/mcg.2019.2922592", "10.1021/ci000392t", "10.1109/vast.2007.4389000", "10.1111/cgf.13406.16", "10.1111/cgf.13684", "10.2312/eurovisshort.20161166.17", "10.2312/evs:20191168", "10.1145/3041021.3055135", "10.1145/3301275.3302265", "10.1613/jair.4135", "10.1109/tvcg.2018.2864500", "10.1109/tvcg.2017.2744158", "10.1109/ssci.2015.33", "10.1111/cgf.13453", "10.2312/pe/eurovast/eurova11/049-052", "10.1145/3025171.3025181.13", "10.1145/371920.372094", "10.1109/tvcg.2017.2744938", "10.1111/j.1467-8659.2012.03108.x", "10.1109/tvcg.2019.2934251", "10.1145/3290605.3300809.18", "10.1109/ldav.2016.7874305", "10.1109/vast.2016.7883514", "10.1109/iccv.2015.425", "10.1145/3301275.3302324", "10.1109/tnnls.2013.2292894", "10.1109/tvcg.2018.2865044", "10.1109/tvcg.2013.157", "10.1371/journal.pcbi.0020161", "10.1186/s12916-019-1426-2", "10.1109/10.867928", "10.1111/cgf.13217", "10.1109/mcg.2019.2919033", "10.1145/2993901.2993910", "10.1109/tvcg.2017.2744738", "10.2307/258792", "10.1111/cgf.12655", "10.1016/j.dss.2014.03.001", "10.1109/tvcg.2019.2904069", "10.1111/cgf.13205", "10.1002/mds.22340", "10.1109/tvcg.2019.2934595", "10.1287/inte.2018.0957", "10.1109/cvpr.2007.382974", "10.1109/tvcg.2012.280", "10.1145/2678025.2701399.13", "10.2312/mlvis.20181130.13", "10.2312/eurova.20181106.16", "10.1109/tvcg.2018.2864475", "10.2312/mlvis.20191160.18,22", "10.1007/978-1-4612-4026-6.25", "10.1109/cvpr.2006.42", "10.1145/3172944.3172950", "10.1109/cvpr.2004.383.25", "10.1109/tvcg.2019.2934812", "10.1609/aimag.v35i4.2513", "10.2312/trvis.20191185.7", "10.1111/j.1467-8659.2009.01684.x", "10.1371/journal.pone.0129126", "10.1111/cgf.13092", "10.1162/coli\\_a\\_00237", "10.1109/tvcg.2017.2744818", "10.1109/vast.2011.6102448", "10.1109/tvcg.2009.111", "10.1109/tvcg.2019.2934619", "10.1016/s0377-2217(01)00264-8.25", "10.1111/cgf.12639", "10.1109/access.2019.2919343", "10.1186/s12874-019-0681-4", "10.1109/pacificvis.2015.7156366", "10.1109/pacificvis.2018.00029", "10.1109/tvcg.2019.2934261", "10.1080/13506280444000102.http://www.uvt.nl/ticc", "10.1109/vast.2018.8802509", "10.1111/cgf.13212", "10.1145/3200489", "10.1111/cgf.13176", "10.1177/1473871620904671", "10.1007/978-3-319-10590-1\\_53", "10.1111/j.1467-8659.2012.03126.x", "10.1111/cgf.13172", "10.1145/3025171.3025208.6,21", "10.1111/cgf.12366", "10.1109/tvcg.2019.2934659", "10.1109/cvprw.2009.5206848", "10.1016/j.media.2014.11.010", "10.1109/tvcg.2017.2744683", "10.1109/tvcg.2019.2934262", "10.1016/j.neucom.2006.11.018", "10.1177/1473871615571951", "10.1371/journal.pcbi.0020161.25", "10.1177/1473871611415994", "10.2312/trvis20191187", "10.2312/eurova", "10.1145/2858036.2858529", "10.1145/2207676.2207738", "10.1007/s11042-009-0417-2", "10.1145/3301275.3302317", "10.1038/s41746-019-0148-3", "10.1145/3351095.3372834", "10.1080/10691898.2011.11889627", "10.1109/tvcg.2018.2864504", "10.1109/vast.2017.8585720", "10.1109/mcg.2018.053491732", "10.1007/s10994-010-5207-6", "10.1109/tvcg.2019.2934433", "10.1016/j.cag.2017.05.005", "10.1109/tvcg.2012.279", "10.1145/3231622.3231641.19,20", "10.1145/1562849.1562851", "10.1007/11564126\\_", "10.1109/tvcg.2018.2846735", "10.3115/1225403.1225421", "10.1109/vast.2012.6400486", "10.2312/eurova.20191116.22", "10.1109/tvcg.2007.70443", "10.1080/027868291009242", "10.2312/eurova.20151100", "10.1145/2939502.2939503.19", "10.1016/j.cag.2014.02.004", "10.1145/2939672.2939778", "10.1109/vast.2010.5652484", "10.1111/cgf.12641", "10.1145/3301275.3302289", "10.1109/visual.2019.8933619", "10.1109/tvcg.2017.2672987", "10.1109/vast.2016.7883517.20", "10.1109/igarss.2017.8127684", "10.1016/j.jcae.2010.04.002", "10.1109/vast.2010.5652885", "10.1016/j.visinf.2019.03.002", "10.1007/s00371-018-1500-3", "10.1109/mcg.2018.042731661", "10.1109/34.598228", "10.1109/tvcg.2018.2865027", "10.1016/j.neucom.2017.01.105", "10.1111/cgf.12389", "10.1109/tvcg.2019.2934591", "10.1109/vast.2010.5652392.16", "10.1111/cgf.13416", "10.1080/02701367.1992.10608764", "10.1109/vast.2017.8585721", "10.1109/tvcg.2018.2843369", "10.1109/sbes.2010.27", "10.1109/vast.2015.7347637", "10.1145/1401890.1402008", "10.1016/j.bpj.2010.04.064", "10.1109/tvcg.2013.125", "10.1109/isai-nlp.2018.8693002", "10.1371/journal.pone.0160127", "10.1145/2856767.2856779", "10.1145/2678025.2701399", "10.1109/vast.2011.6102451", "10.1109/mcg.2010.18", "10.1021/ci4000213", "10.1109/vast.2012.6400492", "10.1007/11564126-49.25", "10.2312/eurova.20171114", "10.1109/vast.2010.5652443", "10.1145/3134599", "10.2312/pe/eurovast/eurovast10/013-018.19", "10.1109/tvcg.2019.2903946", "10.1109/tvcg.2015.2467717", "10.1177/1473871612460526", "10.1016/j.cag.2018.09.018", "10.1109/tvcg.2016.2598838", "10.1145/3172944.3172964.14", "10.1109/vast.2009.5333428", "10.1109/vast.2014.7042480", "10.2312/pe/eurovast/eurovast10/013-018", "10.1177/0962280215588241", "10.1145/2993901.2993917", "10.1109/cvpr.2008:4587581", "10.1109/tvcg.2015.2467551", "10.1016/j.visinf.2018.09.001", "10.1126/science.290.5500.2319", "10.2312/eurova.20151107", "10.1109/visual.2019.8933695", "10.13140/2.1.2393.1847", "10.1197/jamia.m1929", "10.1109/cvpr.2008.4587581.25", "10.1145/1518701.1518895.16", "10.1109/vds.2017.8573444", "10.2312/trvis:20191185", "10.1145/3359786", "10.13140/2.1.1341.1520", "10.2312/pe/eurovast/eurova11/049-052.17", "10.1109/tvcg.2014.2346660", "10.1145/3185517", "10.1109/adprl.2011.5967372", "10.1109/tvcg.2015.2467591", "10.1111/j.1751-9004.2009.00232.x", "10.1136/qshc.2004.010033", "10.1109/vast.2012.6400493", "10.1109/tvcg.2019.2934266", "10.1145/2971763.2971775", "10.1111/cgf.13730", "10.1109/vast.2012.6400488", "10.1111/cgf.13210", "10.1109/tvcg.2019.2934631", "10.1145/3172944.3172965", "10.1057/ivs.2010.2", "10.1109/tvcg.2017.2745258", "10.1016/j.jbusres.2019.07.039", "10.1162/jmlr.2003.3.4-5.993", "10.1109/pacificvis.2019.00044", "10.2312/pe/eurovast/eurova12/037-041", "10.1109/tvcg.2019.2934629", "10.1177/0018720814547570", "10.1145/3292500.3330908", "10.1111/j.1467-8659.2009.01467.x", "10.2312/eurova.20151098", "10.1177/1473871617713337", "10.1109/lars:2009.5418323", "10.1109/vast.2011.6102437", "10.1111/cgf.12878", "10.1561/1500000001", "10.1145/3025171.3025222", "10.1007/s11704-016-6028-y", "10.1016/j.procs.2017.05.216", "10.1109/cvpr.2007.382974.25", "10.1080/10447318.2020.1741118", "10.1109/vast.2012.6400489", "10.1145/3025171.3025172", "10.1109/tvcg.2017.2744098", "10.1109/tvcg.2005.66", "10.1016/j.dss.2009.05.016", "10.1007/978-1-4612-4026-6", "10.2312/evs.20191168.16,20,28", "10.2312/pe/eurovast/eurova12/037-041.17", "10.1145/3290605.3300803", "10.1145/1015330.1015388", "10.1111/cgf.13197", "10.1016/b978-1-55860-377-6.50048-7", "10.1111/cgf.13681", "10.1109/tvcg.2017.2744378", "10.1109/tvcg.2017.2744358", "10.1109/vast.2008.4677352"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030368", "title": "Implicit Multidimensional Projection of Local Subspaces", "year": "2020", "conferenceName": "InfoVis", "authors": "Rongzheng Bian;Yumeng Xue;Liang Zhou;Jian Zhang 0070;Baoquan Chen;Daniel Weiskopf;Yunhai Wang", "citationCount": "1", "affiliation": "Wang, YH (Corresponding Author), Shandong Univ, Qingdao, Peoples R China. Zhou, L (Corresponding Author), Univ Utah, Salt Lake City, UT 84112 USA. Bian, Rongzheng; Xue, Yumeng; Wang, Yunhai, Shandong Univ, Qingdao, Peoples R China. Chen, Baoquan, Peking Univ, Beijing, Peoples R China. Zhang, Jian, Chinese Acad Sci, CNIC, Beijing, Peoples R China. Zhou, Liang, Univ Utah, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "We propose a visualization method to understand the effect of multidimensional projection on local subspaces, using implicit function differentiation. Here, we understand the local subspace as the multidimensional local neighborhood of data points. Existing methods focus on the projection of multidimensional data points, and the neighborhood information is ignored. Our method is able to analyze the shape and directional information of the local subspace to gain more insights into the global structure of the data through the perception of local structures. Local subspaces are fitted by multidimensional ellipses that are spanned by basis vectors. An accurate and efficient vector transformation method is proposed based on analytical differentiation of multidimensional projections formulated as implicit functions. The results are visualized as glyphs and analyzed using a full set of specifically-designed interactions supported in our efficient web-based visualization tool. The usefulness of our method is demonstrated using various multi- and high-dimensional benchmark datasets. Our implicit differentiation vector transformation is evaluated through numerical comparisons; the overall method is evaluated through exploration examples and use cases.", "keywords": "High-dimensional data visualization,dimensionality reduction,local linear subspaces,user interaction", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030368", "refList": ["10.3844/jcssp.2018.613.622", "10.1016/j.aci.2018.08.003", "10.3390/info9030065", "10.1016/j.visinf.2018.09.003", "10.1371/journal.pone.0118432", "10.1016/s0893-6080(05)80023-1", "10.1109/tvcg.2020.2986996", "10.1109/icst.2012.56", "10.1007/s10844-013-0250-y", "10.1109/tbdata.2018", "10.1145/1125451.1125659", "10.1109/tvcg.2013.125", "10.1177/1473871611412817", "10.1145/3290605.3300911", "10.1111/cgf.14034", "10.1007/s13721-013-0034-x", "10.1016/j.procs.2017.05.216", "10.1016/j.ins.2009.08.025", "10.1109/tvcg.2013.124", "10.1109/tvcg.2018.2864499", "10.1109/tvcg.2018.2864475", "10.1080/10447318.2020.1741118", "10.1016/j.imu.2019.100203", "10.1109/tvcg.2018.2865240", "10.1186/s12864-019-6413-7", "10.1109/tvcg.2015.2467551", "10.1002/widm.1249", "10.1007/978-3-319-66429-3\\_29", "10.1109/tvcg.2014.2346481", "10.1109/tvcg.2018.2864825", "10.1177/1473871620904671", "10.1109/tvcg.2019.2934267", "10.1136/bmjopen-2016-012799", "10.1109/smartgridcomm.2017.8340682", "10.1007/s10664-015-9401-9", "10.1145/1143844.1143874", "10.1111/cgf.12389", "10.1109/tvcg.2018.2872577", "10.1007/978-981-13-5802-9\\_20", "10.1016/j.ipm.2009.03.002", "10.5220/0006431602160222", "10.1109/mcg.2015.50", "10.1109/tvcg.2014.2346574", "10.1007/bf02289565", "10.1109/tvcg.2017.2744378", "10.1016/j.patrec.2008.08.010", "10.1023/a:1010933404324", "10.9735/2229-3981"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030465", "title": "Visual Causality Analysis of Event Sequence Data", "year": "2020", "conferenceName": "VAST", "authors": "Zhuochen Jin;Shunan Guo;Nan Chen;Daniel Weiskopf;David Gotz;Nan Cao", "citationCount": "0", "affiliation": "Cao, N (Corresponding Author), Tongji Univ, IDVx Lab, Shanghai, Peoples R China. Jin, Zhuochen; Guo, Shunan; Chen, Nan; Cao, Nan, Tongji Univ, IDVx Lab, Shanghai, Peoples R China. Weiskopf, Daniel, Univ Stuttgart, Stuttgart, Germany. Gotz, David, Univ N Carolina, Chapel Hill, NC 27515 USA.", "countries": "USA;Germany;China", "abstract": "Causality is crucial to understanding the mechanisms behind complex systems and making decisions that lead to intended outcomes. Event sequence data is widely collected from many real-world processes, such as electronic health records, web clickstreams, and financial transactions, which transmit a great deal of information reflecting the causal relations among event types. Unfortunately, recovering causalities from observational event sequences is challenging, as the heterogeneous and high-dimensional event variables are often connected to rather complex underlying event excitation mechanisms that are hard to infer from limited observations. Many existing automated causal analysis techniques suffer from poor explainability and fail to include an adequate amount of human knowledge. In this paper, we introduce a visual analytics method for recovering causalities in event sequence data. We extend the Granger causality analysis algorithm on Hawkes processes to incorporate user feedback into causal model refinement. The visualization system includes an interactive causal analysis framework that supports bottom-up causal exploration, iterative causal verification and refinement, and causal comparison through a set of novel visualizations and interactions. We report two forms of evaluation: a quantitative evaluation of the model improvements resulting from the user-feedback mechanism, and a qualitative evaluation through case studies in different application domains to demonstrate the usefulness of the system.", "keywords": "Event sequence data,causality analysis,visual analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030465", "refList": ["10.5555/1642718", "10.1109/tvcg.2018.2865022", "10.5555/2074094.2074151", "10.1109/tvcg.2016.2618797", "10.1073/pnas.1320645111", "10.1109/tvcg.2017.2744843", "10.1109/iv.2017.69", "10.1109/tvcg.2019.2934399", "10.1145/3172944.3173007", "10.5555/1795555", "10.1109/mcg.2005.102", "10.1145/381641.381653", "10.1162/153244301753344614", "10.1111/cgf.14034", "10.1111/cgf.13198", "10.1017/cbo9780511519857", "10.1007/s10462-016-9475-9", "10.1075/ssol.2.2.07bor", "10.1007/978-1-4614-3223-4\\_3", "10.1109/infvis.2003.1249025", "10.1007/978-94-007-6094-313", "10.1145/2858036.2858387", "10.1109/tvcg.2007.70528", "10.1109/tvcg.2017.2674958", "10.1147/sj.454.0801", "10.1109/tvcg.2013.119", "10.1145/3173574.3173711", "10.1016/j.erss.2017.06.034", "10.1109/visual.2019.8933695", "10.1007/s11665-016-2173-6", "10.1016/0377-0427(87)90125-7", "10.2307/3601125", "10.1016/b978-0-444-88738-2.50018-x", "10.1109/mcg.2006.70", "10.1109/tvcg.2018.2865145", "10.1017/s1351324997001502", "10.1109/tvcg.2010.179", "10.1214/aos/1176344552", "10.1109/mcg.2009.22", "10.1007/978-3-319-26633-6\\_13", "10.1080/10447318.2014.905422", "10.1016/j.visinf.2019.03.004", "10.1057/palgrave.ivs.9500074", "10.1007/978-1-4614-3223-4"], "wos": 1, "children": [], "len": 1}], "len": 5}], "len": 11}, {"doi": "10.1111/cgf.14034", "year": "2020", "title": "The State of the Art in Enhancing Trust in Machine Learning Models with the Use of Visualizations", "conferenceName": "EuroVis", "authors": "Angelos Chatzimparmpas;Rafael Messias Martins;Ilir Jusufi;Kostiantyn Kucher;Fabrice Rossi;Andreas Kerren", "citationCount": "2", "affiliation": "Chatzimparmpas, A (Corresponding Author), Linnaeus Univ, Dept Comp Sci \\& Media Technol, Vaxjo, Sweden.\nChatzimparmpas, A.; Martins, R. M.; Jusufi, I.; Kucher, K.; Kerren, A., Linnaeus Univ, Dept Comp Sci \\& Media Technol, Vaxjo, Sweden.\nRossi, F., PSL Univ, Univ Paris Dauphine, Ceremade, Paris, France.", "countries": "Sweden;France", "abstract": "Machine learning (ML) models are nowadays used in complex applications in various domains, such as medicine, bioinformatics, and other sciences. Due to their black box nature, however, it may sometimes be hard to understand and trust the results they provide. This has increased the demand for reliable visualization tools related to enhancing trust in ML models, which has become a prominent topic of research in the visualization community over the past decades. To provide an overview and present the frontiers of current research on the topic, we present a State-of-the-Art Report (STAR) on enhancing trust in ML models with the use of interactive visualization. We define and describe the background of the topic, introduce a categorization for visualization techniques that aim to accomplish this goal, and discuss insights and opportunities for future research directions. Among our contributions is a categorization of trust against different facets of interactive ML, expanded and improved from previous research. Our results are investigated from different analytical perspectives: (a) providing a statistical overview, (b) summarizing key findings, (c) performing topic analyses, and (d) exploring the data sets used in the individual papers, all with the support of an interactive web-based survey browser. We intend this survey to be beneficial for visualization researchers whose interests involve making ML models more trustworthy, as well as researchers and practitioners from other disciplines in their search for effective visualization techniques suitable for solving their tasks with confidence and conveying meaning to their data.", "keywords": "trustworthy machine learning; visualization; interpretable machine learning; explainable machine learning", "link": "https://doi.org/10.1111/cgf.14034", "refList": ["10.1109/mcg.2018.2878902", "10.1109/tvcg.2008.153", "10.2312/mlvis.20181130", "10.1109/tvcg.2016.2598828", "10.1145/3290605.3300911", "10.1145/2993901.2993909", "10.2312/mlvis.20191158", "10.1109/tvcg.2016.2598446", "10.1111/j.1467-8659.2009.01475.x", "10.1145/3290605.3300809", "10.1109/pacificvis.2018.00031", "10.1055/s-0029-1216348", "10.1007/978-3-319-90403-0\\_13", "10.1109/tvcg.2017.2745085", "10.1111/j.1467-8659.2011.01938.x", "10.1007/978-3-319-54024-5\\_6", "10.1016/s0167-9473(01)00065-2", "10.1111/cgf.12895", "10.2312/eurovisshort.20141152.17", "10.2312/eurova.20151098.22", "10.1111/cgf.13667", "10.3115/1072228.1072378", "10.1109/tbdata.2018.2877350.16", "10.1109/lars.2009.5418323.25", "10.1109/tvcg.2017.2744878", "10.1016/j.combustflame.2005.09.018", "10.1016/j.cag.2014.01.006", "10.1109/tvcg.2016.2570755", "10.2312/mlvis.20191158.1,19", "10.1518/hfes.46.1.50.30392", "10.1145/3301275.3302280", "10.1145/3351095.3372834.1", "10.1016/s0377-2217(01)00264-8", "10.1111/cgf.13424", "10.1007/978-3-319-23485-4\\_53", "10.1007/978-94-007-0753-5\\_3623", "10.1109/tvcg.2013.101", "10.1111/cgf.12884", "10.1111/j.1467-8659.2010.01835.x", "10.1021/ci9901338", "10.4230/lipics.itcs:2017", "10.1109/mis.2013.24", "10.1109/tvcg.2014.2346482", "10.1109/tvcg.2018.2865230", "10.1073/pnas.1807180116", "10.1109/dsaa.2018.00018", "10.1109/tvcg.2009.153", "10.3115/1219840.1219855", "10.1109/tvcg.2018.2864812", "10.1109/tvcg.2018.2872577", "10.2312/trvis.20191183", "10.1109/cvpr:2004.383", "10.1109/vast.2008.4677350", "10.1145/302979.303001", "10.1109/tvcg.2018.2864499", "10.1111/cgf.13672", "10.1109/tvcg.2014.2346626", "10.23915/distill.00010.18", "10.1109/tvcg.2017.2744805", "10.2312/mlvis:20191160.18", "10.23915/distill:00016", "10.1109/pacificvis.2016.7465260", "10.1111/cgf.13683", "10.23915/distill.00016.19", "10.1145/32906053.300803.22", "10.1109/tvcg.2014.2346574", "10.1177/1473871615600010", "10.1109/tvcg.2016.2598831", "10.1145/3230623", "10.1109/visual.2019.8933744", "10.1145/2993901.2993915", "10.1016/j.visinf.2017.01.006", "10.1145/2993901.2993914", "10.1109/tvcg.2014.2346984", "10.1109/5.726791", "10.23915/distill.00010", "10.1109/tvcg.2018.2864825", "10.2307/2394164", "10.1109/tvcg.2017.2744458", "10.1145/2993901.2993917.28", "10.1111/cgf.13711", "10.1109/tvcg.2016.2598664", "10.2307/2530428", "10.1109/icdar.1997.620583", "10.1109/tvcg.2017.2744718", "10.1111/cgf.13425", "10.1109/tvcg.2019.2903943", "10.1145/1518701.1518895", "10.1109/tvcg.2018.2864838", "10.1145/62038.62043", "10.1111/j.1467-8659.2011.01920.x", "10.1145/3025171.3025208", "10.1145/355112.355124", "10.1109/vast.2010.5652398", "10.1109/tvcg.2014.2346578", "10.1145/3173574.3174209", "10.4178/epih/e2014008", "10.1109/beliv.2018.8634201.25,28", "10.1016/j.eswa.2007.12.020", "10.1111/cgf:13406", "10.1109/mcg.2011.103", "10.1631/fitee.1700808", "10.1109/tvcg.2017.2745158", "10.1073/pnas.0307752101", "10.1109/tvcg.2018.2816223", "10.1109/tvcg.2017.2745141", "10.1145/32232.32234", "10.1109/tvcg.2019.2934267", "10.1109/tvcg.2018.2864477", "10.1145/3132169", "10.2312/eurova.20151100.19", "10.1145/3172944.3172964", "10.1145/2601248.2601268", "10.1109/isai-nlp.2018.8693002.1", "10.1111/cgf.13404", "10.1007/s100320200071", "10.2312/trvis.20191183.16", "10.1111/cgf.12755", "10.1145/2702123.2702509", "10.1145/1401890.1402008.25", "10.1109/tvcg.2012.65", "10.1177/1473871617733996", "10.2312/trvis.20191187.7", "10.21236/ada273556", "10.1109/vast.2010.5652450", "10.1111/j.1467-8659.2011.01940.x", "10.1177/875647939000600106", "10.1109/tvcg.2017.2711030", "10.1016/j.immuni.2016.04.014", "10.1109/tvcg.2019.2934209", "10.1016/0095-0696(78)90006-2", "10.1016/j.jclinepi.2015.04.014", "10.1016/j.ress.2013.02.013", "10.1111/cgf.12640", "10.1145/1015330.1015388.25", "10.1111/j.1467-8659.2009.01468.x", "10.1145/1541880.1541882", "10.1109/vast.2011.6102453", "10.1016/s0008-8846(98)00165-3", "10.2312/trvis.20191186.7", "10.1007/s13748-013-0040-3", "10.1109/tvcg.2015.2467757", "10.1109/tbdata.2018.2877350", "10.1109/vast.2017.8585613", "10.1080/10556789208805504", "10.1109/vast.2012.6400484", "10.1145/3025171.3025181", "10.1007/978-3-319-90403-0\\_12", "10.1109/mcg.2019.2922592", "10.1021/ci000392t", "10.1109/vast.2007.4389000", "10.1111/cgf.13406.16", "10.1111/cgf.13684", "10.2312/eurovisshort.20161166.17", "10.2312/evs:20191168", "10.1145/3041021.3055135", "10.1145/3301275.3302265", "10.1613/jair.4135", "10.1109/tvcg.2018.2864500", "10.1109/tvcg.2017.2744158", "10.1109/ssci.2015.33", "10.1111/cgf.13453", "10.2312/pe/eurovast/eurova11/049-052", "10.1145/3025171.3025181.13", "10.1145/371920.372094", "10.1109/tvcg.2017.2744938", "10.1111/j.1467-8659.2012.03108.x", "10.1109/tvcg.2019.2934251", "10.1145/3290605.3300809.18", "10.1109/ldav.2016.7874305", "10.1109/vast.2016.7883514", "10.1109/iccv.2015.425", "10.1145/3301275.3302324", "10.1109/tnnls.2013.2292894", "10.1109/tvcg.2018.2865044", "10.1109/tvcg.2013.157", "10.1371/journal.pcbi.0020161", "10.1186/s12916-019-1426-2", "10.1109/10.867928", "10.1111/cgf.13217", "10.1109/mcg.2019.2919033", "10.1145/2993901.2993910", "10.1109/tvcg.2017.2744738", "10.2307/258792", "10.1111/cgf.12655", "10.1016/j.dss.2014.03.001", "10.1109/tvcg.2019.2904069", "10.1111/cgf.13205", "10.1002/mds.22340", "10.1109/tvcg.2019.2934595", "10.1287/inte.2018.0957", "10.1109/cvpr.2007.382974", "10.1109/tvcg.2012.280", "10.1145/2678025.2701399.13", "10.2312/mlvis.20181130.13", "10.2312/eurova.20181106.16", "10.1109/tvcg.2018.2864475", "10.2312/mlvis.20191160.18,22", "10.1007/978-1-4612-4026-6.25", "10.1109/cvpr.2006.42", "10.1145/3172944.3172950", "10.1109/cvpr.2004.383.25", "10.1109/tvcg.2019.2934812", "10.1609/aimag.v35i4.2513", "10.2312/trvis.20191185.7", "10.1111/j.1467-8659.2009.01684.x", "10.1371/journal.pone.0129126", "10.1111/cgf.13092", "10.1162/coli\\_a\\_00237", "10.1109/tvcg.2017.2744818", "10.1109/vast.2011.6102448", "10.1109/tvcg.2009.111", "10.1109/tvcg.2019.2934619", "10.1016/s0377-2217(01)00264-8.25", "10.1111/cgf.12639", "10.1109/access.2019.2919343", "10.1186/s12874-019-0681-4", "10.1109/pacificvis.2015.7156366", "10.1109/pacificvis.2018.00029", "10.1109/tvcg.2019.2934261", "10.1080/13506280444000102.http://www.uvt.nl/ticc", "10.1109/vast.2018.8802509", "10.1111/cgf.13212", "10.1145/3200489", "10.1111/cgf.13176", "10.1177/1473871620904671", "10.1007/978-3-319-10590-1\\_53", "10.1111/j.1467-8659.2012.03126.x", "10.1111/cgf.13172", "10.1145/3025171.3025208.6,21", "10.1111/cgf.12366", "10.1109/tvcg.2019.2934659", "10.1109/cvprw.2009.5206848", "10.1016/j.media.2014.11.010", "10.1109/tvcg.2017.2744683", "10.1109/tvcg.2019.2934262", "10.1016/j.neucom.2006.11.018", "10.1177/1473871615571951", "10.1371/journal.pcbi.0020161.25", "10.1177/1473871611415994", "10.2312/trvis20191187", "10.2312/eurova", "10.1145/2858036.2858529", "10.1145/2207676.2207738", "10.1007/s11042-009-0417-2", "10.1145/3301275.3302317", "10.1038/s41746-019-0148-3", "10.1145/3351095.3372834", "10.1080/10691898.2011.11889627", "10.1109/tvcg.2018.2864504", "10.1109/vast.2017.8585720", "10.1109/mcg.2018.053491732", "10.1007/s10994-010-5207-6", "10.1109/tvcg.2019.2934433", "10.1016/j.cag.2017.05.005", "10.1109/tvcg.2012.279", "10.1145/3231622.3231641.19,20", "10.1145/1562849.1562851", "10.1007/11564126\\_", "10.1109/tvcg.2018.2846735", "10.3115/1225403.1225421", "10.1109/vast.2012.6400486", "10.2312/eurova.20191116.22", "10.1109/tvcg.2007.70443", "10.1080/027868291009242", "10.2312/eurova.20151100", "10.1145/2939502.2939503.19", "10.1016/j.cag.2014.02.004", "10.1145/2939672.2939778", "10.1109/vast.2010.5652484", "10.1111/cgf.12641", "10.1145/3301275.3302289", "10.1109/visual.2019.8933619", "10.1109/tvcg.2017.2672987", "10.1109/vast.2016.7883517.20", "10.1109/igarss.2017.8127684", "10.1016/j.jcae.2010.04.002", "10.1109/vast.2010.5652885", "10.1016/j.visinf.2019.03.002", "10.1007/s00371-018-1500-3", "10.1109/mcg.2018.042731661", "10.1109/34.598228", "10.1109/tvcg.2018.2865027", "10.1016/j.neucom.2017.01.105", "10.1111/cgf.12389", "10.1109/tvcg.2019.2934591", "10.1109/vast.2010.5652392.16", "10.1111/cgf.13416", "10.1080/02701367.1992.10608764", "10.1109/vast.2017.8585721", "10.1109/tvcg.2018.2843369", "10.1109/sbes.2010.27", "10.1109/vast.2015.7347637", "10.1145/1401890.1402008", "10.1016/j.bpj.2010.04.064", "10.1109/tvcg.2013.125", "10.1109/isai-nlp.2018.8693002", "10.1371/journal.pone.0160127", "10.1145/2856767.2856779", "10.1145/2678025.2701399", "10.1109/vast.2011.6102451", "10.1109/mcg.2010.18", "10.1021/ci4000213", "10.1109/vast.2012.6400492", "10.1007/11564126-49.25", "10.2312/eurova.20171114", "10.1109/vast.2010.5652443", "10.1145/3134599", "10.2312/pe/eurovast/eurovast10/013-018.19", "10.1109/tvcg.2019.2903946", "10.1109/tvcg.2015.2467717", "10.1177/1473871612460526", "10.1016/j.cag.2018.09.018", "10.1109/tvcg.2016.2598838", "10.1145/3172944.3172964.14", "10.1109/vast.2009.5333428", "10.1109/vast.2014.7042480", "10.2312/pe/eurovast/eurovast10/013-018", "10.1177/0962280215588241", "10.1145/2993901.2993917", "10.1109/cvpr.2008:4587581", "10.1109/tvcg.2015.2467551", "10.1016/j.visinf.2018.09.001", "10.1126/science.290.5500.2319", "10.2312/eurova.20151107", "10.1109/visual.2019.8933695", "10.13140/2.1.2393.1847", "10.1197/jamia.m1929", "10.1109/cvpr.2008.4587581.25", "10.1145/1518701.1518895.16", "10.1109/vds.2017.8573444", "10.2312/trvis:20191185", "10.1145/3359786", "10.13140/2.1.1341.1520", "10.2312/pe/eurovast/eurova11/049-052.17", "10.1109/tvcg.2014.2346660", "10.1145/3185517", "10.1109/adprl.2011.5967372", "10.1109/tvcg.2015.2467591", "10.1111/j.1751-9004.2009.00232.x", "10.1136/qshc.2004.010033", "10.1109/vast.2012.6400493", "10.1109/tvcg.2019.2934266", "10.1145/2971763.2971775", "10.1111/cgf.13730", "10.1109/vast.2012.6400488", "10.1111/cgf.13210", "10.1109/tvcg.2019.2934631", "10.1145/3172944.3172965", "10.1057/ivs.2010.2", "10.1109/tvcg.2017.2745258", "10.1016/j.jbusres.2019.07.039", "10.1162/jmlr.2003.3.4-5.993", "10.1109/pacificvis.2019.00044", "10.2312/pe/eurovast/eurova12/037-041", "10.1109/tvcg.2019.2934629", "10.1177/0018720814547570", "10.1145/3292500.3330908", "10.1111/j.1467-8659.2009.01467.x", "10.2312/eurova.20151098", "10.1177/1473871617713337", "10.1109/lars:2009.5418323", "10.1109/vast.2011.6102437", "10.1111/cgf.12878", "10.1561/1500000001", "10.1145/3025171.3025222", "10.1007/s11704-016-6028-y", "10.1016/j.procs.2017.05.216", "10.1109/cvpr.2007.382974.25", "10.1080/10447318.2020.1741118", "10.1109/vast.2012.6400489", "10.1145/3025171.3025172", "10.1109/tvcg.2017.2744098", "10.1109/tvcg.2005.66", "10.1016/j.dss.2009.05.016", "10.1007/978-1-4612-4026-6", "10.2312/evs.20191168.16,20,28", "10.2312/pe/eurovast/eurova12/037-041.17", "10.1145/3290605.3300803", "10.1145/1015330.1015388", "10.1111/cgf.13197", "10.1016/b978-1-55860-377-6.50048-7", "10.1111/cgf.13681", "10.1109/tvcg.2017.2744378", "10.1109/tvcg.2017.2744358", "10.1109/vast.2008.4677352"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030368", "title": "Implicit Multidimensional Projection of Local Subspaces", "year": "2020", "conferenceName": "InfoVis", "authors": "Rongzheng Bian;Yumeng Xue;Liang Zhou;Jian Zhang 0070;Baoquan Chen;Daniel Weiskopf;Yunhai Wang", "citationCount": "1", "affiliation": "Wang, YH (Corresponding Author), Shandong Univ, Qingdao, Peoples R China. Zhou, L (Corresponding Author), Univ Utah, Salt Lake City, UT 84112 USA. Bian, Rongzheng; Xue, Yumeng; Wang, Yunhai, Shandong Univ, Qingdao, Peoples R China. Chen, Baoquan, Peking Univ, Beijing, Peoples R China. Zhang, Jian, Chinese Acad Sci, CNIC, Beijing, Peoples R China. Zhou, Liang, Univ Utah, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "We propose a visualization method to understand the effect of multidimensional projection on local subspaces, using implicit function differentiation. Here, we understand the local subspace as the multidimensional local neighborhood of data points. Existing methods focus on the projection of multidimensional data points, and the neighborhood information is ignored. Our method is able to analyze the shape and directional information of the local subspace to gain more insights into the global structure of the data through the perception of local structures. Local subspaces are fitted by multidimensional ellipses that are spanned by basis vectors. An accurate and efficient vector transformation method is proposed based on analytical differentiation of multidimensional projections formulated as implicit functions. The results are visualized as glyphs and analyzed using a full set of specifically-designed interactions supported in our efficient web-based visualization tool. The usefulness of our method is demonstrated using various multi- and high-dimensional benchmark datasets. Our implicit differentiation vector transformation is evaluated through numerical comparisons; the overall method is evaluated through exploration examples and use cases.", "keywords": "High-dimensional data visualization,dimensionality reduction,local linear subspaces,user interaction", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030368", "refList": ["10.3844/jcssp.2018.613.622", "10.1016/j.aci.2018.08.003", "10.3390/info9030065", "10.1016/j.visinf.2018.09.003", "10.1371/journal.pone.0118432", "10.1016/s0893-6080(05)80023-1", "10.1109/tvcg.2020.2986996", "10.1109/icst.2012.56", "10.1007/s10844-013-0250-y", "10.1109/tbdata.2018", "10.1145/1125451.1125659", "10.1109/tvcg.2013.125", "10.1177/1473871611412817", "10.1145/3290605.3300911", "10.1111/cgf.14034", "10.1007/s13721-013-0034-x", "10.1016/j.procs.2017.05.216", "10.1016/j.ins.2009.08.025", "10.1109/tvcg.2013.124", "10.1109/tvcg.2018.2864499", "10.1109/tvcg.2018.2864475", "10.1080/10447318.2020.1741118", "10.1016/j.imu.2019.100203", "10.1109/tvcg.2018.2865240", "10.1186/s12864-019-6413-7", "10.1109/tvcg.2015.2467551", "10.1002/widm.1249", "10.1007/978-3-319-66429-3\\_29", "10.1109/tvcg.2014.2346481", "10.1109/tvcg.2018.2864825", "10.1177/1473871620904671", "10.1109/tvcg.2019.2934267", "10.1136/bmjopen-2016-012799", "10.1109/smartgridcomm.2017.8340682", "10.1007/s10664-015-9401-9", "10.1145/1143844.1143874", "10.1111/cgf.12389", "10.1109/tvcg.2018.2872577", "10.1007/978-981-13-5802-9\\_20", "10.1016/j.ipm.2009.03.002", "10.5220/0006431602160222", "10.1109/mcg.2015.50", "10.1109/tvcg.2014.2346574", "10.1007/bf02289565", "10.1109/tvcg.2017.2744378", "10.1016/j.patrec.2008.08.010", "10.1023/a:1010933404324", "10.9735/2229-3981"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030465", "title": "Visual Causality Analysis of Event Sequence Data", "year": "2020", "conferenceName": "VAST", "authors": "Zhuochen Jin;Shunan Guo;Nan Chen;Daniel Weiskopf;David Gotz;Nan Cao", "citationCount": "0", "affiliation": "Cao, N (Corresponding Author), Tongji Univ, IDVx Lab, Shanghai, Peoples R China. Jin, Zhuochen; Guo, Shunan; Chen, Nan; Cao, Nan, Tongji Univ, IDVx Lab, Shanghai, Peoples R China. Weiskopf, Daniel, Univ Stuttgart, Stuttgart, Germany. Gotz, David, Univ N Carolina, Chapel Hill, NC 27515 USA.", "countries": "USA;Germany;China", "abstract": "Causality is crucial to understanding the mechanisms behind complex systems and making decisions that lead to intended outcomes. Event sequence data is widely collected from many real-world processes, such as electronic health records, web clickstreams, and financial transactions, which transmit a great deal of information reflecting the causal relations among event types. Unfortunately, recovering causalities from observational event sequences is challenging, as the heterogeneous and high-dimensional event variables are often connected to rather complex underlying event excitation mechanisms that are hard to infer from limited observations. Many existing automated causal analysis techniques suffer from poor explainability and fail to include an adequate amount of human knowledge. In this paper, we introduce a visual analytics method for recovering causalities in event sequence data. We extend the Granger causality analysis algorithm on Hawkes processes to incorporate user feedback into causal model refinement. The visualization system includes an interactive causal analysis framework that supports bottom-up causal exploration, iterative causal verification and refinement, and causal comparison through a set of novel visualizations and interactions. We report two forms of evaluation: a quantitative evaluation of the model improvements resulting from the user-feedback mechanism, and a qualitative evaluation through case studies in different application domains to demonstrate the usefulness of the system.", "keywords": "Event sequence data,causality analysis,visual analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030465", "refList": ["10.5555/1642718", "10.1109/tvcg.2018.2865022", "10.5555/2074094.2074151", "10.1109/tvcg.2016.2618797", "10.1073/pnas.1320645111", "10.1109/tvcg.2017.2744843", "10.1109/iv.2017.69", "10.1109/tvcg.2019.2934399", "10.1145/3172944.3173007", "10.5555/1795555", "10.1109/mcg.2005.102", "10.1145/381641.381653", "10.1162/153244301753344614", "10.1111/cgf.14034", "10.1111/cgf.13198", "10.1017/cbo9780511519857", "10.1007/s10462-016-9475-9", "10.1075/ssol.2.2.07bor", "10.1007/978-1-4614-3223-4\\_3", "10.1109/infvis.2003.1249025", "10.1007/978-94-007-6094-313", "10.1145/2858036.2858387", "10.1109/tvcg.2007.70528", "10.1109/tvcg.2017.2674958", "10.1147/sj.454.0801", "10.1109/tvcg.2013.119", "10.1145/3173574.3173711", "10.1016/j.erss.2017.06.034", "10.1109/visual.2019.8933695", "10.1007/s11665-016-2173-6", "10.1016/0377-0427(87)90125-7", "10.2307/3601125", "10.1016/b978-0-444-88738-2.50018-x", "10.1109/mcg.2006.70", "10.1109/tvcg.2018.2865145", "10.1017/s1351324997001502", "10.1109/tvcg.2010.179", "10.1214/aos/1176344552", "10.1109/mcg.2009.22", "10.1007/978-3-319-26633-6\\_13", "10.1080/10447318.2014.905422", "10.1016/j.visinf.2019.03.004", "10.1057/palgrave.ivs.9500074", "10.1007/978-1-4614-3223-4"], "wos": 1, "children": [], "len": 1}], "len": 5}], "len": 21}, {"doi": "10.1111/cgf.13397", "year": "2018", "title": "Representative Consensus from Limited-Size Ensembles", "conferenceName": "EuroVis", "authors": "Mahsa Mirzargar;Ross T. Whitaker", "citationCount": "0", "affiliation": "Mirzargar, M (Corresponding Author), Univ Miami, Dept Comp Sci, Coral Gables, FL 33124 USA.\nMirzargar, Mahsa, Univ Miami, Dept Comp Sci, Coral Gables, FL 33124 USA.\nWhitaker, Ross T., Univ Utah, Sch Comp, Salt Lake City, UT USA.\nWhitaker, Ross T., Univ Utah, SCI Inst, Salt Lake City, UT USA.", "countries": "USA", "abstract": "Characterizing the uncertainty and extracting reliable visual information from ensemble data have been persistent challenges in various disciplines, specifically in simulation sciences. Many ensemble analysis and visualization techniques take a probabilistic approach to this problem with the assumption that the ensemble size is large enough to extract reliable statistical or probabilistic summaries. However, many real-life ensembles are rather limited in size, with only a handful of members, due to various restrictions such as storage, computational power, or sampling limitations. As a result, probabilistic inference is subject to imprecision and can potentially result in untrustworthy information in the presence of a limited sample-size ensemble. In this case, a more reliable approach is to fuse the information present in an ensemble with a limited number of members with minimal assumptions. In this paper, we propose a technique to construct a representative consensus that is particularly suited for ensembles of a relatively small size. The proposed technique casts the problem as an ordering problem in which at each point in the domain, the ensemble members are ranked based on the local neighborhood. This local approach allows us to provide shape and irregularity sensitivity. The local order statistics will then be fused to construct a global consensus using a Bayesian approach to ensure spatial coherency of the local information. We demonstrate the utility of the proposed technique using a synthetic and two real-life examples.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13397", "refList": ["10.1109/tvcg.2016.2598919", "10.1198/jasa.2009.0108", "10.1109/tvcg.2015.2467591", "10.1109/tvcg.2015.2467204", "10.1016/0031-3203(93)90135-j", "10.1109/tvcg.2013.143", "10.1186/s12859-016-1445-3", "10.1111/cgf.12898", "10.1109/tvcg.2016.2598868", "10.1016/j.media.2015.06.012", "10.1109/tvcg.2014.2346455", "10.1109/scivis.2015.7429487", "10.1109/vizsec.2015.7312766", "10.2307/2333244", "10.1109/34.969114", "10.1145/3002151.3002165.3", "10.1214/aos/1176347507", "10.1109/tvcg.2015.2424872", "10.1007/s11634-014-0166-6", "10.1109/tvcg.2016.2607204", "10.1109/tpami.1984.4767596", "10.1109/tpami.2004.60", "10.1198/jcgs.2011.09224", "10.1007/978-3-319-10443-0\\_3", "10.1111/cgf.13204", "10.1080/10618600.2016.1209115", "10.1109/iccv.2001.937655", "10.1111/j.1467-8659.2012.03097.x", "10.1109/vast.2015.7347634", "10.1111/cgf.13173", "10.1111/j.1467-8659.2011.01942.x", "10.1109/tvcg.2016.2637333", "10.1111/cgf.12653", "10.1109/tmi.2004.828354", "10.1109/tvcg.2016.2598869", "10.1111/j.1467-8659.2012.03096.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030466", "title": "Uncertainty in Continuous Scatterplots, Continuous Parallel Coordinates, and Fibers", "year": "2020", "conferenceName": "SciVis", "authors": "Boyan Zheng;Filip Sadlo", "citationCount": "0", "affiliation": "Zheng, BY (Corresponding Author), Heidelberg Univ, Heidelberg, Germany. Zheng, Boyan; Sadlo, Filip, Heidelberg Univ, Heidelberg, Germany.", "countries": "Germany", "abstract": "In this paper, we introduce uncertainty to continuous scatterplots and continuous parallel coordinates. We derive respective models, validate them with sampling-based brute-force schemes, and present acceleration strategies for their computation. At the same time, we show that our approach lends itself as well for introducing uncertainty into the definition of fibers in bivariate data. Finally, we demonstrate the properties and the utility of our approach using specifically designed synthetic cases and simulated data.", "keywords": "Multivariate data,uncertainty visualization,uncertain continuous scatterplots,uncertain continuous parallel coordinates,uncertain fibers", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030466", "refList": ["10.1109/tvcg.2018.2865193", "10.1109/tvcg.2013.143", "10.1109/tvcg.2015.2467204", "10.1109/pacificvis.2013.6596144", "10.1109/tvcg.2017.2745178", "10.1109/tmm.2016.2614227", "10.1109/scivis.2015.7429488", "10.1111/cgf.12100", "10.1109/pacificvis.2016.7465251", "10.1111/cgf.12898", "10.1109/tvcg.2015.2410278", "10.1109/icdmw.2009.55", "10.1109/tvcg.2015.2467754", "10.1109/tvcg.2010.247", "10.1109/tvcg.2019.2934312", "10.1111/cgf.13397", "10.1109/tvcg.2016.2598868", "10.1111/j.1467-8659.2011.01944.x", "10.1109/tvcg.2015.2507569", "10.1109/tvcg.2013.92", "10.1145/1268517.1268563", "10.1109/tvcg.2014.2346455", "10.1109/tvcg.2010.181", "10.1109/tvcg.2018.2853721", "10.1109/tvcg.2008.140", "10.1007/s12650-015-0341-7", "10.1109/mcg.2014.52", "10.1109/tvcg.2018.2864815", "10.1111/j.1467-8659.2012.03095.x", "10.1109/tvcg.2013.138", "10.1109/tvcg.2019.2934242", "10.3390/e20070540", "10.1016/j.jcp.2007.02.014", "10.1111/cgf.13999", "10.1109/tvcg.2017.2779501", "10.1111/cgf.12390", "10.1109/tvcg.2014.2307892", "10.1111/cgf.13531", "10.1109/tvcg.2013.152", "10.1038/nature14956", "10.1007/978-3-540-88606-8\\_4", "10.1109/mcg.2005.71", "10.1111/j.1467-8659.2011.01942.x", "10.1109/tvcg.2019.2934800", "10.1109/tvcg.2016.2598830", "10.1109/cvpr.2005.188", "10.1109/tvcg.2011.261", "10.1111/cgf.13731", "10.1109/tvcg.2017.2754480"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.13692", "year": "2019", "title": "Towards Glyphs for Uncertain Symmetric Second-Order Tensors", "conferenceName": "EuroVis", "authors": "Tim Gerrits;Christian R{\\\"{o}}ssl;Holger Theisel", "citationCount": "0", "affiliation": "Gerrits, T (Corresponding Author), Univ Magdeburg, Magdeburg, Germany.\nGerrits, Tim; Roessl, Christian; Theisel, Holger, Univ Magdeburg, Magdeburg, Germany.", "countries": "Germany", "abstract": "Measured data often incorporates some amount of uncertainty, which is generally modeled as a distribution of possible samples. In this paper, we consider second-order symmetric tensors with uncertainty. In the 3D case, this means the tensor data consists of 6 coefficients - uncertainty, however, is encoded by 21 coefficients assuming a multivariate Gaussian distribution as model. The high dimension makes the direct visualization of tensor data with uncertainty a difficult problem, which was until now unsolved. The contribution of this paper consists in the design of glyphs for uncertain second-order symmetric tensors in 2D and 3D. The construction consists of a standard glyph for the mean tensor that is augmented by a scalar field that represents uncertainty. We show that this scalar field and therefore the displayed glyph encode the uncertainty comprehensively, i.e., there exists a bijective map between the glyph and the parameters of the distribution. Our approach can extend several classes of existing glyphs for symmetric tensors to additionally encode uncertainty and therefore provides a possible foundation for further uncertain tensor glyph design. For demonstration, we choose the well-known superquadric glyphs, and we show that the uncertainty visualization satisfies all their design constraints.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13692", "refList": ["10.1007/978-1-4471-2804-5\\_6", "10.1109/tvcg.2016.2598998", "10.1111/cgf.12357", "10.1109/tvcg.2014.2346455", "10.1109/tvcg.2010.199", "10.1109/tmi.2003.815059", "10.1109/tvcg.2015.2467435", "10.1111/cgf.13173", "10.1002/mrm.10331", "10.1111/cgf.12099", "10.1111/cgf.12890", "10.1109/tvcg.2015.2467031", "10.1016/j.sigpro.2006.02.050", "10.1007/978-1-4471-6497-5\\_1", "10.2312/vissym/vissym04/147-154", "10.1109/pacificvis.2012.6183591"], "wos": 1, "children": [], "len": 1}], "len": 29}], "len": 31}, {"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis.2018.00014", "year": "2018", "title": "Smart Surrogate Widgets for Direct Volume Manipulation", "conferenceName": "PacificVis", "authors": "Sergej Stoppel;Stefan Bruckner", "citationCount": "1", "affiliation": "Stoppel, S (Corresponding Author), Univ Bergen, Bergen, Norway.\nStoppel, Sergej; Bruckner, Stefan, Univ Bergen, Bergen, Norway.", "countries": "Norway", "abstract": "Interaction is an essential aspect in volume visualization, yet common manipulation tools such as bounding boxes or clipping plane widgets provide rather crude tools as they neglect the complex structure of the underlying data. In this paper, we introduce a novel volume interaction approach based on smart widgets that are automatically placed directly into the data in a visibility-driven manner. By adapting to what the user actually sees, they act as proxies that allow for goal-oriented modifications while still providing an intuitive set of simple operations that is easy to control. In particular, our method is well-suited for direct manipulation scenarios such as touch screens, where traditional user interface elements commonly exhibit limited utility. To evaluate out approach we conducted a qualitative user study with nine participants with various backgrounds.", "keywords": "{[}Human-centered computing]: Interaction design process and methods; User interface design", "link": "https://doi.org/10.1109/PacificVis.2018.00014", "refList": ["10.2312/vg/vg-pbg08/041-048", "10.2312/eurovisshort.20141164", "10.1109/tvcg.2008.59", "10.1109/tvcg.2015.2467202", "10.1109/visual.2001.964519", "10.1109/tvcg.2015.2467961", "10.1145/2492684", "10.1109/svv.1998.729584", "10.1109/tvcg.2005.62", "10.1109/2945.942692", "10.1145/1239451.1239482", "10.1109/tvcg.2006.140", "10.1111/cgf.12892", "10.1145/1053427.1053445", "10.1111/j.1467-8659.2012.03083.x", "10.1109/tvcg.2003.1207438", "10.2312/compaesth/compaesth05/209-216", "10.1109/tvcg.2006.152", "10.1016/j.cag.2011.10.006", "10.1109/tvcg.2010.157", "10.1109/tvcg.2006.96", "10.1109/tvcg.2012.292", "10.1145/358669.358692", "10.1109/tvcg.2011.261"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13411", "year": "2018", "title": "Explorative Blood Flow Visualization using Dynamic Line Filtering based on Surface Features", "conferenceName": "EuroVis", "authors": "Benjamin Behrendt;Philipp Berg;Oliver Beuing;Bernhard Preim;Sylvia Saalfeld", "citationCount": "2", "affiliation": "Behrendt, B (Corresponding Author), Res Campus STIMULATE, Magdeburg, Germany.\nBehrendt, B (Corresponding Author), Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nBehrendt, B.; Berg, P.; Beuing, O.; Preim, B.; Saalfeld, S., Res Campus STIMULATE, Magdeburg, Germany.\nBehrendt, B.; Preim, B.; Saalfeld, S., Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nBerg, P., Univ Magdeburg, Dept Fluid Dynam \\& Tech Flows, Magdeburg, Germany.\nBeuing, O., Univ Hosp Magdeburg, Inst Neuroradiol, Magdeburg, Germany.", "countries": "Germany", "abstract": "Rupture risk assessment is a key to devise patient-specific treatment plans of cerebral aneurysms. To understand and predict the development of aneurysms and other vascular diseases over time, both hemodynamic flow patterns and their effect on the vessel surface need to be analyzed. Flow structures close to the vessel wall often correlate directly with local changes in surface parameters, such as pressure or wall shear stress. Yet, in many existing applications, the analyses of flow and surface features are either somewhat detached from one another or only globally available. Especially for the identification of specific blood flow characteristics that cause local startling parameters on the vessel surface, like elevated pressure values, an interactive analysis tool is missing. The explorative visualization of flow data is challenging due to the complexity of the underlying data. In order to find meaningful structures in the entirety of the flow, the data has to be filtered based on the respective explorative aim. In this paper, we present a combination of visualization, filtering and interaction techniques for explorative analysis of blood flow with a focus on the relation of local surface parameters and underlying flow structures. Coherent bundles of pathlines can be interactively selected based on their relation to features of the vessel wall and further refined based on their own hemodynamic features. This allows the user to interactively select and explore flow structures locally affecting a certain region on the vessel wall and therefore to understand the cause and effect relationship between these entities. Additionally, multiple selected flow structures can be compared with respect to their quantitative parameters, such as flow speed. We confirmed the usefulness of our approach by conducting an informal interview with two expert neuroradiologists and an expert in flow simulation. In addition, we recorded several insights the neuroradiologists were able to gain with the help of our tool.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13411", "refList": ["10.1109/tvcg.2012.318", "10.1109/tvcg.2006.104", "10.3171/2009.2.focus0921", "10.1109/tvcg.2015.2467961", "10.1109/tvcg.2013.2297914", "10.1109/tvcg.2009.58", "10.3174/ajnr.a5358", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2011.243", "10.2312/vcbm/vcbm10/025-032", "10.3174/ajnr.a5088", "10.3174/ajnr.a3710", "10.1109/tvcg.2013.189", "10.1111/cgf.12112", "10.1515/bmt-2012-0119", "10.1109/pacificvis.2011.5742376", "10.1109/tvcg.2015.2467203", "10.1109/tvcg.2010.153", "10.1016/s0140-6736(03)13860-3", "10.1109/tvcg.2012.202", "10.1109/tvcg.2009.198", "10.1115/1.4026108", "10.1161/01.str.0000260955.51401.cd"], "wos": 1, "children": [{"doi": "10.1111/cgf.14036", "year": "2020", "title": "A Survey of Seed Placement and Streamline Selection Techniques", "conferenceName": "EuroVis", "authors": "Sudhanshu Sane;Roxana Bujack;Christoph Garth;Hank Childs", "citationCount": "0", "affiliation": "Sane, S (Corresponding Author), Univ Oregon, Eugene, OR 97403 USA.\nSane, Sudhanshu; Childs, Hank, Univ Oregon, Eugene, OR 97403 USA.\nBujack, Roxana, Los Alamos Natl Lab, Los Alamos, NM USA.\nGarth, Christoph, Univ Kaiserslautern, Kaiserslautern, Germany.", "countries": "Germany;USA", "abstract": "Streamlines are an extensively utilized flow visualization technique for understanding, verifying, and exploring computational fluid dynamics simulations. One of the major challenges associated with the technique is selecting which streamlines to display. Using a large number of streamlines results in dense, cluttered visualizations, often containing redundant information and occluding important regions, whereas using a small number of streamlines could result in missing key features of the flow. Many solutions to select a representative set of streamlines have been proposed by researchers over the past two decades. In this state-of-the-art report, we analyze and classify seed placement and streamline selection (SPSS) techniques used by the scientific flow visualization community. At a high-level, we classify techniques into automatic and manual techniques, and further divide automatic techniques into three strategies: density-based, feature-based, and similarity-based. Our analysis evaluates the identified strategy groups with respect to focus on regions of interest, minimization of redundancy, and overall computational performance. Finally, we consider the application contexts and tasks for which SPSS techniques are currently applied and have potential applications in the future.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14036", "refList": ["10.1109/visual.1998.745295", "10.1007/978-3-540-70823-0\\_1", "10.1109/pacificvis.2014.14", "10.1111/j.1467-8659.2004.00753.x", "10.1109/visual.2000.885690", "10.1007/s00791-014-0229-4", "10.1109/tvcg.2012.143", "10.1109/mcg.2018.2881523", "10.1111/j.1467-8659.2009.01352.x", "10.1111/cgf.12356", "10.1109/tvcg.2005.87", "10.1007/s00371-007-0204-x", "10.1109/pacificvis.2015.7156350", "10.1080/14786440009463897", "10.1145/160985.161150", "10.1145/984952.984987", "10.1117/12.2001887", "10.1109/tvcg.2010.182", "10.1117/12.765736", "10.1109/mcg.2019.2936674", "10.1145/79505.79507", "10.1109/tvcg.2013.2297914", "10.1007/978-3-7091-6876-9\\_5", "10.1109/mcse.2007.82", "10.1109/ipec.2014.6869823", "10.1109/tvcg.2010.212", "10.1109/ldav.2015.7348070", "10.1111/cgf.12031", "10.3233/ica-130447", "10.1109/visual.1999.809918", "10.1109/mec.2013.6885356", "10.1109/83.623193", "10.1109/icsmc.2009.5346286", "10.1109/ihmsc.2019.00041", "10.1109/pacificvis.2011.5742376", "10.1109/pacificvis.2009.4906832", "10.1111/cgf.13411", "10.1109/tvcg.2011.260", "10.1016/j.cag.2015.06.003", "10.1109/tvcg.2009.206", "10.1109/cvpr.2007.383096", "10.1016/j.media.2007.10.003", "10.1016/j.cag.2016.08.001", "10.1109/tvcg.2006.95", "10.1109/ldav.2014.7013206", "10.1109/tvcg.2015.2467204", "10.1109/visual.1996.567777", "10.1109/visual.1992.235211", "10.1109/tvcg.2006.116", "10.1109/cis.2011.260", "10.1111/j.1467-8659.2011.02064.x", "10.1109/pacificvis.2013.6596153", "10.1109/tvcg.2012.150", "10.1016/j.gmod.2015.01.002", "10.1145/7529.8927", "10.1109/tvcg.2014.2325043", "10.1145/2461912.2461930", "10.1109/tvcg.2010.131", "10.1145/321796.321811", "10.1109/cis.2010.58", "10.1109/visual.2002.1183821", "10.1109/tvcg.2004.49", "10.1111/j.1467-8659.2011.01901.x", "10.1109/tvcg.2007.70595", "10.1109/cadgraphics.2015.48", "10.1109/tvcg.2011.215", "10.1109/icris.2016.3", "10.1126/science.1136800", "10.1109/tvcg.2006.104", "10.1111/j.1467-8659.2012.03102.x", "10.1109/tvcg.2014.2312009", "10.1109/visual.2000.885745", "10.1109/tvcg.2011.155", "10.2312/vissym/eurovis07/227-234", "10.1117/12.2038253", "10.1109/pacificvis.2014.12", "10.1016/j.cag.2015.01.002", "10.1109/tvcg.2007.1009", "10.1109/pacificvis.2010.5429603", "10.1109/visual.1998.745317", "10.1109/tvcg.2004.13", "10.1111/j.1467-8659.2010.01650.x", "10.1016/j.cag.2012.04.014", "10.1109/tvcg.2004.1260771", "10.1109/visual.2003.1250378", "10.1109/visual.2004.59", "10.1109/visual.2003.1250376", "10.1109/visual.1994.346312", "10.1111/cgf.12336", "10.1111/j.1467-8659.2003.00723.x", "10.1017/s0022112095000462", "10.1109/cis.2009.194"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.12911", "year": "2016", "title": "Semi-automatic Vortex Flow Classification in 4D PC-MRI Data of the Aorta", "conferenceName": "EuroVis", "authors": "Monique Meuschke;Benjamin K{\\\"{o}}hler;Uta Preim;Bernhard Preim;Kai Lawonn", "citationCount": "7", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Dept Simulat \\& Graph, D-39106 Magdeburg, Germany.\nMeuschke, M.; Koehler, B.; Preim, B., Univ Magdeburg, Dept Simulat \\& Graph, D-39106 Magdeburg, Germany.\nPreim, U., Municipal Hosp, Dept Diagnost Radiol, Magdeburg, Germany.\nLawonn, K., Univ Koblenz Landau, Inst Computat Visualist, Mainz, Germany.", "countries": "Germany", "abstract": "We present an Aortic Vortex Classification (AVOCLA) that allows to classify vortices in the human aorta semi-automatically. Current medical studies assume a strong relation between cardiovascular diseases and blood flow patterns such as vortices. Such vortices are extracted and manually classified according to specific, unstandardized properties. We employ an agglomerative hierarchical clustering to group vortex-representing path lines as basis for the subsequent classification. Classes are based on the vortex' size, orientation and shape, its temporal occurrence relative to the cardiac cycle as well as its spatial position relative to the vessel course. The classification results are presented by a 2D and 3D visualization technique. To confirm the usefulness of both approaches, we report on the results of a user study. Moreover, AVOCLA was applied to 15 datasets of healthy volunteers and patients with different cardiovascular diseases. The results of the semi-automatic classification were qualitatively compared to a manually generated ground truth of two domain experts considering the vortex number and five specific properties.", "keywords": "", "link": "https://doi.org/10.1111/cgf.12911", "refList": ["10.1097/rli.0b013e3182034fc2", "10.1111/cgf.12669", "10.1111/j.1467-8659.2012.03099.x", "10.1109/tvcg.2012.318", "10.1109/tvcg.2006.104", "10.1109/tvcg.2015.2467961", "10.1109/tvcg.2003.1207439", "10.1109/tvcg.2013.2297914", "10.1186/s12968-015-0174-5", "10.1002/jmri.23500", "10.1016/j.jacc.2012.01.072", "10.2312/vcbm/vcbm10/025-032", "10.1186/1532-429x-14-16", "10.1109/tvcg.2013.189", "10.1007/978-1-4471-6497-5\\_25", "10.1109/tvcg.2010.153", "10.1007/978-1-4471-6497-5-25", "10.1097/01.rct.0000232918.45158.c9", "10.1007/978-3-662-46224-9\\_45", "10.1371/journal.pone.0139025", "10.1109/tmi.2009.2021652", "10.1109/tvcg.2012.202", "10.1161/circulationaha.113.003026", "10.1148/radiol.09091437", "10.1161/01.cir.88.5.2235", "10.1111/cgf.12355", "10.1002/jmri.21082", "10.1109/pacificvis.2013.6596137"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864509", "title": "Visual Analysis of Aneurysm Data using Statistical Graphics", "year": "2018", "conferenceName": "SciVis", "authors": "Monique Meuschke;Tobias Günther;Philipp Berg;Ralph Wickenhöfer;Bernhard Preim;Kai Lawonn", "citationCount": "1", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Magdeburg, Germany. Meuschke, M (Corresponding Author), Res Campus STIMULATE, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Univ Magdeburg, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Res Campus STIMULATE, Magdeburg, Germany. Gunther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland. Wickenhoefer, Ralph, Heart Jesus Hosp, Dernbach, Germany. Lawonn, Kai, Univ Koblenz Landau, Koblenz, Germany.", "countries": "Germany;Switzerland", "abstract": "This paper presents a framework to explore multi-field data of aneurysms occurring at intracranial and cardiac arteries by using statistical graphics. The rupture of an aneurysm is often a fatal scenario, whereas during treatment serious complications for the patient can occur. Whether an aneurysm ruptures or whether a treatment is successful depends on the interaction of different morphological such as wall deformation and thickness, and hemodynamic attributes like wall shear stress and pressure. Therefore, medical researchers are very interested in better understanding these relationships. However, the required analysis is a time-consuming process, where suspicious wall regions are difficult to detect due to the time-dependent behavior of the data. Our proposed visualization framework enables medical researchers to efficiently assess aneurysm risk and treatment options. This comprises a powerful set of views including 2D and 3D depictions of the aneurysm morphology as well as statistical plots of different scalar fields. Brushing and linking aids the user to identify interesting wall regions and to understand the influence of different attributes on the aneurysm's state. Moreover, a visual comparison of pre- and post-treatment as well as different treatment options is provided. Our analysis techniques are designed in collaboration with domain experts, e.g., physicians, and we provide details about the evaluation.", "keywords": "Medical visualizations,aneurysms,blood flow,parametrization", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864509", "refList": ["10.1109/tvcg.2013.139", "10.1136/neurintsurg-2014-011247", "10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1111/j.1467-8659.2008.01289.x", "10.3171/2009.2.focus0921", "10.1109/tvcg.2011.235", "10.1080/03610910903168603", "10.1111/cgf.12911", "10.1145/2516971.2516977", "10.1590/s2179-83972012000100014", "10.1109/mcg.2018.032421654", "10.1109/tvcg.2016.2598795", "10.1016/b978-0-12-811018-8.00014-x", "10.1145/1360612.1360643", "10.1111/cgf.12369", "10.1109/smi.2005.17", "10.1186/s12968-015-0174-5", "10.2312/conf/eg2013/stars/039-063", "10.1109/enc.2004.1342596", "10.1067/mje.2002.123374", "10.1016/j.jbiomech.2015.09.039", "10.2312/vissym/vissym04/147-154", "10.1115/1.4033082", "10.1016/j.cag.2011.01.011", "10.1002/jmri.20361", "10.1007/s007910050004", "10.1109/tvcg.2010.111", "10.1016/j.cag.2016.05.024", "10.1109/tvcg.2010.153", "10.1109/visual.2000.885739", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.1007/978-3-662-46224-9\\_45", "10.1109/iv.2005.3", "10.3171/2013.12.jns13945", "10.1007/s00115-011-3372-x", "10.2307/2032161", "10.1109/tvcg.2016.2598866", "10.1115/1.4026108", "10.1161/01.str.0000260955.51401.cd", "10.1111/cgf.13171", "10.1111/cgf.12355", "10.1098/rsif.2011.0490", "10.1109/34.868688", "10.1109/42.875181", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 5}, {"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.13445", "year": "2018", "title": "A Survey of Flattening-Based Medical Visualization Techniques", "conferenceName": "EuroVis", "authors": "Julian Kreiser;Monique Meuschke;Gabriel Mistelbauer;Bernhard Preim;Timo Ropinski", "citationCount": "12", "affiliation": "Kreiser, J (Corresponding Author), Ulm Univ, Visual Comp Grp, Ulm, Germany.\nKreiser, J.; Ropinski, T., Ulm Univ, Visual Comp Grp, Ulm, Germany.\nMeuschke, M.; Mistelbauer, G.; Preim, B., Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.", "countries": "Germany", "abstract": "In many areas of medicine, visualization research can help with task simplification, abstraction or complexity reduction. A common visualization approach is to facilitate parameterization techniques which flatten a usually 3D object into a 2D plane. Within this state of the art report (STAR), we review such techniques used in medical visualization and investigate how they can be classified with respect to the handled data and the underlying tasks. Many of these techniques are inspired by mesh parameterization algorithms which help to project a triangulation in (3) to a simpler domain in (2). It is often claimed that this makes complex structures easier to understand and compare by humans and machines. Within this STAR we review such flattening techniques which have been developed for the analysis of the following medical entities: the circulation system, the colon, the brain, tumors, and bones. For each of these five application scenarios, we have analyzed the tasks and requirements, and classified the reviewed techniques with respect to a developed coding system. Furthermore, we present guidelines for the future development of flattening techniques in these areas.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13445", "refList": ["10.1016/j.neuroimage.2009.12.048", "10.1109/tvcg.2010.200", "10.1162/089892900562561", "10.1016/j.neuroimage.2010.02.008", "10.1111/cgf.12110", "10.1109/42.796283", "10.1109/tvcg.2011.182", "10.1111/cgf.12111", "10.1109/tvcg.2014.2346405", "10.1109/tmi.2004.831226", "10.1109/tvcg.2007.1061", "10.1109/isbi.2014.6868097", "10.1109/tvcg.2015.2467413", "10.3322/caac.21395", "10.1109/tvcg.2009.136", "10.1162/jocn.1996.8.1.1", "10.1161/hc0402.102975", "10.1016/s1361-8415(02)00054-3", "10.1109/tvcg.2011.192", "10.1109/tmi.2011.2168233", "10.1109/tip.2007.896637", "10.1136/jamia.2001.0080443", "10.1111/j.1467-8659.2009.01665.x", "10.1109/visual.2003.1250353", "10.1148/radiol.10091096", "10.1016/j.neuroimage.2009.10.086", "10.1109/tmi.2013.2241651", "10.2312/8168", "10.1117/12.466985", "10.1007/s10654-015-0082-x", "10.1007/978-3-319-12508-4\\_8", "10.1137/130950008", "10.1109/tvcg.2010.134", "10.1016/j.neuroimage.2004.07.042", "10.1109/tmi.2007.895464", "10.1007/s00330-015-3598-2", "10.1016/j.neuroimage.2005.06.055", "10.2214/ajr.170.4.9530029", "10.1016/j.compmedimag.2008.08.002", "10.1109/tvcg.2007.70550", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1109/visual.2002.1183754", "10.1109/tvcg.2016.2598795", "10.1007/3-540-26808-1\\_9", "10.1109/isbi.2015.7164103", "10.1137/080738386", "10.1109/visual.2001.964555", "10.1002/jmri.25622", "10.1016/j.media.2008.04.002", "10.1109/tvcg.2011.207", "10.1007/978-3-662-46224-9\\_45", "10.1006/nimg.1998.0396", "10.1016/j.cag.2011.03.008", "10.1007/978-3-540-85988-8\\_70", "10.1112/plms/s3-13.1.743", "10.1093/cercor/bhn016", "10.1002/ima.20140", "10.1109/pacificvis.2012.6183596", "10.1098/rsif.2011.0490", "10.1016/j.media.2004.06.020", "10.1145/2668020", "10.1177/1473871611416549", "10.1109/tvcg.2017.2674938", "10.1016/j.acra.2016.09.022", "10.1109/tvcg.2016.2598791", "10.1016/j.neuroimage.2004.07.018", "10.1002/jmri.21634", "10.1016/j.cag.2016.05.024", "10.1016/s0167-8396(03)00002-5", "10.1007/978-981-10-0266-3\\_65", "10.1088/0031-9155/50/19/007", "10.1007/978-3-642-25719-3\\_16", "10.1007/978-3-642-17274-8\\_52", "10.1007/978-3-642-23629-7\\_41", "10.1109/tvcg.2004.24", "10.1111/j.1467-8659.2012.03114.x", "10.1088/0031-9155/52/10/015", "10.1117/12.878295", "10.1016/j.cmpb.2014.10.004", "10.1016/j.neuroimage.2008.10.045", "10.1109/tvcg.2013.215", "10.1561/0600000011", "10.1109/tvcg.2013.139", "10.1109/cvpr.2013.290", "10.1016/j.acra.2016.09.018", "10.1007/s00330-004-2289-1", "10.1117/12.387731", "10.1016/j.neuroimage.2012.01.021", "10.1109/34.35506", "10.1016/s0167-8396(96)00031-3", "10.1117/12.534480", "10.1109/visual.2001.964540", "10.1016/s1076-6332(03)80579-2", "10.1109/tmi.2004.839368", "10.1016/j.clinimag.2015.03.005", "10.1016/j.compmedimag.2007.06.007", "10.1007/978-3-642-25719-3\\_17", "10.1109/42.875181", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934258", "title": "Scale-Space Splatting: Reforming Spacetime for Cross-Scale Exploration of Integral Measures in Molecular Dynamics", "year": "2019", "conferenceName": "SciVis", "authors": "Juraj Pálenik;Jan Byska;Stefan Bruckner;Helwig Hauser", "citationCount": "0", "affiliation": "Palenik, J (Corresponding Author), Univ Bergen, Bergen, Norway. Palenik, Juraj; Byska, Jan; Bruckner, Stefan; Hauser, Helwig, Univ Bergen, Bergen, Norway. Byska, Jan, Masaryk Univ, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "Understanding large amounts of spatiotemporal data from particle-based simulations, such as molecular dynamics, often relies on the computation and analysis of aggregate measures. These, however, by virtue of aggregation, hide structural information about the space/time localization of the studied phenomena. This leads to degenerate cases where the measures fail to capture distinct behaviour. In order to drill into these aggregate values, we propose a multi-scale visual exploration technique. Our novel representation, based on partial domain aggregation, enables the construction of a continuous scale-space for discrete datasets and the simultaneous exploration of scales in both space and time. We link these two scale-spaces in a scale-space space-time cube and model linked views as orthogonal slices through this cube, thus enabling the rapid identification of spatio-temporal patterns at multiple scales. To demonstrate the effectiveness of our approach, we showcase an advanced exploration of a protein-ligand simulation.", "keywords": "Scale space,time-series,scientific simulation,multi-scale analysis,space-time cube,molecular dynamics", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934258", "refList": ["10.1111/cgf.13445", "10.1109/tvcg.2012.191", "10.1201/b14876", "10.1145/827051.827056", "10.1080/07391102.2005.10531229", "10.1021/acs.jcim.7b00070", "10.1007/978-3-8348-9190-729", "10.1111/cgf.13427", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1016/0021-9991(82)90025-0", "10.1111/cgf.13177", "10.1007/978-1-4757-6465-9", "10.1145/1044588.1044615", "10.2307/2669996", "10.1109/tvcg.2018.2865049", "10.1007/978-3-540-70823-0\\_3", "10.1111/cgf.13640", "10.1109/tvcg.2010.253", "10.1109/tvcg.2009.177", "10.1016/j.csda.2018.03.014", "10.1109/tvcg.2009.200", "10.1109/visual.2003.1250353", "10.2312/eurovisshort.20171146", "10.1109/tvcg.2010.148", "10.1002/9780470316849", "10.1109/visual.1993.398859", "10.1007/978-1-4612-4026-6", "10.1016/j.jmb.2018.09.004", "10.1111/cgf.13415", "10.2312/molva.20181102", "10.1371/journal.pcbi.1002708", "10.1007/s10851-010-0242-2", "10.1016/0263-7855(96)00018-5", "10.1109/visual.2003.1250402", "10.1007/bf01936872", "10.1002/wics.79", "10.1111/j.1467-8659.2009.01684.x", "10.1109/tvcg.2018.2864510", "10.1111/cgf.12804", "10.1117/12.904668", "10.1002/jcc.20289", "10.1088/0965-0393/18/1/015012", "10.1109/34.56205", "10.1111/j.1435-5597.1970.tb01464.x", "10.1007/978-0-85729-079-3", "10.1007/s11263-005-1838-7"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}], "len": 19}, {"doi": "10.1111/cgf.12892", "year": "2016", "title": "Visibility Equalizer Cutaway Visualization of Mesoscopic Biological Models", "conferenceName": "EuroVis", "authors": "Mathieu Le Muzic;Peter Mindek;Johannes Sorger;Ludovic Autin;David S. Goodsell;Ivan Viola", "citationCount": "8", "affiliation": "Le Muzic, M; Mindek, P (Corresponding Author), TU Wien, Vienna, Austria.\nLe Muzic, M.; Mindek, P.; Sorger, J.; Viola, I., TU Wien, Vienna, Austria.\nSorger, J., VRVis Res Ctr, Vienna, Austria.\nAutin, L.; Goodsell, D. S., Scripps Res Inst, La Jolla, CA 92037 USA.", "countries": "USA;Austria", "abstract": "In scientific illustrations and visualization, cutaway views are often employed as an effective technique for occlusion management in densely packed scenes. We propose a novel method for authoring cutaway illustrations of mesoscopic biological models. In contrast to the existing cutaway algorithms, we take advantage of the specific nature of the biological models. These models consist of thousands of instances with a comparably smaller number of different types. Our method constitutes a two stage process. In the first step, clipping objects are placed in the scene, creating a cutaway visualization of the model. During this process, a hierarchical list of stacked bars inform the user about the instance visibility distribution of each individual molecular type in the scene. In the second step, the visibility of each molecular type is fine-tuned through these bars, which at this point act as interactive visibility equalizers. An evaluation of our technique with domain experts confirmed that our equalizer-based approach for visibility specification is valuable and effective for both, scientific and educational purposes.", "keywords": "", "link": "https://doi.org/10.1111/cgf.12892", "refList": ["10.1109/visual.2004.48", "10.1145/1111411.1111431", "10.2312/vissym/eurovis05/069-076", "10.1109/tvcg.2015.2467961", "10.1111/j.1467-8659.2012.03208.x", "10.1109/tvcg.2011.173", "10.1109/tvcg.2010.35", "10.1111/j.1467-8659.2012.03128.x", "10.1109/tvcg.2005.62", "10.2312/vcbm.20151209", "10.1007/bf01897116", "10.1111/1467-8659.t01-3-00700", "10.1111/j.1467-8659.2011.01930.x", "10.1111/cgf.12197", "10.1109/tvcg.2003.1207438", "10.1109/pacificvis.2012.6183590", "10.1145/2448531.2448537", "10.1111/cgf.12370", "10.1109/tvcg.2006.124", "10.1038/nmeth.3204"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934334", "title": "Scale Trotter: Illustrative Visual Travels Across Negative Scales", "year": "2019", "conferenceName": "SciVis", "authors": "Sarkis Halladjian;Haichao Miao;David Kouril;M. Eduard Gröller;Ivan Viola;Tobias Isenberg", "citationCount": "1", "affiliation": "Halladjian, S (Corresponding Author), INRIA, Paris, France. Halladjian, S (Corresponding Author), Univ Paris Saclay, St Aubin, France. Halladjian, Sarkis; Isenberg, Tobias, INRIA, Paris, France. Halladjian, Sarkis, Univ Paris Saclay, St Aubin, France. Miao, Haichao; Kouril, David; Groller, M. Eduard, TU Wien, Vienna, Austria. Groller, M. Eduard, VRVis Res Ctr, Vienna, Austria. Viola, Ivan, King Abdullah Univ Sci \\& Technol, Thuwal, Saudi Arabia.", "countries": "Arabia;France;Austria", "abstract": "We present ScaleTrotter, a conceptual framework for an interactive, multi-scale visualization of biological mesoscale data and, specifically, genome data. ScaleTrotter allows viewers to smoothly transition from the nucleus of a cell to the atomistic composition of the DNA, while bridging several orders of magnitude in scale. The challenges in creating an interactive visualization of genome data are fundamentally different in several ways from those in other domains like astronomy that require a multi-scale representation as well. First, genome data has intertwined scale levels—the DNA is an extremely long, connected molecule that manifests itself at all scale levels. Second, elements of the DNA do not disappear as one zooms out—instead the scale levels at which they are observed group these elements differently. Third, we have detailed information and thus geometry for the entire dataset and for all scale levels, posing a challenge for interactive visual exploration. Finally, the conceptual scale levels for genome data are close in scale space, requiring us to find ways to visually embed a smaller scale into a coarser one. We address these challenges by creating a new multi-scale visualization concept. We use a scale-dependent camera model that controls the visual embedding of the scales into their respective parents, the rendering of a subset of the scale hierarchy, and the location, size, and scope of the view. In traversing the scales, ScaleTrotter is roaming between 2D and 3D visual representations that are depicted in integrated visuals. We discuss, specifically, how this form of multi-scale visualization follows from the specific characteristics of the genome data and describe its implementation. Finally, we discuss the implications of our work to the general illustrative depiction of multi-scale data.", "keywords": "Multi-scale visualization,scale transition,abstraction,human genome,DNA,Hi-C data", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934334", "refList": ["10.1126/science.291.5507.1177", "10.1038/nrneph.2010.55", "10.1016/j.jmb.2018.06.009", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2017.2743958", "10.1111/j.1467-8659.2012.03128.x", "10.1145/1507149.1507186", "10.1111/j.1467-8659.2012.03082.x", "10.1109/tvcg.2007.2", "10.1145/2024156.2024165", "10.1201/b17511", "10.1038/srep20802", "10.1145/1239451.1239482", "10.1109/mcg.2005.34", "10.1111/cgf.13429", "10.1186/1471-2105-11-444", "10.1109/tvcg.2015.2403323", "10.2312/vcbm.20151209", "10.1109/ldav.2016.7874310", "10.3791/1869", "10.1109/tvcg.2017.2747545", "10.1109/tvcg.2017.2743981", "10.1111/cgf.12892", "10.1126/science.aag0025", "10.1101/gr.213611.116", "10.2312/eurovisshort.20171146", "10.1109/mcg.2008.63", "10.1111/cgf.12349", "10.1017/s0890060411000230", "10.1109/tvcg.2007.70591", "10.1109/infvis.2004.12", "10.1111/cgf.13202", "10.2312/vissym/eurovis05/303-310", "10.1111/cgf.13072", "10.1016/j.jmb.2018.09.004", "10.1111/j.1467-8659.2011.01917.x", "10.1111/cgf.12197", "10.2312/eurovisstar.20151112", "10.1086/344286", "10.1093/nar/gks586", "10.2312/ega.20101005", "10.1186/s13059-018-1486-1", "10.1109/visual.2004.103", "10.1111/j.1467-8659.2009.01692.x", "10.1109/tvcg.2017.2744278", "10.1109/tvcg.2012.159", "10.1109/tvcg.2018.2864507", "10.1038/nrm1225", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030415", "title": "Modeling in the Time of COVID-19: Statistical and Rule-based Mesoscale Models", "year": "2020", "conferenceName": "SciVis", "authors": "Ngan Nguyen;Ondrej Strnad;Tobias Klein;Deng Luo;Ruwayda Alharbi;Peter Wonka;Martina Maritan;Peter Mindek;Ludovic Autin;David S. Goodsell;Ivan Viola", "citationCount": "0", "affiliation": "Nguyen, N (Corresponding Author), King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Nguyen, Ngan; Strnad, Ondrej; Luo, Deng; Alharbi, Ruwayda; Wonka, Peter; Viola, Ivan, King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Klein, Tobias; Mindek, Peter, TU Wien, Vienna, Austria. Klein, Tobias; Mindek, Peter, Nanographics GmbH, Vienna, Austria. Maritan, Martina; Autin, Ludovic; Goodsell, David S., Scripps Res Inst, La Jolla, CA 92037 USA.", "countries": "USA;Arabia;Austria", "abstract": "We present a new technique for the rapid modeling and construction of scientifically accurate mesoscale biological models. The resulting 3D models are based on a few 2D microscopy scans and the latest knowledge available about the biological entity, represented as a set of geometric relationships. Our new visual-programming technique is based on statistical and rule-based modeling approaches that are rapid to author, fast to construct, and easy to revise. From a few 2D microscopy scans, we determine the statistical properties of various structural aspects, such as the outer membrane shape, the spatial properties, and the distribution characteristics of the macromolecular elements on the membrane. This information is utilized in the construction of the 3D model. Once all the imaging evidence is incorporated into the model, additional information can be incorporated by interactively defining the rules that spatially characterize the rest of the biological entity, such as mutual interactions among macromolecules, and their distances and orientations relative to other structures. These rules are defined through an intuitive 3D interactive visualization as a visual-programming feedback loop. We demonstrate the applicability of our approach on a use case of the modeling procedure of the SARS-CoV-2 virion ultrastructure. This atomistic model, which we present here, can steer biological research to new promising directions in our efforts to fight the spread of the virus.", "keywords": "molecular visualization,mesoscale modeling", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030415", "refList": ["10.1145/2187836.2187957", "10.1109/tvcg.2009.157", "10.1099/0022-1317-39-3-545", "10.1007/978-3-319-73915-1\\_31", "10.1109/tvcg.2013.158", "10.1016/j.cag.2013.01.010", "10.1109/vast.2009.5333893", "10.1038/s41594-020-0468-7", "10.1145/174462.156635", "10.1038/nmeth.f.301", "10.1038/s41586-020-2008-3", "10.1016/j.jsb.2010.11.021", "10.7554/elife.57309", "10.1109/tvcg.2017.2744518", "10.1007/s00371-017-1397-2", "10.1109/tvcg.2017.2744258", "10.1111/cgf.13373", "10.1016/0022-5193(68)90079-9", "10.1111/j.1467-8659.2012.03128.x", "10.1145/2897824.2925951", "10.1007/978-3-319-28661-7\\_5", "10.1128/jvi.00645-06", "10.1016/bs.aivir.2016.08.005", "10.1007/978-3-319-50106-2\\_29", "10.1007/978-3-319-50106-2\\_30", "10.1107/s0907444910007493", "10.1093/gigascience/giz064", "10.1007/s11540-006-9010-5", "10.1111/cgf.13640", "10.1109/tvcg.2006.115", "10.1145/3130800.3130804", "10.1016/j.bbamem.2018.02.017", "10.1111/cgf.13816", "10.1021/acs.jctc.9b00453", "10.1016/j.jmgm.2016.07.008", "10.1126/science.abc6952", "10.1007/978-3-319-27261-0\\_16", "10.1007/978-3-319-73915-1\\_29", "10.1146/annurev.bb.06.060177.001055", "10.1002/(sici)1097-0282(199603)38:3", "10.1109/tvcg.2019.2934334", "10.1145/357306.357310", "10.1111/j.1467-8659.2009.01612.x", "10.3238/arztebl.2011.0087", "10.1093/bioinformatics/bty272", "10.1007/978-3-319-07121-35", "10.1107/s0021889883010985", "10.1101/2020.03.25.008904", "10.1126/science.abb9983", "10.1002/jcc.21861", "10.1111/cgf.12197", "10.1145/3197517.3201393", "10.1016/j.tibs.2020.02.010", "10.1007/s13238-016-0352-8", "10.1101/2020.06.26.173476", "10.1145/882262.882291", "10.1109/mcg.2018.2877076", "10.1093/nar/gkh468", "10.1038/nsb1203-980", "10.1007/978-3-319-07121-3\\_5", "10.1093/nar/gky427", "10.1111/cgf.12370", "10.1109/38.310720", "10.1038/nmeth.3204", "10.1109/tvcg.2016.2603178"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/pacificvis.2018.00014", "year": "2018", "title": "Smart Surrogate Widgets for Direct Volume Manipulation", "conferenceName": "PacificVis", "authors": "Sergej Stoppel;Stefan Bruckner", "citationCount": "1", "affiliation": "Stoppel, S (Corresponding Author), Univ Bergen, Bergen, Norway.\nStoppel, Sergej; Bruckner, Stefan, Univ Bergen, Bergen, Norway.", "countries": "Norway", "abstract": "Interaction is an essential aspect in volume visualization, yet common manipulation tools such as bounding boxes or clipping plane widgets provide rather crude tools as they neglect the complex structure of the underlying data. In this paper, we introduce a novel volume interaction approach based on smart widgets that are automatically placed directly into the data in a visibility-driven manner. By adapting to what the user actually sees, they act as proxies that allow for goal-oriented modifications while still providing an intuitive set of simple operations that is easy to control. In particular, our method is well-suited for direct manipulation scenarios such as touch screens, where traditional user interface elements commonly exhibit limited utility. To evaluate out approach we conducted a qualitative user study with nine participants with various backgrounds.", "keywords": "{[}Human-centered computing]: Interaction design process and methods; User interface design", "link": "https://doi.org/10.1109/PacificVis.2018.00014", "refList": ["10.2312/vg/vg-pbg08/041-048", "10.2312/eurovisshort.20141164", "10.1109/tvcg.2008.59", "10.1109/tvcg.2015.2467202", "10.1109/visual.2001.964519", "10.1109/tvcg.2015.2467961", "10.1145/2492684", "10.1109/svv.1998.729584", "10.1109/tvcg.2005.62", "10.1109/2945.942692", "10.1145/1239451.1239482", "10.1109/tvcg.2006.140", "10.1111/cgf.12892", "10.1145/1053427.1053445", "10.1111/j.1467-8659.2012.03083.x", "10.1109/tvcg.2003.1207438", "10.2312/compaesth/compaesth05/209-216", "10.1109/tvcg.2006.152", "10.1016/j.cag.2011.10.006", "10.1109/tvcg.2010.157", "10.1109/tvcg.2006.96", "10.1109/tvcg.2012.292", "10.1145/358669.358692", "10.1109/tvcg.2011.261"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 11}, {"doi": "10.1111/cgf.12927", "year": "2016", "title": "A Survey of Perceptually Motivated 3D Visualization of Medical Image Data", "conferenceName": "EuroVis", "authors": "Bernhard Preim;Alexandra Baer;Douglas W. Cunningham;Tobias Isenberg;Timo Ropinski", "citationCount": "21", "affiliation": "Preim, B (Corresponding Author), Univ Magdeburg, D-39106 Magdeburg, Germany.\nPreim, Bernhard; Baer, Alexandra, Univ Magdeburg, D-39106 Magdeburg, Germany.\nCunningham, Douglas, BTU Cottbus Senftenberg, Senftenberg, Germany.\nIsenberg, Tobias, Inria, Le Chesnay, France.\nRopinski, Timo, Univ Ulm, D-89069 Ulm, Germany.", "countries": "Germany;France", "abstract": "This survey provides an overview of perceptually motivated techniques for the visualization of medical image data, including physics-based lighting techniques as well as illustrative rendering that incorporate spatial depth and shape cues. Additionally, we discuss evaluations that were conducted in order to study the perceptual effects of these visualization techniques as compared to conventional techniques. These evaluations assessed depth and shape perception with depth judgment, orientation matching, and related tasks. This overview of existing techniques and their evaluation serves as a basis for defining the evaluation process of medical visualizations and to discuss a research agenda.", "keywords": "", "link": "https://doi.org/10.1111/cgf.12927", "refList": ["10.1109/tvcg.2006.172", "10.1109/ismar.2007.4538837", "10.1068/p180817", "10.1109/38.689664", "10.1016/b978-0-12-415873-3.00023-7", "10.1145/1239451.1239470", "10.1137/100815104", "10.1109/tvcg.2013.126", "10.1109/tvcg.2011.127", "10.1109/tvcg.2011.211", "10.1111/j.1467-8659.2008.01154.x", "10.1007/s00371-010-0431-4", "10.1109/mcg.2003.1210864", "10.1117/12.650855", "10.1109/tvcg.2011.192", "10.1068/p080069", "10.2312/vcbm/vcbm10/025-032", "10.1109/tvcg.2006.158", "10.1016/j.cag.2011.01.011", "10.1109/mcg.2008.39", "10.1007/978-3-319-15090-1\\_12", "10.1109/tvcg.2010.153", "10.1109/visual.2003.1250386", "10.1016/0004-3702(81)90020-5", "10.1111/cgf.12252", "10.1016/j.cag.2010.03.005", "10.1007/978-3-540-72630-2\\_3", "10.1038/290091a0", "10.1109/mcg.2003.1210862", "10.1117/12.940117", "10.1117/12.387164", "10.1111/j.1467-8659.2009.01692.x", "10.1145/800249.807437", "10.1145/1015706.1015768", "10.2312/vmv.20141273", "10.1145/1360612.1360687", "10.1145/1531326.1531334", "10.1117/12.850094", "10.1167/4.9.10", "10.1109/tvcg.2015.2467961", "10.1145/882262.882354", "10.1111/j.1467-8659.2009.01695.x", "10.1145/1507149.1507186", "10.1109/visual.2002.1183754", "10.1145/234526.234532", "10.1109/tvcg.2007.70559", "10.1016/s0042-6989(01)00021-9", "10.1109/tvcg.2015.2403323", "10.1007/bf00336800", "10.1109/tvcg.2004.46", "10.1109/tvcg.2008.56", "10.2312/pe/pg/pg2011short/105-110", "10.1145/1141911.1142015", "10.1007/978-3-642-21608-4.7", "10.1145/340916.340922", "10.1109/mcg.2014.120", "10.1145/1360612.1360657", "10.1109/tvcg.2007.70555", "10.1007/s10648-011-9174-7", "10.2312/vissym/eurovis05/303-310", "10.1145/1179622.1179816", "10.1109/visual.1995.480795", "10.1109/tvcg.2011.161", "10.1109/pacificvis.2013.6596131", "10.2312/localchapterevents/ceig/ceig12/031-040", "10.1145/2024676.2024694", "10.1109/tvcg.2012.267", "10.1109/tvcg.2009.138", "10.1016/j.cag.2010.03.014", "10.1145/1408626.1408633", "10.1145/2669557.2669569", "10.1109/tvcg.2012.215", "10.1109/visual.1997.663912", "10.1113/jphysiol.1968.sp008455", "10.1109/tvcg.2012.142", "10.1201/b15981", "10.1111/j.1467-8659.2009.01464.x", "10.1109/tvcg.2003.1196003", "10.2312/pe/pg/pg2011sh0rt/105-110", "10.1109/2945.597794", "10.1017/s0080456800030234", "10.1109/38.135913", "10.1037/0033-295x.106.4.795", "10.1037/0096-1523.9.4.583", "10.1109/tvcg.2013.240", "10.1111/j.1467-8659.2011.01930.x", "10.2312/egst20081045", "10.1111/j.1467-8659.2007.01095.x", "10.1109/visual.1996.568110", "10.2312/vg/vg10/093-100", "10.1007/978-3-642-33179-4\\_66", "10.1117/12.709631", "10.1007/978-3-540-85412-8\\_15", "10.1016/b978-0-12-381464-7.00018-1", "10.2312/vg/vg07/001-008", "10.1109/bmei.2008.347", "10.1007/978-3-319-26633-6", "10.1111/cgf.12119", "10.1111/cgf.12355", "10.1201/b10927", "10.1111/j.1467-8659.2009.01474.x", "10.3758/bf03206757", "10.1109/pacificvis.2013.6596137", "10.1038/331163a0", "10.1109/tvcg.2012.188", "10.1109/visual.2003.1250425", "10.1201/b11308", "10.1016/s0042-6989(97)00438-0", "10.1145/1658349.1658353", "10.1109/tvcg.2008.108", "10.1145/2620029", "10.1016/0042-6989(94)90116-3", "10.1109/tvcg.2005.62", "10.3758/bf03206710", "10.1007/978-3-319-24571-3\\_48", "10.1109/tvcg.2004.5", "10.1007/s00371-015-1151-6", "10.1007/978-1-4471-6497-5\\_25", "10.1068/p5418", "10.1371/journal.pone.0066169", "10.1068/p3060", "10.1007/978-1-4471-6497-5-25", "10.1109/visual.2003.1250414", "10.1068/p120411", "10.1145/2701425", "10.1109/tvcg.2009.203", "10.2312/vcbm.20141190", "10.1109/visual.2002.1183785", "10.1109/tvcg.2008.123", "10.1109/cvpr.1997.609461", "10.1167/3.5.3", "10.1109/38.511", "10.1109/visual.2003.1250394", "10.1109/ismar.2014.6948433", "10.1109/34.784284", "10.1109/tvcg.2012.144", "10.1037/0096-3445.117.2.161", "10.1109/visual.2000.885694"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864690", "title": "Interactive obstruction-free lensing for volumetric data visualization", "year": "2018", "conferenceName": "SciVis", "authors": "Michael Traoré;Christophe Hurter;Alexandru Telea", "citationCount": "1", "affiliation": "Traore, M (Corresponding Author), French Civil Aviat Univ, ENAC, Toulouse, France. Traore, Michael; Hurter, Christophe, French Civil Aviat Univ, ENAC, Toulouse, France. Telea, Alexandru, Univ Groningen, Inst Johan Bernoulli, Groningen, Netherlands.", "countries": "France;Netherlands", "abstract": "Occlusion is an issue in volumetric visualization as it prevents direct visualization of the region of interest. While many techniques such as transfer functions, volume segmentation or view distortion have been developed to address this, there is still room for improvement to better support the understanding of objects' vicinity. However, most existing Focus+Context fail to solve partial occlusion in datasets where the target and the occluder are very similar density-wise. For these reasons, we investigate a new technique which maintains the general structure of the investigated volumetric dataset while addressing occlusion issues. With our technique, the user interactively defines an area of interest where an occluded region or object is partially visible. Then our lens starts pushing at its border occluding objects, thus revealing hidden volumetric data. Next, the lens is modified with an extended field of view (fish-eye deformation) to better see the vicinity of the selected region. Finally, the user can freely explore the surroundings of the area under investigation within the lens. To provide real-time exploration, we implemented our lens using a GPU accelerated ray-casting framework to handle ray deformations, local lighting, and local viewpoint manipulation. We illustrate our technique with five application scenarios in baggage inspection, 3D fluid flow visualization, chest radiology, air traffic planning, and DTI fiber exploration.", "keywords": "Interaction techniques,focus + context,volume visualization,volume rendering,raycasting", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864690", "refList": ["10.1109/visual.1999.809865", "10.1145/1409060.1409107", "10.1109/visual.2003.1250400", "10.1145/2598153.2598200", "10.1007/978-1-4614-7657-3\\_19", "10.1109/tvcg.2008.59", "10.1145/989863.989871", "10.1109/tvcg.2016.2599049", "10.1145/345513.345271", "10.1016/s1470-2045(17)30438-2", "10.1109/pacificvis.2014.61", "10.1111/j.1467-8659.2006.00979.x", "10.1109/tvcg.2010.35", "10.2312/conf/eg2012/stars/075-094", "10.1111/cgf.12927", "10.1111/cgf.12871", "10.1145/2024156.2024165", "10.1007/978-3-540-85412-8\\_16", "10.1057/ivs.2009.32", "10.1109/tvcg.2006.140", "10.1109/tvcg.2007.70565", "10.1109/tvcg.2015.2403323", "10.1109/visual.2004.32", "10.2200/s00688ed1v01y201512vis006", "10.1109/tvcg.2015.2443804", "10.1109/tvcg.2006.144", "10.1109/tvcg.2016.2515611", "10.1109/tvcg.2007.48", "10.1109/tvcg.2010.193", "10.1109/tvcg.2007.1051", "10.1109/tvcg.2015.2502583", "10.1109/tvcg.2011.223", "10.1109/38.595268", "10.1111/j.1467-8659.2012.03079.x", "10.1109/tvcg.2009.145", "10.1109/pacificvis.2017.8031594", "10.1145/2425296.2425325", "10.1109/tvcg.2012.265", "10.1109/mcg.2017.10", "10.1007/s12031-007-0029-0", "10.1109/tvcg.2010.127", "10.1016/j.trc.2014.03.005", "10.1109/tvcg.2009.138", "10.1109/tvcg.2006.124"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13700", "year": "2019", "title": "Interactive Volumetric Visual Analysis of Glycogen-derived Energy Absorption in Nanometric Brain Structures", "conferenceName": "EuroVis", "authors": "Marco Agus;Corrado Cal{\\`{\\i}};Ali K. Al{-}Awami;Enrico Gobbetti;Pierre J. Magistretti;Markus Hadwiger", "citationCount": "3", "affiliation": "Agus, M (Corresponding Author), KAUST, Thuwal, Saudi Arabia.\nAgus, M (Corresponding Author), VCC, Thuwal, Saudi Arabia.\nAgus, M (Corresponding Author), Ctr Adv Studies Res \\& Dev Sardinia CRS4, Visual Comp Grp, Cagliari, Italy.\nAgus, M.; Cali, C.; Al-Awami, A.; Magistretti, P.; Hadwiger, M., KAUST, Thuwal, Saudi Arabia.\nAgus, M.; Al-Awami, A.; Hadwiger, M., VCC, Thuwal, Saudi Arabia.\nCali, C.; Magistretti, P., BESE, Thuwal, Saudi Arabia.\nAgus, M.; Gobbetti, E., Ctr Adv Studies Res \\& Dev Sardinia CRS4, Visual Comp Grp, Cagliari, Italy.\nAl-Awami, A., Saudi Aramco \\& EXPEC Comp Ctr, Dharhan, Saudi Arabia.", "countries": "Italy;Arabia", "abstract": "Digital acquisition and processing techniques are changing the way neuroscience investigation is carried out. Emerging applications range from statistical analysis on image stacks to complex connectomics visual analysis tools targeted to develop and test hypotheses of brain development and activity. In this work, we focus on neuroenergetics, a field where neuroscientists analyze nanoscale brain morphology and relate energy consumption to glucose storage in form of glycogen granules. In order to facilitate the understanding of neuroenergetic mechanisms, we propose a novel customized pipeline for the visual analysis of nanometric-level reconstructions based on electron microscopy image data. Our framework supports analysis tasks by combining i) a scalable volume visualization architecture able to selectively render image stacks and corresponding labelled data, ii) a method for highlighting distance-based energy absorption probabilities in form of glow maps, and iii) a hybrid connectivitybased and absorption-based interactive layout representation able to support queries for selective analysis of areas of interest and potential activity within the segmented datasets. This working pipeline is currently used in a variety of studies in the neuroenergetics domain. Here, we discuss a test case in which the framework was successfully used by domain scientists for the analysis of aging effects on glycogen metabolism, extracting knowledge from a series of nanoscale brain stacks of rodents somatosensory cortex.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13700", "refList": ["10.1371/journal.pone.0038011", "10.1016/j.coisb.2017.07.011", "10.1145/234535.234538", "10.1109/tvcg.2018.2864847", "10.2312/conf/eg2012/stars/053-074", "10.3389/fnins.2018.00664", "10.1109/tpami.2018.2835450", "10.1109/tvcg.2014.2346312", "10.1109/tvcg.2009.121", "10.1002/glia.23020", "10.1117/1.jbo.18.5.050902", "10.1111/cgf.12927", "10.1038/nn.3837", "10.1109/isbi.2011.5872394", "10.3868/j.issn.2096-0689.2017.04.004", "10.1111/cgf.12792", "10.1016/j.neuroscience.2012.09.077", "10.1109/tvcg.2012.240", "10.1523/jneurosci.4825-12.2013", "10.1002/cne.23852", "10.2312/vcbm.20151213", "10.1111/cgf.12605", "10.1016/j.cag.2018.04.007", "10.1038/s41592-018-0049-4", "10.1007/s00371-015-1151-6", "10.1109/tvcg.2018.2864852", "10.1109/ic3d.2016.7823463", "10.3389/fncel.2019.00082", "10.1111/boc.201600024", "10.2312/vg/vg10/053-060", "10.1109/tvcg.2013.142", "10.1371/journal.pone.0198131", "10.1111/cgf.12280", "10.1038/nature22356", "10.1109/tvcg.2015.2467441", "10.1016/j.neuron.2015.03.035", "10.2312/vcbm.20161276", "10.1016/j.neuroscience.2007.07.014", "10.1109/tvcg.2017.2744238", "10.1002/glia.23250", "10.3389/fncel.2018.00308", "10.1016/j.cell.2018.06.019", "10.1109/tvcg.2017.2744278", "10.1109/biovis.2013.6664349", "10.1179/000870403235002042"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13732", "year": "2019", "title": "State-of-the-art in Multi-Light Image Collections for Surface Visualization and Analysis", "conferenceName": "EuroVis", "authors": "Ruggero Pintus;Tinsae Dulecha;Irina Ciortan;Enrico Gobbetti;Andrea Giachetti", "citationCount": "1", "affiliation": "Pintus, R (Corresponding Author), CRS4, Pula, CA, Italy.\nPintus, R.; Gobbetti, E., CRS4, Pula, CA, Italy.\nDulecha, T. G.; Giachetti, A., Univ Verona, Dept Comp Sci, Verona, Italy.\nCiortan, I, Norwegian Univ Sci \\& Technol, Dept Comp Sci, Trondheim, Norway.", "countries": "Italy;Norway", "abstract": "Multi-Light Image Collections (MLICs), i.e., stacks of photos of a scene acquired with a fixed viewpoint and a varying surface illumination, provide large amounts of visual and geometric information. In this survey, we provide an up-to-date integrative view of MLICs as a mean to gain insight on objects through the analysis and visualization of the acquired data. After a general overview of MLICs capturing and storage, we focus on the main approaches to produce representations usable for visualization and analysis. In this context, we first discuss methods for direct exploration of the raw data. We then summarize approaches that strive to emphasize shape and material details by fusing all acquisitions in a single enhanced image. Subsequently, we focus on approaches that produce relightable images through intermediate representations. This can be done both by fitting various analytic forms of the light transform function, or by locally estimating the parameters of physically plausible models of shape and reflectance and using them for visualization and analysis. We finally review techniques that improve object understanding by using illustrative approaches to enhance relightable models, or by extracting features and derived maps. We also review how these methods are applied in several, main application domains, and what are the available tools to perform MLIC visualization and analysis. We finally point out relevant research issues, analyze research trends, and offer guidelines for practical applications.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13732", "refList": ["10.1109/icip.2017.8296320", "10.1145/3197517.3201313", "10.1016/j.jasrep.2018.02.013", "10.1145/2461912.2461978", "10.1117/1.jbo.18.7.076017", "10.1109/iccv.2011.6126437", "10.1016/j.vacuum.2005.01.081", "10.2312/vast/vast06/195-202", "10.1145/1841317.1841321", "10.1111/cgf.12927", "10.1109/mcg.2014.108", "10.1145/1015706.1015779", "10.1007/978-3-319-59126-1\\_46", "10.2312/vast/vast05/029-039", "10.1111/cgf.12867", "10.1109/icimu.2014.7066661", "10.1111/cgf.12668", "10.1111/2041-210x.12778", "10.1016/j.cviu.2017.05.014", "10.1109/icosp.2012.6491901", "10.1561/0600000065", "10.1109/cvpr.2016.403", "10.1117/12.2184840", "10.1186/1687-5281-2014-25", "10.1111/j.1467-8659.2008.01150.x", "10.1016/j.patrec.2013.09.005", "10.1145/2766997", "10.1111/cgf.12719", "10.1007/s13319-016-0081-z", "10.1016/s0166-3615(00)00052-x", "10.1109/tim.2007.911580", "10.1117/1.jei.26.1.011029", "10.1109/cvprw.2009.5206558", "10.1145/1964921.1964940", "10.1117/12.2038119", "10.1109/cvpr.2011.5995510", "10.1145/1276377.1276496", "10.1109/tci.2017.2749182", "10.1007/978-3-642-39608-3\\_9", "10.1111/cgf.12280", "10.1145/1141911.1141949", "10.2312/vast/vast06/179-186", "10.1561/0600000022", "10.1145/2461912.2461944", "10.1111/j.1467-8659.2008.01126.x", "10.1109/tpami.2016.2623613", "10.1109/mgrs.2016.2637824", "10.1111/j.1467-8659.2005.00868.x", "10.1145/1239451.1239546", "10.1016/j.jas.2014.11.019", "10.2312/egwr/egsr05/117-126", "10.1007/s00339-016-0499-4", "10.1016/j.imavis.2012.02.012", "10.1111/cgf.12871", "10.1145/1866158.1866163", "10.1007/978-3-642-33418-4\\_78", "10.1117/1.oe.56.11.113101", "10.5194/isprsarchives-xl-5-w4-415-2015", "10.1179/2047058412y.0000000077", "10.1109/cvpr.2006.182", "10.1007/978-3-642-33868-7\\_34", "10.1145/2766899", "10.1007/s11263-006-8815-7", "10.1117/12.7972479", "10.2312/egwr/egsr07/183-194.6", "10.1111/j.1467-8659.2009.01493.x", "10.3390/s140712271", "10.1007/978-3-030-01765-1\\_23", "10.1007/978-3-030-01267-0\\_1", "10.1109/cvpr.2015.7299089", "10.1016/j.optlaseng.2014.07.006", "10.1145/882262.882342", "10.1109/icassp.2010.5495456", "10.1109/digitalheritage.2015.7413874", "10.1109/tpami.2008.246", "10.1109/tpami.2007.1164", "10.1111/j.1600-0846.2007.00274.x", "10.1117/12.2184761", "10.1016/j.compind.2018.02.006", "10.1109/iirw.2013.6804184", "10.2352/issn.2168-3204.2018.1.0.15", "10.1007/s00138-017-0856-0"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13726", "year": "2019", "title": "State-of-the-Art Report: Visual Computing in Radiation Therapy Planning", "conferenceName": "EuroVis", "authors": "Matthias Schlachter;Renata G. Raidou;Ludvig P. Muren;Bernhard Preim;P. M. Putora;Katja B{\\\"{u}}hler", "citationCount": "1", "affiliation": "Schlachter, M (Corresponding Author), VRVis Res Ctr, Vienna, Austria.\nSchlachter, M.; Buehler, K., VRVis Res Ctr, Vienna, Austria.\nRaidou, R. G., TU Wien, Vienna, Austria.\nMuren, L. P., Aarhus Univ Hosp, Dept Med Phys, Aarhus, Denmark.\nPreim, B., Univ Magdeburg, Magdeburg, Germany.\nPreim, B., Res Campus STIMULATE, Magdeburg, Germany.\nPutora, P. M., Kantonsspital St Gallen, Dept Radiat Oncol, St Gallen, Switzerland.\nPutora, P. M., Univ Bern, Dept Radiat Oncol, Bern, Switzerland.", "countries": "Germany;Switzerland;Austria;Denmark", "abstract": "Radiation therapy (RT) is one of the major curative approaches for cancer. It is a complex and risky treatment approach, which requires precise planning, prior to the administration of the treatment. Visual Computing (VC) is a fundamental component of RT planning, providing solutions in all parts of the process-from imaging to delivery. Despite the significant technological advancements of RT over the last decades, there are still many challenges to address. This survey provides an overview of the compound planning process of RT, and of the ways that VC has supported RT in all its facets. The RT planning process is described to enable a basic understanding in the involved data, users and workflow steps. A systematic categorization and an extensive analysis of existing literature in the joint VC/RT research is presented, covering the entire planning process. The survey concludes with a discussion on lessons learnt, current status, open challenges, and future directions in VC/RT research.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13726", "refList": ["10.1016/j.ijrobp.2014.01.046", "10.1016/j.ijrobp.2004.11.037", "10.1118/1.1935775", "10.21037/tlcr.2016.06.07", "10.1109/vast.2014.7042481", "10.1017/s1460396917000206", "10.1109/jproc.2002.804685", "10.1111/cgf.12193", "10.1016/j.radonc.2007.08.012", "10.1111/cgf.12927", "10.1016/s0360-3016(02)02866-3", "10.1097/pas.0000000000000530", "10.1088/0031-9155/46/3/304", "10.1145/1268517.1268563", "10.1088/0031-9155/53/12/r01", "10.1109/tvcg.2008.95", "10.1002/acm2.12209", "10.1016/s0167-8140(01)00444-3", "10.1118/1.4896821", "10.1016/j.ijrobp.2011.07.021", "10.1016/s0360-3016(00)00467-3", "10.1038/tp.2012.95", "10.1016/0360-3016(95)00272-3", "10.1111/cgf.13413", "10.1186/s13014-015-0569-3", "10.1097/01.rct.0000156396.13522.f2", "10.1016/j.apradiso.2004.05.049", "10.1118/1.2966347", "10.1146/annurev.bioeng.2.1.315", "10.1038/nrclinonc.2012.203", "10.1109/iembs.1997.756505", "10.1016/s0360-3016(99)00042-5", "10.1080/10408370091179244", "10.1109/ultsym.2001.991951", "10.1016/0360-3016(91)90168-4", "10.1118/1.1420400", "10.2214/ajr.12.8510", "10.3109/0284186x.2011.590524", "10.2214/ajr.09.2527", "10.1109/tmi.2017.2717800", "10.1016/j.adro.2017.04.005", "10.1146/annurev.bioeng.1.1.377", "10.1016/j.radonc.2009.12.034", "10.1016/j.ijrobp.2009.07.1754", "10.1109/tmi.2013.2265603", "10.1186/s13014-015-0404-x", "10.2312/vcbm.20161287", "10.1109/bmei.2013.6746924", "10.1016/j.ijrobp.2005.05.008", "10.1007/s10278-010-9321-6", "10.1016/j.ijom.2017.08.002", "10.4103/0971-6203.44472", "10.1016/s0360-3016(01)02805-x", "10.1002/jmri.21513", "10.1109/nssmic.1991.259172", "10.1007/s10278-016-9915-8", "10.1088/0031-9155/59/11/2687", "10.1118/1.4905050", "10.1287/opre.1070.0484", "10.1148/rg.271065078", "10.1102/1470-7330.2007.0013", "10.1016/j.ijrobp.2005.10.006", "10.1016/j.clon.2017.09.007", "10.3109/0284186x.2010.498433", "10.1109/vbc.1990.109295", "10.1016/j.cag.2010.05.016", "10.1111/cgf.12613", "10.1016/j.ijrobp.2008.05.011", "10.1109/iv.1997.626463", "10.1007/s10278-015-9839-8", "10.1088/0031-9155/38/6/001", "10.1016/j.cag.2013.10.015", "10.1007/s00066-004-1275-5", "10.1016/j.artmed.2008.11.003", "10.1016/j.ijrobp.2013.10.028", "10.1109/nssmic.2010.5874096", "10.1109/visual.1995.480795", "10.1111/1759-7714.12170", "10.1002/mp.12629", "10.1111/cgf.12165", "10.1118/1.2349696", "10.1148/radiol.2333032098", "10.1016/j.ejmp.2012.11.004", "10.1109/tvcg.2013.143", "10.14791/btrt.2015.3.1.8", "10.1118/1.2815943", "10.1111/cgf.12899", "10.1102/1470-7330.2006.9017", "10.1109/iv.2001.942055", "10.1016/j.media.2016.06.030", "10.1016/s0360-3016(03)00073-7", "10.1111/cgf.13306", "10.1016/j.radonc.2006.05.002", "10.1109/vahc.2017.8387544", "10.1109/titb.2006.875669", "10.1118/1.3521468", "10.1148/radiol.2431030580", "10.1097/mou.0b013e3282f19d01", "10.1016/s1053-4296(99)80051-4", "10.1016/j.suronc.2010.07.004", "10.1109/2945.597794", "10.1016/j.ijrobp.2007.01.056", "10.1088/0031-9155/52/13/n03", "10.1016/j.inffus.2013.12.002", "10.1016/s0958-3947(98)00014-4", "10.1088/0031-9155/44/11/201", "10.7785/tcrt.2012.500256", "10.1016/j.cmpb.2010.10.009", "10.1007/s00330-011-2377-y", "10.1118/1.4754659", "10.1109/icicic.2009.62", "10.1111/j.1467-8659.2011.01954.x", "10.1186/1748-717x-1-47", "10.1109/visual.1996.568110", "10.1007/978-3-540-85990-1\\_85", "10.2147/ott.s64161", "10.1109/tvcg.2007.70569", "10.1016/s0167-8140(02)00140-8", "10.1109/tns.2016.2616884", "10.3109/02841868709089981", "10.2312/vcbm.20161276", "10.1007/978-3-319-46723-8\\_12", "10.1109/iembs.2005.1615886", "10.1002/mp.13115", "10.1109/tvcg.2014.2346574", "10.1016/j.apradiso.2015.12.061", "10.1148/rg.313105139", "10.1120/jacmp.v8i3.2448", "10.1002/cncr.21324", "10.1016/j.jbi.2016.12.001", "10.1109/icmla.2008.126", "10.1007/978-3-642-21414-11", "10.1109/tmi.2016.2560942", "10.1016/0360-3016(96)00204-0", "10.1002/mp.12979", "10.1118/1.4828840", "10.1118/1.3253464", "10.1002/(sici)1522-2586(199909)10:3", "10.3109/0284186x.2013.814152", "10.1088/0031-9155/51/9/009", "10.1016/s1361-8415(00)00041-4", "10.1016/s0262-8856(03)00137-9", "10.1016/j.prro.2011.08.001", "10.1109/vast.2014.7042521", "10.1109/iv.2000.859783", "10.1080/02841860802266763", "10.1186/s40658-016-0151-6", "10.1016/j.radonc.2016.02.030", "10.1093/jicru/ndh001", "10.1109/medcom.2014.7005998", "10.1016/j.acra.2008.09.011", "10.1016/j.clon.2017.10.013", "10.1109/isbi.2012.6235553", "10.1016/j.radonc.2006.11.024", "10.1016/s1361-8415(01)80026-8", "10.2312/vcbm/vcbm08/093-100", "10.1016/s0167-8140(02)00015-4", "10.1109/cw.2017.56", "10.1109/tvcg.2017.2744358", "10.1109/tvcg.2016.2598468", "10.1016/s0360-3016(96)85024-3"], "wos": 1, "children": [], "len": 1}], "len": 9}, {"doi": "10.1111/cgf.13171", "year": "2017", "title": "Glyph-Based Comparative Stress Tensor Visualization in Cerebral Aneurysms", "conferenceName": "EuroVis", "authors": "Monique Meuschke;Samuel Vo{\\ss};Oliver Beuing;Bernhard Preim;Kai Lawonn", "citationCount": "7", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nMeuschke, M.; Preim, B., Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nVoss, S., Univ Magdeburg, Dept Fluid Dynam \\& Tech Flows, Magdeburg, Germany.\nBeuing, O., Univ Hosp, Dept Neuroradiol, Magdeburg, Germany.\nLawonn, K., Univ Koblenz Landau, Inst Computat Visualist, Mainz, Germany.", "countries": "Germany", "abstract": "We present the first visualization tool that enables a comparative depiction of structural stress tensor data for vessel walls of cerebral aneurysms. Such aneurysms bear the risk of rupture, whereas their treatment also carries considerable risks for the patient. Medical researchers emphasize the importance of analyzing the interaction of morphological and hemodynamic information for the patient-specific rupture risk evaluation and treatment analysis. Tensor data such as the stress inside the aneurysm walls characterizes the interplay between the morphology and blood flow and seems to be an important rupture-prone criterion. We use different glyph-based techniques to depict local stress tensors simultaneously and compare their applicability to cerebral aneurysms in a user study. We thus offer medical researchers an effective visual exploration tool to assess the aneurysm rupture risk. We developed a GPU-based implementation of our techniques with a flexible interactive data exploration mechanism. Our depictions are designed in collaboration with domain experts, and we provide details about the evaluation.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13171", "refList": ["10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1148/rg.233025036", "10.1177/1473871611416549", "10.3171/2009.2.focus0921", "10.1109/tvcg.2011.235", "10.1109/tvcg.2015.2467961", "10.1002/mrm.1910360612", "10.1109/visual.2002.1183797", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2011.243", "10.1161/strokeaha.113.004421", "10.2312/conf/eg2013/stars/039-063", "10.1007/978-3-319-24571-3\\_48", "10.2312/vissym/vissym04/147-154", "10.1016/j.cag.2011.01.011", "10.1007/s10439-012-0632-2", "10.1007/s007910050004", "10.3174/ajnr.a4157", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.3174/ajnr.a3558", "10.1111/j.1467-8659.2009.01711.x", "10.1155/2016/9307560", "10.1109/tvcg.2010.199", "10.1111/cgf.12119", "10.1111/cgf.12355", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864509", "title": "Visual Analysis of Aneurysm Data using Statistical Graphics", "year": "2018", "conferenceName": "SciVis", "authors": "Monique Meuschke;Tobias Günther;Philipp Berg;Ralph Wickenhöfer;Bernhard Preim;Kai Lawonn", "citationCount": "1", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Magdeburg, Germany. Meuschke, M (Corresponding Author), Res Campus STIMULATE, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Univ Magdeburg, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Res Campus STIMULATE, Magdeburg, Germany. Gunther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland. Wickenhoefer, Ralph, Heart Jesus Hosp, Dernbach, Germany. Lawonn, Kai, Univ Koblenz Landau, Koblenz, Germany.", "countries": "Germany;Switzerland", "abstract": "This paper presents a framework to explore multi-field data of aneurysms occurring at intracranial and cardiac arteries by using statistical graphics. The rupture of an aneurysm is often a fatal scenario, whereas during treatment serious complications for the patient can occur. Whether an aneurysm ruptures or whether a treatment is successful depends on the interaction of different morphological such as wall deformation and thickness, and hemodynamic attributes like wall shear stress and pressure. Therefore, medical researchers are very interested in better understanding these relationships. However, the required analysis is a time-consuming process, where suspicious wall regions are difficult to detect due to the time-dependent behavior of the data. Our proposed visualization framework enables medical researchers to efficiently assess aneurysm risk and treatment options. This comprises a powerful set of views including 2D and 3D depictions of the aneurysm morphology as well as statistical plots of different scalar fields. Brushing and linking aids the user to identify interesting wall regions and to understand the influence of different attributes on the aneurysm's state. Moreover, a visual comparison of pre- and post-treatment as well as different treatment options is provided. Our analysis techniques are designed in collaboration with domain experts, e.g., physicians, and we provide details about the evaluation.", "keywords": "Medical visualizations,aneurysms,blood flow,parametrization", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864509", "refList": ["10.1109/tvcg.2013.139", "10.1136/neurintsurg-2014-011247", "10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1111/j.1467-8659.2008.01289.x", "10.3171/2009.2.focus0921", "10.1109/tvcg.2011.235", "10.1080/03610910903168603", "10.1111/cgf.12911", "10.1145/2516971.2516977", "10.1590/s2179-83972012000100014", "10.1109/mcg.2018.032421654", "10.1109/tvcg.2016.2598795", "10.1016/b978-0-12-811018-8.00014-x", "10.1145/1360612.1360643", "10.1111/cgf.12369", "10.1109/smi.2005.17", "10.1186/s12968-015-0174-5", "10.2312/conf/eg2013/stars/039-063", "10.1109/enc.2004.1342596", "10.1067/mje.2002.123374", "10.1016/j.jbiomech.2015.09.039", "10.2312/vissym/vissym04/147-154", "10.1115/1.4033082", "10.1016/j.cag.2011.01.011", "10.1002/jmri.20361", "10.1007/s007910050004", "10.1109/tvcg.2010.111", "10.1016/j.cag.2016.05.024", "10.1109/tvcg.2010.153", "10.1109/visual.2000.885739", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.1007/978-3-662-46224-9\\_45", "10.1109/iv.2005.3", "10.3171/2013.12.jns13945", "10.1007/s00115-011-3372-x", "10.2307/2032161", "10.1109/tvcg.2016.2598866", "10.1115/1.4026108", "10.1161/01.str.0000260955.51401.cd", "10.1111/cgf.13171", "10.1111/cgf.12355", "10.1098/rsif.2011.0490", "10.1109/34.868688", "10.1109/42.875181", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 5}, {"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.1008", "year": "2020", "title": "Tensor Spines - A Hyperstreamlines Variant Suitable for Indefinite Symmetric Second-Order Tensors", "conferenceName": "PacificVis", "authors": "Vanessa Kretzschmar;Fabian G{\\\"{u}}nther;Markus Stommel;Gerik Scheuermann", "citationCount": "0", "affiliation": "Kretzschmar, V (Corresponding Author), TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, V (Corresponding Author), Univ Leipzig, Leipzig, Germany.\nKretzschmar, Vanessa; Guenther, Fabian; Stommel, Markus, TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, Vanessa; Scheuermann, Gerik, Univ Leipzig, Leipzig, Germany.", "countries": "Germany", "abstract": "Modern engineering uses optimization to design long-living and robust components. One part of this process is to find the optimal stress-aware design under given geometric constraints and loading conditions. Tensor visualization provides techniques to show and evaluate the stress distribution based on finite element method simulations. One such technique are hyperstreamlines. They allow us to explore the stress along a line following one principal stress direction while showing the other principal stress directions and their values. In this paper, we show shortcomings of this approach from an engineer's point of view and propose a variant called tensor spines. It provides an improved perception of the relation between the principal stresses helping engineers to optimize their designs further.", "keywords": "Human-centered computing; Visualization; Visualization techniques", "link": "https://doi.org/10.1109/PacificVis48177.2020.1008", "refList": ["10.1109/38.219447", "10.1002/nag.223", "10.1109/tvcg.2016.2598998", "10.1109/pacificvis.2014.51", "10.1111/cgf.13693", "10.1109/tvcg.2015.2484343", "10.1111/cgf.13434", "10.1007/s00371-017-1450-1", "10.1007/b106657\\_8", "10.1109/scivis.2015.7429491", "10.1111/j.1467-8659.2012.03231.x", "10.2312/vissym/vissym04/147-154", "10.1109/visual.2004.105", "10.1111/cgf.13423", "10.1109/visual.2003.1250379", "10.1111/cgf.13171", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13434", "year": "2018", "title": "Illustrative Multivariate Visualization for Geological Modelling", "conferenceName": "EuroVis", "authors": "Allan Rocha;Roberta C. Ramos Mota;Hamidreza Hamdi;Usman R. Alim;Mario Costa Sousa", "citationCount": "3", "affiliation": "Rocha, A (Corresponding Author), Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nRocha, A.; Mota, R. C. R.; Alim, U. R.; Sousa, M. Costa, Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nHamdi, H., Univ Calgary, Dept Geosci, Calgary, AB, Canada.", "countries": "Canada", "abstract": "In this paper, we present a novel illustrative multivariate visualization for geological modelling to assist geologists and reservoir engineers in visualizing multivariate datasets in superimposed representations, in contrast to the single-attribute visualizations supported by commercial software. Our approach extends the use of decals from a single surface to 3D irregular grids, using the layering concept to represent multiple attributes. We also build upon prior work to augment the design and implementation of different geological attributes (namely, rock type, porosity, and permeability). More specifically, we propose a new sampling strategy to generate decals for porosity on the geological grid, a hybrid visualization for permeability which combines 2D decals and 3D ellipsoid glyphs, and a perceptually-based design that allows us to visualize additional attributes (e.g., oil saturation) while avoiding visual interference between layers. Furthermore, our visual design draws from traditional geological illustrations, facilitating the understanding and communication between interdisciplinary teams. An evaluation by domain experts highlights the potential of our approach for geological modelling and interpretation in this complex domain.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13434", "refList": ["10.1145/1408626.1408633", "10.1145/2983310.2985762", "10.1177/1473871611416549", "10.1109/sibgrapi.2011.20", "10.1109/visual.1999.809905", "10.1109/tvcg.2012.34", "10.1145/2076354.2076390", "10.2312/egt.20061068", "10.1109/tvcg.2011.127", "10.1144/sp347.13", "10.1016/j.cag.2017.05.001", "10.1109/tvcg.2008.170", "10.2312/envirvis.20161099", "10.1109/tvcg.2017.2747545", "10.1111/cgf.13322", "10.1109/tvcg.2013.124", "10.2312/conf/eg2013/stars/039-063", "10.2312/vissym/vissym04/147-154", "10.1016/j.cag.2011.01.011", "10.1111/cgf.12127", "10.1145/1179849.1180035", "10.1016/j.gmod.2016.02.001", "10.1109/sibgrapi.2015.12", "10.1111/j.1467-8659.2009.01429.x", "10.3997/2214-4609.201411305", "10.1016/j.cag.2017.05.005", "10.1144/petgeo2012-074", "10.1109/tvcg.2012.110", "10.1007/s11390-015-1535-0", "10.1109/sibgrapi.2011.45", "10.1145/1281500.1281671", "10.1145/2448531.2448537", "10.20380/gi2014.19", "10.2312/envirvis.20171101", "10.1111/cgf.13171", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/pacificvis48177.2020.1008", "year": "2020", "title": "Tensor Spines - A Hyperstreamlines Variant Suitable for Indefinite Symmetric Second-Order Tensors", "conferenceName": "PacificVis", "authors": "Vanessa Kretzschmar;Fabian G{\\\"{u}}nther;Markus Stommel;Gerik Scheuermann", "citationCount": "0", "affiliation": "Kretzschmar, V (Corresponding Author), TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, V (Corresponding Author), Univ Leipzig, Leipzig, Germany.\nKretzschmar, Vanessa; Guenther, Fabian; Stommel, Markus, TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, Vanessa; Scheuermann, Gerik, Univ Leipzig, Leipzig, Germany.", "countries": "Germany", "abstract": "Modern engineering uses optimization to design long-living and robust components. One part of this process is to find the optimal stress-aware design under given geometric constraints and loading conditions. Tensor visualization provides techniques to show and evaluate the stress distribution based on finite element method simulations. One such technique are hyperstreamlines. They allow us to explore the stress along a line following one principal stress direction while showing the other principal stress directions and their values. In this paper, we show shortcomings of this approach from an engineer's point of view and propose a variant called tensor spines. It provides an improved perception of the relation between the principal stresses helping engineers to optimize their designs further.", "keywords": "Human-centered computing; Visualization; Visualization techniques", "link": "https://doi.org/10.1109/PacificVis48177.2020.1008", "refList": ["10.1109/38.219447", "10.1002/nag.223", "10.1109/tvcg.2016.2598998", "10.1109/pacificvis.2014.51", "10.1111/cgf.13693", "10.1109/tvcg.2015.2484343", "10.1111/cgf.13434", "10.1007/s00371-017-1450-1", "10.1007/b106657\\_8", "10.1109/scivis.2015.7429491", "10.1111/j.1467-8659.2012.03231.x", "10.2312/vissym/vissym04/147-154", "10.1109/visual.2004.105", "10.1111/cgf.13423", "10.1109/visual.2003.1250379", "10.1111/cgf.13171", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.7567", "year": "2020", "title": "PINGU Principles of Interactive Navigation for Geospatial Understanding", "conferenceName": "PacificVis", "authors": "Zolt{\\'{a}}n Or{\\'{e}}mus;Kahin Akram Hassan;Jir{\\'{\\i}} Chmel{\\'{\\i}}k;Michaela Knazkov{\\'{a}};Jan Byska;Renata Georgia Raidou;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nOremus, Zoltan; Chmelik, Jiri; Knazkova, Michaela; Byska, Jan; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nHassan, Kahin Akram, Linkoping Univ, Linkoping, Sweden.\nRaidou, Renata Georgia, TU Wien, Vienna, Austria.", "countries": "Sweden;Republic;Austria", "abstract": "Monitoring conditions in the periglacial areas of Antarctica helps geographers and geologists to understand physical processes associated with mesoscale land systems. Analyzing these unique temporal datasets poses a significant challenge for domain experts, due to the complex and often incomplete data, for which corresponding exploratory tools are not available. In this paper, we present a novel visual analysis tool for extraction and interactive exploration of temporal measurements captured at the polar station at the James Ross Island in Antarctica. The tool allows domain experts to quickly extract information about the snow level, originating from a series of photos acquired by trail cameras. Using linked views, the domain experts can interactively explore and combine this information with other spatial and non-spatial measures, such as temperature or wind speed, to reveal the interplay of periglacial and aeolian processes. An abstracted interactive map of the area indicates the position of measurement spots to facilitate navigation. The design of the tool was made in tight collaboration with geographers, which resulted in an early prototype, tested in the pilot study. The following version of the tool and its usability has been evaluated in the user study with five domain experts and their feedback was incorporated into the final version, presented in this paper. This version was again discussed with two experts in an informal interview. Within these evaluations, they confirmed the significant benefit of the tool for their research tasks.", "keywords": "Human-centered computing; Visualization; Visualization techniques; Treemaps; Human-centered computing; Visualization; Visualization design and evaluation methods", "link": "https://doi.org/10.1109/PacificVis48177.2020.7567", "refList": ["10.1109/vast.2012.6400553", "10.2307/1269768", "10.1109/iv.2005.135", "10.1145/1456650.1456652", "10.1016/j.cag.2013.01.010", "10.1109/vast.2014.7042489", "10.1002/2017gl074039", "10.1109/tvcg.2013.126", "10.1111/j.1467-8306.2005.00449.x", "10.1177/1473871612457601", "10.1002/fee.1222", "10.1029/2009jf001306", "10.1088/1742-6596/500/18/182006", "10.1109/visual.1991.175794", "10.1109/tvcg.2008.170", "10.1109/vl.1996.545307", "10.1109/cmv.2004.1319531", "10.1007/bf01898350", "10.5194/tc-7-1399-2013", "10.1007/s00267-008-9086-6", "10.1109/tvcg.2011.181", "10.1007/s10109-004-0127-2", "10.1109/iv.2005.3", "10.1007/978-3-540-33037-0\\_10", "10.1109/tvcg.2017.2779501", "10.1111/j.1467-8659.2012.03184.x", "10.1038/sj.bdj.2008.292", "10.1016/j.jvlc.2011.04.001", "10.1111/cgf.12390", "10.1111/cgf.12650", "10.1111/j.1467-8659.2011.01947.x", "10.1111/cgf.13434", "10.1364/oe.15.000033", "10.1111/cgf.13279", "10.1109/tvcg.2008.139", "10.1007/978-3-540-33037-010", "10.1016/j.cag.2007.01.030", "10.1029/2001jd000927", "10.1016/s0167-9473(02)00295-5"], "wos": 1, "children": [], "len": 1}], "len": 5}], "len": 17}], "len": 147}, "index": 512, "embedding": [-2.1502761840820312, 3.995985269546509, -1.0366979837417603, -2.298758029937744, -0.6896921992301941, 0.16650904715061188, 1.5355430841445923, 4.02078104019165, 8.98490047454834, 6.641111850738525, 2.3261916637420654, 2.246433734893799, 6.642498970031738, 6.156700134277344, 12.72124195098877, 2.83733868598938, 0.18963736295700073, 0.06749609857797623, 3.364043951034546, 9.068880081176758, -0.06630208343267441, 10.038650512695312, 8.164521217346191, 10.604594230651855, -2.388123035430908, 18.730819702148438, -0.561912477016449, 1.9391580820083618, 1.5908626317977905, -2.5266754627227783, 5.409060478210449, 6.171628952026367], "projection": [2.211520195007324, 12.01882266998291], "size": 74, "height": 7, "width": 23}