{"data": {"doi": "10.1109/tvcg.2016.2598588", "title": "PROACT: Iterative Design of a Patient-Centered Visualization for Effective Prostate Cancer Health Risk Communication", "year": "2016", "conferenceName": "InfoVis", "authors": "Anzu Hakone;Lane Harrison;Alvitta Ottley;Nathan Winters;Caitlin Gutheil;Paul K. J. Han;Remco Chang", "citationCount": "7", "affiliation": "Hakone, A (Corresponding Author), Tufts Univ, Medford, MA 02155 USA. Hakone, Anzu; Ottley, Alvitta; Winters, Nathan; Chang, Remco, Tufts Univ, Medford, MA 02155 USA. Harrison, Lane, Worcester Polytech Inst, Worcester, MA 01609 USA. Gutheil, Caitlin; Han, Paul K. J., Maine Med Ctr, Portland, ME 04102 USA.", "countries": "USA", "abstract": "Prostate cancer is the most common cancer among men in the US, and yet most cases represent localized cancer for which the optimal treatment is unclear. Accumulating evidence suggests that the available treatment options, including surgery and conservative treatment, result in a similar prognosis for most men with localized prostate cancer. However, approximately 90% of patients choose surgery over conservative treatment, despite the risk of severe side effects like erectile dysfunction and incontinence. Recent medical research suggests that a key reason is the lack of patient-centered tools that can effectively communicate personalized risk information and enable them to make better health decisions. In this paper, we report the iterative design process and results of developing the PROgnosis Assessment for Conservative Treatment (PROACT) tool, a personalized health risk communication tool for localized prostate cancer patients. PROACT utilizes two published clinical prediction models to communicate the patients' personalized risk estimates and compare treatment options. In collaboration with the Maine Medical Center, we conducted two rounds of evaluations with prostate cancer survivors and urologists to identify the design elements and narrative structure that effectively facilitate patient comprehension under emotional distress. Our results indicate that visualization can be an effective means to communicate complex risk information to patients with low numeracy and visual literacy. However, the visualizations need to be carefully chosen to balance readability with ease of comprehension. In addition, due to patients' charged emotional state, an intuitive narrative structure that considers the patients' information need is critical to aid the patients' comprehension of their risk information.", "keywords": "Design studies;task and requirement analysis;presentation;production;and dissemination;medical visualization", "link": "http://dx.doi.org/10.1109/TVCG.2016.2598588", "refList": ["10.1002/(sici)1099-0720(199804)12:2", "10.1109/titb.2009.2037751", "10.1177/1473871615594652", "10.1016/s0277-9536(99)00145-8", "10.1016/j.pec.2003.09.007", "10.1177/0272989x0002000208", "10.1158/1055-9965.epi-13-0513", "10.1093/jamia/ocv006", "10.1177/0002764294038002006", "10.2307/1914185", "10.1145/2470654.2481410", "10.1200/jco.2008.18.2501", "10.1109/tvcg.2013.89", "10.1037/a0014474", "10.1109/tvcg.2012.219", "10.1136/bmjopen-2013-003226", "10.1109/tvcg.2012.180", "10.1001/jamainternmed.2014.3021", "10.1109/tvcg.2014.2346984", "10.1002/cncr.23908", "10.1037/a0024850", "10.1177/0272989x08327396", "10.1016/j.pec.2008.07.023", "10.1145/2702123.2702590", "10.1056/nejmoa043739", "10.1109/tvcg.2013.200", "10.1145/2470654.2470723", "10.1109/tvcg.2012.225", "10.1056/nejmp1109283", "10.1109/tvcg.2014.2346682", "10.4018/978-1-4666-4309-3.ch012", "10.1016/j.juro.2012.11.174", "10.1093/iwc/iwu043", "10.1186/1472-6947-13-s2-s7", "10.1016/j.ijmedinf.2011.03.005", "10.1016/j.pec.2012.02.006", "10.2105/ajph.2009.160234", "10.1001/jama.2009.1348", "10.6004/jnccn.2011.0061", "10.1109/tvcg.2015.2467758", "10.1016/j.cag.2007.01.030"], "wos": 1, "children": [{"doi": "10.1111/cgf.13413", "year": "2018", "title": "Bladder Runner: Visual Analytics for the Exploration of RT-Induced Bladder Toxicity in a Cohort Study", "conferenceName": "EuroVis", "authors": "Renata G. Raidou;Oscar Casares{-}Magaz;Artem Amirkhanov;Vitali Moiseenko;Ludvig P. Muren;John P. Einck;Anna Vilanova;M. Eduard Gr{\\\"{o}}ller", "citationCount": "6", "affiliation": "Raidou, RG (Corresponding Author), TU Wien, Vienna, Austria.\nRaidou, R. G.; Amirkhanov, A.; Groeller, M. E., TU Wien, Vienna, Austria.\nCasares-Magaz, O.; Muren, L. P., Arhus Univ Hosp, Dept Med Phys, Aarhus, Denmark.\nMoiseenko, V.; Einck, J. P., Univ Calif San Diego, Dept Radiat Med \\& Appl Sci, San Diego, CA USA.\nVilanova, A., Delft Univ Technol, Delft, Netherlands.\nGroeller, M. E., VRVis Res Ctr, Vienna, Austria.", "countries": "Netherlands;USA;Austria;Denmark", "abstract": "We present the Bladder Runner, a novel tool to enable detailed visual exploration and analysis of the impact of bladder shape variation on the accuracy of dose delivery, during the course of prostate cancer radiotherapy (RT). Our tool enables the investigation of individual patients and cohorts through the entire treatment process, and it can give indications of RT-induced complications for the patient. In prostate cancer RT treatment, despite the design of an initial plan prior to dose administration, bladder toxicity remains very common. The main reason is that the dose is delivered in multiple fractions over a period of weeks, during which, the anatomical variation of the bladder - due to differences in urinary filling - causes deviations between planned and delivered doses. Clinical researchers want to correlate bladder shape variations to dose deviations and toxicity risk through cohort studies, to understand which specific bladder shape characteristics are more prone to side effects. This is currently done with Dose-Volume Histograms (DVHs), which provide limited, qualitative insight. The effect of bladder variation on dose delivery and the resulting toxicity cannot be currently examined with the DVHs. To address this need, we designed and implemented the Bladder Runner, which incorporates visualization strategies in a highly interactive environment with multiple linked views. Individual patients can be explored and analyzed through the entire treatment period, while inter-patient and temporal exploration, analysis and comparison are also supported. We demonstrate the applicability of our presented tool with a usage scenario, employing a dataset of 29 patients followed through the course of the treatment, across 13 time points. We conducted an evaluation with three clinical researchers working on the investigation of RT-induced bladder toxicity. All participants agreed that Bladder Runner provides better understanding and new opportunities for the exploration and analysis of the involved cohort data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13413", "refList": ["10.1109/tvcg.2015.2467435", "10.1109/tvcg.2016.2598588", "10.1109/tvcg.2014.2346591", "10.1111/cgf.12899", "10.2312/vcbm.20161287", "10.2312/l0calchapterevents/italchap/italianchapc0nf2008/129-136", "10.1002/cncr.21324", "10.1016/j.media.2017.03.001", "10.1016/s0167-8140(17)30929-5", "10.1118/1.3523624", "10.1109/tvcg.2013.213", "10.1016/j.eswa.2013.03.006", "10.1118/1.3668060", "10.23915/distill.00002", "10.1016/j.ijrobp.2007.11.044", "10.2312/conf/eg2013/stars/039-063", "10.1111/j.1467-8659.2009.01668.x", "10.1109/34.1000236", "10.1007/s00371-010-0541-z", "10.1118/1.4754659", "10.1016/j.cag.2008.09.014", "10.1109/tvcg.2011.279", "10.1016/j.cag.2017.05.005", "10.1016/j.radonc.2011.08.037", "10.1120/jacmp.v8i1.2286", "10.1109/mcg.2015.49", "10.1109/vast.2014.7042491", "10.1016/j.cag.2015.08.008", "10.1109/tvcg.2015.2467198", "10.1118/1.1992207", "10.1117/12.234691", "10.1109/tvcg.2010.20", "10.1007/978-3-319-24523-2\\_10"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934546", "title": "Cohort-based T-SSIM Visual Computing for Radiation Therapy Prediction and Exploration", "year": "2019", "conferenceName": "SciVis", "authors": "Andrew Wentzel;Peter Hanula;Timothy Luciani;Baher Elgohari;Hesham Elhalawani;Guadalupe Canahuate;David M. Vock;Clifton D. Fuller;G. Elisabeta Marai", "citationCount": "0", "affiliation": "Wentzel, A (Corresponding Author), Univ Illinois, Chicago, IL 60680 USA. Wentzel, A.; Hanula, P.; Luciani, T.; Marai, G. E., Univ Illinois, Chicago, IL 60680 USA. Elgohari, B.; Elhalawani, H.; Fuller, C. D., Univ Texas Houston, MD Anderson Canc Ctr, 1515 Holcombe Blvd, Houston, TX 77030 USA. Canahuate, G., Univ Iowa, Iowa City, IA 52242 USA. Vock, D., Univ Minnesota, Sch Publ Hlth, Minneapolis, MN 55455 USA.", "countries": "USA", "abstract": "We describe a visual computing approach to radiation therapy (RT) planning, based on spatial similarity within a patient cohort. In radiotherapy for head and neck cancer treatment, dosage to organs at risk surrounding a tumor is a large cause of treatment toxicity. Along with the availability of patient repositories, this situation has lead to clinician interest in understanding and predicting RT outcomes based on previously treated similar patients. To enable this type of analysis, we introduce a novel topology-based spatial similarity measure, T-SSIM, and a predictive algorithm based on this similarity measure. We couple the algorithm with a visual steering interface that intertwines visual encodings for the spatial data and statistical results, including a novel parallel-marker encoding that is spatially aware. We report quantitative results on a cohort of 165 patients, as well as a qualitative evaluation with domain experts in radiation oncology, data management, biostatistics, and medical imaging, who are collaborating remotely.", "keywords": "Biomedical and Medical Visualization,Spatial Techniques,Visual Design,High-Dimensional Data", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934546", "refList": ["10.1109/tvcg.2017.2744459", "10.1111/cgf.12899", "10.1109/mcse.2011.37", "10.1109/tvcg.2010.223", "10.1109/vast.2014.7042481", "10.1186/1471-2105-13-s8-s3", "10.1109/tvcg.2011.185", "10.1007/s10278-013-9619-2", "10.1109/tvcg.2018.2817557", "10.1016/j.cad.2004.07.002", "10.1016/j.mri.2012.04.010", "10.1002/hed.10379", "10.1109/tvcg.2017.2745085", "10.1080/13543784.2018.1506764", "10.1109/mcg.2004.20", "10.1117/12.535112", "10.1109/cbms.2005.42", "10.1109/tvcg.2009.141", "10.2196/medinform.6730", "10.1016/0014-5793(69)80075-x", "10.1111/cgf.13413", "10.1109/tvcg.2012.175", "10.1109/tvcg.2013.142", "10.1088/0031-9155/39/12/007", "10.1109/tip.2003.819861", "10.1109/tvcg.2008.21", "10.1109/biovis.2013.6664348", "10.1109/tvcg.2015.2467441", "10.1016/j.ijrobp.2008.02.048", "10.1109/tvcg.2013.114", "10.1016/0360-3016(96)00174-5", "10.1016/s0168-0102(02)00204-3", "10.1093/bioinformatics/bth933", "10.1109/isbi.2007.357058", "10.1088/0031-9155/51/22/001", "10.1109/tvcg.2013.161", "10.1016/j.ijrobp.2009.05.070", "10.1016/j.radonc.2006.11.024", "10.1111/1467-8659.00669", "10.1109/69.599932", "10.1109/tvcg.2014.2346755", "10.1200/jco.2005.04.7225"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030363", "title": "Improving the Usability of Virtual Reality Neuron Tracing with Topological Elements", "year": "2020", "conferenceName": "SciVis", "authors": "Torin McDonald;William Usher;Nathan Morrical;Attila Gyulassy;Steve Petruzza;Frederick Federer;Alessandra Angelucci;Valerio Pascucci", "citationCount": "0", "affiliation": "McDonald, T (Corresponding Author), Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. McDonald, Torin; Usher, Will; Morrical, Nate; Gyulassy, Attila; Petruzza, Steve; Pascucci, Valerio, Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Petruzza, Steve, Utah State Univ, Logan, UT 84322 USA. Federer, Frederick; Angelucci, Alessandra, Univ Utah, Moran Ese Inst, Salt Lake City, UT 84112 USA.", "countries": "USA", "abstract": "Researchers in the field of connectomics are working to reconstruct a map of neural connections in the brain in order to understand at a fundamental level how the brain processes information. Constructing this wiring diagram is done by tracing neurons through high-resolution image stacks acquired with fluorescence microscopy imaging techniques. While a large number of automatic tracing algorithms have been proposed, these frequently rely on local features in the data and fail on noisy data or ambiguous cases, requiring time-consuming manual correction. As a result, manual and semi-automatic tracing methods remain the state-of-the-art for creating accurate neuron reconstructions. We propose a new semi-automatic method that uses topological features to guide users in tracing neurons and integrate this method within a virtual reality (VR) framework previously used for manual tracing. Our approach augments both visualization and interaction with topological elements, allowing rapid understanding and tracing of complex morphologies. In our pilot study, neuroscientists demonstrated a strong preference for using our tool over prior approaches, reported less fatigue during tracing, and commended the ability to better understand possible paths and alternatives. Quantitative evaluation of the traces reveals that users' tracing speed increased, while retaining similar accuracy compared to a fully manual approach.", "keywords": "Virtual Reality,Morse-Smale Complex,Semi-automatic Neuron Tracing", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030363", "refList": ["10.1038/nmeth.2869", "10.18637/jss.v028.c01", "10.1177/1473871611416549", "10.1016/j.celrep.2020.107523", "10.1602/neurorx.1.2.182", "10.1038/nprot.2014.191", "10.1136/jnnp-2011-300403", "10.1126/sciadv.aax5851", "10.2312/pe.vmv.vmv13.105-112", "10.1038/s43018-020-0031-9", "10.1109/tvcg.2013.213", "10.1093/jnci/92.8.613", "10.1109/52.329404", "10.1109/tvcg.2017.2785271", "10.1007/s11548-013-0820-z", "10.1109/tvcg.2019.2934547", "10.1002/cjp2.113", "10.1080/2162402x.2018.1507600", "10.1109/tvcg.2013.124", "10.1016/s0140-6736(14)60958-2", "10.1038/s41467-017-01689-9", "10.1016/j.cell.2018.07.010", "10.1007/978-3-319-24523-2", "10.1038/nrg3832", "10.2352/j.imagingsci.technol.2017.61.6.060404", "10.1109/tvcg.2018.2864907", "10.1111/cgf.13413", "10.1007/978-3-319-67979-2\\_4", "10.1145/2836034.2836040", "10.1038/nmeth.2563", "10.1016/0377-0427(87)90125-7", "10.1016/j.immuni.2016.04.014", "10.1002/cyto.a.22702", "10.12688/wellcomeopenres.15191.1", "10.1109/2945.981851", "10.1038/s43018-020-0026-6", "10.5281/zenodo", "10.1109/tvcg.2019.2931299", "10.1109/annes.1995.499469", "10.1145/2133806.2133821", "10.1002/hbm.20701", "10.1109/tvcg.2013.161", "10.1007/978-3-319-24523-210", "10.1126/scitranslmed.3004330", "10.1038/nmeth.4391", "10.1559/152304003100010929", "10.1126/science.280.5363.585", "10.1007/978-3-319-24523-2\\_10", "10.1109/tvcg.2016.2598587", "10.1038/s41597-019-0258-4"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030336", "title": "Visual cohort comparison for spatial single-cell omics-data", "year": "2020", "conferenceName": "VAST", "authors": "Antonios Somarakis;Marieke E. Ijsselsteijn;Sietse J. Luk;Boyd Kenkhuis;Noel F. C. C. de Miranda;Boudewijn P. F. Lelieveldt;Thomas Höllt", "citationCount": "0", "affiliation": "Hollt, T (Corresponding Author), Delft Univ Technol, Comp Graph \\& Visualizat Grp, Delft, Netherlands. Hollt, T (Corresponding Author), Leiden Univ, Med Ctr, Leiden Computat Biol Ctr, Leiden, Netherlands. Somarakis, Antonios; Lelieveldt, Boudewijn P. F., Leiden Univ, Med Ctr, Dept Radiol, Div Image Proc, Leiden, Netherlands. Ijsselsteijn, Marieke E.; de Miranda, Noel F. C. C., Leiden Univ, Med Ctr, Dept Pathol, Immunogen Grp, Leiden, Netherlands. Luk, Sietse J., Leiden Univ, Med Ctr, Hematol Dept, Leiden, Netherlands. Kenkhuis, Boyd, Leiden Univ, Med Ctr, Human Genet Dept, Leiden, Netherlands. Hollt, Thomas, Delft Univ Technol, Comp Graph \\& Visualizat Grp, Delft, Netherlands. Hollt, Thomas, Leiden Univ, Med Ctr, Leiden Computat Biol Ctr, Leiden, Netherlands.", "countries": "Netherlands", "abstract": "Spatially-resolved omics-data enable researchers to precisely distinguish cell types in tissue and explore their spatial interactions, enabling deep understanding of tissue functionality. To understand what causes or deteriorates a disease and identify related biomarkers, clinical researchers regularly perform large-scale cohort studies, requiring the comparison of such data at cellular level. In such studies, with little a-priori knowledge of what to expect in the data, explorative data analysis is a necessity. Here, we present an interactive visual analysis workflow for the comparison of cohorts of spatially-resolved omics-data. Our workflow allows the comparative analysis of two cohorts based on multiple levels-of-detail, from simple abundance of contained cell types over complex co-localization patterns to individual comparison of complete tissue images. As a result, the workflow enables the identification of cohort-differentiating features, as well as outlier samples at any stage of the workflow. During the development of the workflow, we continuously consulted with domain experts. To show the effectiveness of the workflow, we conducted multiple case studies with domain experts from different application areas and with different data modalities.", "keywords": "Visual analytics,Imaging Mass Cytometry,Vectra,spatially-resolved data,single-cell omics-data,Visual comparison", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030336", "refList": ["10.1038/nmeth.2869", "10.18637/jss.v028.c01", "10.1177/1473871611416549", "10.1016/j.celrep.2020.107523", "10.1602/neurorx.1.2.182", "10.1038/nprot.2014.191", "10.1136/jnnp-2011-300403", "10.1126/sciadv.aax5851", "10.2312/pe.vmv.vmv13.105-112", "10.1038/s43018-020-0031-9", "10.1109/tvcg.2013.213", "10.1093/jnci/92.8.613", "10.1109/52.329404", "10.1109/tvcg.2017.2785271", "10.1007/s11548-013-0820-z", "10.1109/tvcg.2019.2934547", "10.1002/cjp2.113", "10.1080/2162402x.2018.1507600", "10.1109/tvcg.2013.124", "10.1016/s0140-6736(14)60958-2", "10.1038/s41467-017-01689-9", "10.1016/j.cell.2018.07.010", "10.1007/978-3-319-24523-2", "10.1038/nrg3832", "10.2352/j.imagingsci.technol.2017.61.6.060404", "10.1109/tvcg.2018.2864907", "10.1111/cgf.13413", "10.1007/978-3-319-67979-2\\_4", "10.1145/2836034.2836040", "10.1038/nmeth.2563", "10.1101/2020.03.27.001834", "10.1016/0377-0427(87)90125-7", "10.1016/j.immuni.2016.04.014", "10.1002/cyto.a.22702", "10.12688/wellcomeopenres.15191.1", "10.1109/2945.981851", "10.1038/s43018-020-0026-6", "10.1038/s41586-019-1876-x", "10.1109/tvcg.2019.2931299", "10.1109/annes.1995.499469", "10.1145/2133806.2133821", "10.1109/tvcg.2013.161", "10.1007/978-3-319-24523-210", "10.1126/scitranslmed.3004330", "10.1038/nmeth.4391", "10.1111/cgf.14002", "10.1559/152304003100010929", "10.1126/science.280.5363.585", "10.1007/978-3-319-24523-2\\_10", "10.1109/tvcg.2016.2598587", "10.1038/s41597-019-0258-4"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13726", "year": "2019", "title": "State-of-the-Art Report: Visual Computing in Radiation Therapy Planning", "conferenceName": "EuroVis", "authors": "Matthias Schlachter;Renata G. Raidou;Ludvig P. Muren;Bernhard Preim;P. M. Putora;Katja B{\\\"{u}}hler", "citationCount": "1", "affiliation": "Schlachter, M (Corresponding Author), VRVis Res Ctr, Vienna, Austria.\nSchlachter, M.; Buehler, K., VRVis Res Ctr, Vienna, Austria.\nRaidou, R. G., TU Wien, Vienna, Austria.\nMuren, L. P., Aarhus Univ Hosp, Dept Med Phys, Aarhus, Denmark.\nPreim, B., Univ Magdeburg, Magdeburg, Germany.\nPreim, B., Res Campus STIMULATE, Magdeburg, Germany.\nPutora, P. M., Kantonsspital St Gallen, Dept Radiat Oncol, St Gallen, Switzerland.\nPutora, P. M., Univ Bern, Dept Radiat Oncol, Bern, Switzerland.", "countries": "Germany;Switzerland;Austria;Denmark", "abstract": "Radiation therapy (RT) is one of the major curative approaches for cancer. It is a complex and risky treatment approach, which requires precise planning, prior to the administration of the treatment. Visual Computing (VC) is a fundamental component of RT planning, providing solutions in all parts of the process-from imaging to delivery. Despite the significant technological advancements of RT over the last decades, there are still many challenges to address. This survey provides an overview of the compound planning process of RT, and of the ways that VC has supported RT in all its facets. The RT planning process is described to enable a basic understanding in the involved data, users and workflow steps. A systematic categorization and an extensive analysis of existing literature in the joint VC/RT research is presented, covering the entire planning process. The survey concludes with a discussion on lessons learnt, current status, open challenges, and future directions in VC/RT research.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13726", "refList": ["10.1016/j.ijrobp.2014.01.046", "10.1016/j.ijrobp.2004.11.037", "10.1118/1.1935775", "10.21037/tlcr.2016.06.07", "10.1109/vast.2014.7042481", "10.1017/s1460396917000206", "10.1109/jproc.2002.804685", "10.1111/cgf.12193", "10.1016/j.radonc.2007.08.012", "10.1111/cgf.12927", "10.1016/s0360-3016(02)02866-3", "10.1097/pas.0000000000000530", "10.1088/0031-9155/46/3/304", "10.1145/1268517.1268563", "10.1088/0031-9155/53/12/r01", "10.1109/tvcg.2008.95", "10.1002/acm2.12209", "10.1016/s0167-8140(01)00444-3", "10.1118/1.4896821", "10.1016/j.ijrobp.2011.07.021", "10.1016/s0360-3016(00)00467-3", "10.1038/tp.2012.95", "10.1016/0360-3016(95)00272-3", "10.1111/cgf.13413", "10.1186/s13014-015-0569-3", "10.1097/01.rct.0000156396.13522.f2", "10.1016/j.apradiso.2004.05.049", "10.1118/1.2966347", "10.1146/annurev.bioeng.2.1.315", "10.1038/nrclinonc.2012.203", "10.1109/iembs.1997.756505", "10.1016/s0360-3016(99)00042-5", "10.1080/10408370091179244", "10.1109/ultsym.2001.991951", "10.1016/0360-3016(91)90168-4", "10.1118/1.1420400", "10.2214/ajr.12.8510", "10.3109/0284186x.2011.590524", "10.2214/ajr.09.2527", "10.1109/tmi.2017.2717800", "10.1016/j.adro.2017.04.005", "10.1146/annurev.bioeng.1.1.377", "10.1016/j.radonc.2009.12.034", "10.1016/j.ijrobp.2009.07.1754", "10.1109/tmi.2013.2265603", "10.1186/s13014-015-0404-x", "10.2312/vcbm.20161287", "10.1109/bmei.2013.6746924", "10.1016/j.ijrobp.2005.05.008", "10.1007/s10278-010-9321-6", "10.1016/j.ijom.2017.08.002", "10.4103/0971-6203.44472", "10.1016/s0360-3016(01)02805-x", "10.1002/jmri.21513", "10.1109/nssmic.1991.259172", "10.1007/s10278-016-9915-8", "10.1088/0031-9155/59/11/2687", "10.1118/1.4905050", "10.1287/opre.1070.0484", "10.1148/rg.271065078", "10.1102/1470-7330.2007.0013", "10.1016/j.ijrobp.2005.10.006", "10.1016/j.clon.2017.09.007", "10.3109/0284186x.2010.498433", "10.1109/vbc.1990.109295", "10.1016/j.cag.2010.05.016", "10.1111/cgf.12613", "10.1016/j.ijrobp.2008.05.011", "10.1109/iv.1997.626463", "10.1007/s10278-015-9839-8", "10.1088/0031-9155/38/6/001", "10.1016/j.cag.2013.10.015", "10.1007/s00066-004-1275-5", "10.1016/j.artmed.2008.11.003", "10.1016/j.ijrobp.2013.10.028", "10.1109/nssmic.2010.5874096", "10.1109/visual.1995.480795", "10.1111/1759-7714.12170", "10.1002/mp.12629", "10.1111/cgf.12165", "10.1118/1.2349696", "10.1148/radiol.2333032098", "10.1016/j.ejmp.2012.11.004", "10.1109/tvcg.2013.143", "10.14791/btrt.2015.3.1.8", "10.1118/1.2815943", "10.1111/cgf.12899", "10.1102/1470-7330.2006.9017", "10.1109/iv.2001.942055", "10.1016/j.media.2016.06.030", "10.1016/s0360-3016(03)00073-7", "10.1111/cgf.13306", "10.1016/j.radonc.2006.05.002", "10.1109/vahc.2017.8387544", "10.1109/titb.2006.875669", "10.1118/1.3521468", "10.1148/radiol.2431030580", "10.1097/mou.0b013e3282f19d01", "10.1016/s1053-4296(99)80051-4", "10.1016/j.suronc.2010.07.004", "10.1109/2945.597794", "10.1016/j.ijrobp.2007.01.056", "10.1088/0031-9155/52/13/n03", "10.1016/j.inffus.2013.12.002", "10.1016/s0958-3947(98)00014-4", "10.1088/0031-9155/44/11/201", "10.7785/tcrt.2012.500256", "10.1016/j.cmpb.2010.10.009", "10.1007/s00330-011-2377-y", "10.1118/1.4754659", "10.1109/icicic.2009.62", "10.1111/j.1467-8659.2011.01954.x", "10.1186/1748-717x-1-47", "10.1109/visual.1996.568110", "10.1007/978-3-540-85990-1\\_85", "10.2147/ott.s64161", "10.1109/tvcg.2007.70569", "10.1016/s0167-8140(02)00140-8", "10.1109/tns.2016.2616884", "10.3109/02841868709089981", "10.2312/vcbm.20161276", "10.1007/978-3-319-46723-8\\_12", "10.1109/iembs.2005.1615886", "10.1002/mp.13115", "10.1109/tvcg.2014.2346574", "10.1016/j.apradiso.2015.12.061", "10.1148/rg.313105139", "10.1120/jacmp.v8i3.2448", "10.1002/cncr.21324", "10.1016/j.jbi.2016.12.001", "10.1109/icmla.2008.126", "10.1007/978-3-642-21414-11", "10.1109/tmi.2016.2560942", "10.1016/0360-3016(96)00204-0", "10.1002/mp.12979", "10.1118/1.4828840", "10.1118/1.3253464", "10.1002/(sici)1522-2586(199909)10:3", "10.3109/0284186x.2013.814152", "10.1088/0031-9155/51/9/009", "10.1016/s1361-8415(00)00041-4", "10.1016/s0262-8856(03)00137-9", "10.1016/j.prro.2011.08.001", "10.1109/vast.2014.7042521", "10.1109/iv.2000.859783", "10.1080/02841860802266763", "10.1186/s40658-016-0151-6", "10.1016/j.radonc.2016.02.030", "10.1093/jicru/ndh001", "10.1109/medcom.2014.7005998", "10.1016/j.acra.2008.09.011", "10.1016/j.clon.2017.10.013", "10.1109/isbi.2012.6235553", "10.1016/j.radonc.2006.11.024", "10.1016/s1361-8415(01)80026-8", "10.2312/vcbm/vcbm08/093-100", "10.1016/s0167-8140(02)00015-4", "10.1109/cw.2017.56", "10.1109/tvcg.2017.2744358", "10.1109/tvcg.2016.2598468", "10.1016/s0360-3016(96)85024-3"], "wos": 1, "children": [], "len": 1}], "len": 11}], "len": 13}, "index": 565, "embedding": [-0.5529411435127258, 0.8799988627433777, -1.0662840604782104, -2.350348949432373, -0.6415178775787354, 0.16650904715061188, -0.7643030881881714, -0.8684300184249878, -0.3445030450820923, -0.12761783599853516, -1.1502896547317505, -0.42197561264038086, 0.11748054623603821, 0.6447764039039612, 0.98695969581604, 1.5629020929336548, 0.6750099062919617, 0.7720031142234802, -0.08270654082298279, 1.4006404876708984, -0.06630208343267441, -0.030275052413344383, 0.4859762489795685, 1.5050746202468872, -2.343374252319336, 1.6785050630569458, -0.5536867380142212, 1.3233884572982788, 0.015528452582657337, -1.981865644454956, 0.3905765414237976, 0.7561728358268738], "projection": [0.02609693445265293, 8.474990844726562], "size": 7, "height": 3, "width": 5}