{"data": {"doi": "10.1109/tvcg.2016.2598825", "title": "Physics-Based Visual Characterization of Molecular Interaction Forces", "year": "2016", "conferenceName": "SciVis", "authors": "Pedro Hermosilla;Jorge Estrada;Victor Guallar;Timo Ropinski;Àlvar Vinacua;Pere-Pau Vázquez", "citationCount": "10", "affiliation": "Hermosilla, P (Corresponding Author), ViRVIG Grp, Barcelona, Spain. Hermosilla, P (Corresponding Author), Barcelona Supercomp Ctr, Barcelona, Spain. Hermosilla, Pedro, ViRVIG Grp, Barcelona, Spain. Hermosilla, Pedro; Estrada, Jorge; Guallar, Victor, Barcelona Supercomp Ctr, Barcelona, Spain. Ropinski, Timo, Univ Ulm, Visual Comp Grp, D-89069 Ulm, Germany. Vinacua, Alvar; Vazquez, Pere-Pau, UPC Barcelona, ViRVIG Grp, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "Molecular simulations are used in many areas of biotechnology, such as drug design and enzyme engineering. Despite the development of automatic computational protocols, analysis of molecular interactions is still a major aspect where human comprehension and intuition are key to accelerate, analyze, and propose modifications to the molecule of interest. Most visualization algorithms help the users by providing an accurate depiction of the spatial arrangement: the atoms involved in inter-molecular contacts. There are few tools that provide visual information on the forces governing molecular docking. However, these tools, commonly restricted to close interaction between atoms, do not consider whole simulation paths, long-range distances and, importantly, do not provide visual cues for a quick and intuitive comprehension of the energy functions (modeling intermolecular interactions) involved. In this paper, we propose visualizations designed to enable the characterization of interaction forces by taking into account several relevant variables such as molecule-ligand distance and the energy function, which is essential to understand binding affinities. We put emphasis on mapping molecular docking paths obtained from Molecular Dynamics or Monte Carlo simulations, and provide time-dependent visualizations for different energy components and particle resolutions: atoms, groups or residues. The presented visualizations have the potential to support domain experts in a more efficient drug or enzyme design process.", "keywords": "Molecular visualization;binding analysis", "link": "http://dx.doi.org/10.1109/TVCG.2016.2598825", "refList": ["10.1186/1472-6807-9-19", "10.1109/tvcg.2009.157", "10.1109/tvcg.2007.70517", "10.1186/1758-2946-4-17", "10.1016/j.str.2015.09.012", "10.1111/cgf.12374", "10.1006/jmbi.1996.0663", "10.1021/ci200227u", "10.2312/spbg/spbg06/059-065", "10.1021/ci049885e", "10.1006/jmbi.1998.2400", "10.1111/j.1467-8659.2009.01698.x", "10.1109/tvcg.2014.2350479", "10.1111/j.1467-8659.2012.03128.x", "10.1109/tvcg.2010.250", "10.1371/journal.pcbi.1003321", "10.1107/s0021889811038970", "10.1093/nar/gkt454", "10.1109/tvcg.2006.115", "10.1146/annurev-biophys-042910-155245", "10.1107/s0021889808012016", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12375", "10.1109/tvcg.2007.70578", "10.1021/acscatal.6b00028", "10.1093/bib/bbq089", "10.1093/nar/gkv315", "10.1109/tvcg.2015.2467293", "10.1109/tvcg.2012.282", "10.1111/cgf.12373", "10.1093/bioinformatics/btl150", "10.1109/mcg.2013.37", "10.1109/pacificvis.2009.4906853", "10.1109/pacificvis.2012.6183593", "10.1111/cgf.12197", "10.1186/1758-2946-5-40", "10.2312/eurovisstar.20151112", "10.1080/10611860400024078", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2014.2346403", "10.1007/s10822-011-9531-0", "10.1111/cgf.12370", "10.1109/tvcg.2009.168", "10.1016/j.sbi.2007.06.008"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864851", "title": "Visualization of Large Molecular Trajectories", "year": "2018", "conferenceName": "SciVis", "authors": "David Duran;Pedro Hermosilla;Timo Ropinski;Barbora Kozlíková;Àlvar Vinacua;Pere-Pau Vázquez", "citationCount": "1", "affiliation": "Duran, D (Corresponding Author), UPC Barcelona, ViRVIG Grp, Barcelona, Spain. Duran, David; Vinacua, Alvar; Vazquez, Pere-Pau, UPC Barcelona, ViRVIG Grp, Barcelona, Spain. Hermosilla, Pedro; Ropinski, Timo, Univ Ulm, Visual Comp Grp, Ulm, Germany. Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.", "countries": "Spain;Germany;Republic", "abstract": "The analysis of protein-ligand interactions is a time-intensive task. Researchers have to analyze multiple physico-chemical properties of the protein at once and combine them to derive conclusions about the protein-ligand interplay. Typically, several charts are inspected, and 3D animations can be played side-by-side to obtain a deeper understanding of the data. With the advances in simulation techniques, larger and larger datasets are available, with up to hundreds of thousands of steps. Unfortunately, such large trajectories are very difficult to investigate with traditional approaches. Therefore, the need for special tools that facilitate inspection of these large trajectories becomes substantial. In this paper, we present a novel system for visual exploration of very large trajectories in an interactive and user-friendly way. Several visualization motifs are automatically derived from the data to give the user the information about interactions between protein and ligand. Our system offers specialized widgets to ease and accelerate data inspection and navigation to interesting parts of the simulation. The system is suitable also for simulations where multiple ligands are involved. We have tested the usefulness of our tool on a set of datasets obtained from protein engineers, and we describe the expert feedback.", "keywords": "Molecular visualization,simulation inspection,long trajectories", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864851", "refList": ["10.1109/tkde.2016.2557324", "10.1002/anie.199009921", "10.1145/2702123.2702419", "10.1109/mcse.2015.7", "10.1021/ci200227u", "10.1007/s10822-010-9352-6", "10.1016/j.sbi.2012.11.002", "10.1109/tvcg.2014.2350479", "10.3390/e16010233", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1038/nmeth.3258", "10.1109/tvcg.2016.2598797", "10.1109/tvcg.2016.2598825", "10.1186/1753-6561-8-s2-s3", "10.1021/ct400341p", "10.1016/0010-4655(95)00041-d", "10.1111/cgf.12928", "10.1145/1364782.1364802", "10.1109/tvcg.2016.2539960", "10.1109/tvcg.2012.225", "10.1093/bib/bbq089", "10.2312/eurovisshort.20171146", "10.1093/nar/gkv315", "10.1109/bigdata.2015.7363824", "10.1109/tits.2015.2436897", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1186/1753-6561-8-s2-s5", "10.1016/0263-7855(96)00018-5", "10.1093/comjnl/20.4.364", "10.2174/1874091x01610010001", "10.1214/ss/1076102418", "10.1145/2890478", "10.1109/biovis.2012.6378599", "10.1109/tvcg.2014.2346574", "10.1111/cgf.13208", "10.1016/j.sbi.2014.04.002"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934258", "title": "Scale-Space Splatting: Reforming Spacetime for Cross-Scale Exploration of Integral Measures in Molecular Dynamics", "year": "2019", "conferenceName": "SciVis", "authors": "Juraj Pálenik;Jan Byska;Stefan Bruckner;Helwig Hauser", "citationCount": "0", "affiliation": "Palenik, J (Corresponding Author), Univ Bergen, Bergen, Norway. Palenik, Juraj; Byska, Jan; Bruckner, Stefan; Hauser, Helwig, Univ Bergen, Bergen, Norway. Byska, Jan, Masaryk Univ, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "Understanding large amounts of spatiotemporal data from particle-based simulations, such as molecular dynamics, often relies on the computation and analysis of aggregate measures. These, however, by virtue of aggregation, hide structural information about the space/time localization of the studied phenomena. This leads to degenerate cases where the measures fail to capture distinct behaviour. In order to drill into these aggregate values, we propose a multi-scale visual exploration technique. Our novel representation, based on partial domain aggregation, enables the construction of a continuous scale-space for discrete datasets and the simultaneous exploration of scales in both space and time. We link these two scale-spaces in a scale-space space-time cube and model linked views as orthogonal slices through this cube, thus enabling the rapid identification of spatio-temporal patterns at multiple scales. To demonstrate the effectiveness of our approach, we showcase an advanced exploration of a protein-ligand simulation.", "keywords": "Scale space,time-series,scientific simulation,multi-scale analysis,space-time cube,molecular dynamics", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934258", "refList": ["10.1111/cgf.13445", "10.1109/tvcg.2012.191", "10.1201/b14876", "10.1145/827051.827056", "10.1080/07391102.2005.10531229", "10.1021/acs.jcim.7b00070", "10.1007/978-3-8348-9190-729", "10.1111/cgf.13427", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1016/0021-9991(82)90025-0", "10.1111/cgf.13177", "10.1007/978-1-4757-6465-9", "10.1145/1044588.1044615", "10.2307/2669996", "10.1109/tvcg.2018.2865049", "10.1007/978-3-540-70823-0\\_3", "10.1111/cgf.13640", "10.1109/tvcg.2010.253", "10.1109/tvcg.2009.177", "10.1016/j.csda.2018.03.014", "10.1109/tvcg.2009.200", "10.1109/visual.2003.1250353", "10.2312/eurovisshort.20171146", "10.1109/tvcg.2010.148", "10.1002/9780470316849", "10.1109/visual.1993.398859", "10.1007/978-1-4612-4026-6", "10.1016/j.jmb.2018.09.004", "10.1111/cgf.13415", "10.2312/molva.20181102", "10.1371/journal.pcbi.1002708", "10.1007/s10851-010-0242-2", "10.1016/0263-7855(96)00018-5", "10.1109/visual.2003.1250402", "10.1007/bf01936872", "10.1002/wics.79", "10.1111/j.1467-8659.2009.01684.x", "10.1109/tvcg.2018.2864510", "10.1111/cgf.12804", "10.1117/12.904668", "10.1002/jcc.20289", "10.1088/0965-0393/18/1/015012", "10.1109/34.56205", "10.1111/j.1435-5597.1970.tb01464.x", "10.1007/978-0-85729-079-3", "10.1007/s11263-005-1838-7"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}, {"doi": "10.1109/pacificvis.2019.00032", "year": "2019", "title": "Visual Analysis of Ligand Trajectories in Molecular Dynamics", "conferenceName": "PacificVis", "authors": "Adam Jurc{\\'{\\i}}k;Katar{\\'{\\i}}na Furmanov{\\'{a}};Jan Byska;Vojtech Von{\\'{a}}sek;Ondrej V{\\'{a}}vra;Pavol Ulbrich;Helwig Hauser;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nJurcik, Adam; Furmanova, Katarina; Byska, Jan; Vavra, Ondrej; Ulbrich, Pavol; Hauser, Helwig; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nByska, Jan, Univ Bergen, Bergen, Norway.\nVonasek, Vojtech, Czech Tech Univ, Prague, Czech Republic.\nVavra, Ondrej, FNUSA ICRC, Brno, Czech Republic.\nHauser, Helwig, MMIV, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "In many cases, protein reactions with other small molecules (ligands) occur in a deeply buried active site. When studying these types of reactions, it is crucial for biochemists to examine trajectories of ligand motion. These trajectories are predicted with in-silico methods that produce large ensembles of possible trajectories. In this paper, we propose a novel approach to the interactive visual exploration and analysis of large sets of ligand trajectories, enabling the domain experts to understand protein function based on the trajectory properties. The proposed solution is composed of multiple linked 2D and 3D views, enabling the interactive exploration and filtering of trajectories in an informed way. In the workflow, we focus on the practical aspects of the interactive visual analysis specific to ligand trajectories. We adapt the small multiples principle to resolve an overly large number of trajectories into smaller chunks that are easier to analyze. We describe how drill-down techniques can be used to create and store selections of the trajectories with desired properties, enabling the comparison of multiple datasets. In appropriately designed 2D and 3D views, biochemists can either observe individual trajectories or choose to aggregate the information into a functional boxplot or density visualization. Our solution is based on a tight collaboration with the domain experts, aiming to address their needs as much as possible. The usefulness of our novel approach is demonstrated by two case studies, conducted by the collaborating protein engineers.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization; Human-centered computing; Visualization; Visualization systems and toolkits", "link": "https://doi.org/10.1109/PacificVis.2019.00032", "refList": ["10.1021/acscatal.6b02081", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2010.44", "10.1007/s11634-013-0158-y", "10.1186/s12859-016-1445-3", "10.1111/cgf.12106", "10.1021/ci200227u", "10.1007/978-3-319-15976-8\\_1", "10.1039/c3fd00145h", "10.1109/tvcg.2014.2346455", "10.1080/13658816.2010.511223", "10.1002/jcc.21334", "10.1109/tvcg.2016.2598825", "10.1109/romoco.2017.8003911", "10.1093/bioinformatics/btx125", "10.1109/tvcg.2006.99", "10.1111/cgf.12928", "10.1038/nchembio.205", "10.1002/anie.201206708", "10.1002/prot.25177", "10.1198/jcgs.2009.08158", "10.1021/bi901900s", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/bti1017", "10.1016/s0065-3233(08)60520-3", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.2312/molva.20181102", "10.1021/ct9000685", "10.1074/jbc.ra117.000328", "10.2312/vcbm.20171235", "10.1111/cgf.13428"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13428", "year": "2018", "title": "Visual Analysis of protein-ligand interactions", "conferenceName": "EuroVis", "authors": "Pere{-}Pau V{\\'{a}}zquez;Pedro Hermosilla;Victor Guallar;Jorge Estrada;{\\`{A}}lvar Vinacua", "citationCount": "5", "affiliation": "Vazquez, P (Corresponding Author), Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nVazquez, P.; Vinacua, A., Univ Politecn Cataluna, ViRVIG Grp, Barcelona, Spain.\nHermosilla, P., Univ Ulm, Visual Comp Grp, Ulm, Germany.\nGuallar, V.; Estrada, J., Barcelona SuperComp Ctr, Barcelona, Spain.\nGuallar, V., ICREA, Barcelona, Spain.", "countries": "Spain;Germany", "abstract": "The analysis of protein-ligand interactions is complex because of the many factors at play. Most current methods for visual analysis provide this information in the form of simple 2D plots, which, besides being quite space hungry, often encode a low number of different properties. In this paper we present a system for compact 2D visualization of molecular simulations. It purposely omits most spatial information and presents physical information associated to single molecular components and their pairwise interactions through a set of 2D InfoVis tools with coordinated views, suitable interaction, and focus+context techniques to analyze large amounts of data. The system provides a wide range of motifs for elements such as protein secondary structures or hydrogen bond networks, and a set of tools for their interactive inspection, both for a single simulation and for comparing two different simulations. As a result, the analysis of protein-ligand interactions of Molecular Simulation trajectories is greatly facilitated.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13428", "refList": ["10.1186/1758-2946-4-17", "10.1021/ci200227u", "10.1021/ci049885e", "10.1109/tvcg.2014.2350479", "10.3390/e16010233", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1186/1471-2105-14-244", "10.1371/journal.pcbi.1003321", "10.1107/s0021889811038970", "10.1109/tvcg.2016.2598825", "10.2312/vcbm.20151209", "10.1107/s0021889808012016", "10.1111/cgf.12928", "10.1146/annurev.physchem.51.1.129", "10.1023/a:1008005918983", "10.1111/cgf.12375", "10.1109/tvcg.2007.70578", "10.1093/bioinformatics/btu364", "10.1093/nar/gkv315", "10.1109/tvcg.2015.2467293", "10.1107/s0907444905029604", "10.1073/pnas.95.11.5998", "10.1109/tvcg.2012.282", "10.1111/cgf.12373", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1093/bioinformatics/btl150", "10.1109/pacificvis.2009.4906853", "10.1111/cgf.12197", "10.1080/10611860400024078", "10.1186/1758-2946-5-40", "10.1006/jmbi.1998.2401", "10.1101/gr.092759.109", "10.1109/tvcg.2014.2346403", "10.1002/jcc.20292", "10.1007/s10822-011-9531-0", "10.1093/nar/gkw265", "10.1179/000870403235002042"], "wos": 1, "children": [{"doi": "10.1109/pacificvis.2019.00032", "year": "2019", "title": "Visual Analysis of Ligand Trajectories in Molecular Dynamics", "conferenceName": "PacificVis", "authors": "Adam Jurc{\\'{\\i}}k;Katar{\\'{\\i}}na Furmanov{\\'{a}};Jan Byska;Vojtech Von{\\'{a}}sek;Ondrej V{\\'{a}}vra;Pavol Ulbrich;Helwig Hauser;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nJurcik, Adam; Furmanova, Katarina; Byska, Jan; Vavra, Ondrej; Ulbrich, Pavol; Hauser, Helwig; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nByska, Jan, Univ Bergen, Bergen, Norway.\nVonasek, Vojtech, Czech Tech Univ, Prague, Czech Republic.\nVavra, Ondrej, FNUSA ICRC, Brno, Czech Republic.\nHauser, Helwig, MMIV, Brno, Czech Republic.", "countries": "Republic;Norway", "abstract": "In many cases, protein reactions with other small molecules (ligands) occur in a deeply buried active site. When studying these types of reactions, it is crucial for biochemists to examine trajectories of ligand motion. These trajectories are predicted with in-silico methods that produce large ensembles of possible trajectories. In this paper, we propose a novel approach to the interactive visual exploration and analysis of large sets of ligand trajectories, enabling the domain experts to understand protein function based on the trajectory properties. The proposed solution is composed of multiple linked 2D and 3D views, enabling the interactive exploration and filtering of trajectories in an informed way. In the workflow, we focus on the practical aspects of the interactive visual analysis specific to ligand trajectories. We adapt the small multiples principle to resolve an overly large number of trajectories into smaller chunks that are easier to analyze. We describe how drill-down techniques can be used to create and store selections of the trajectories with desired properties, enabling the comparison of multiple datasets. In appropriately designed 2D and 3D views, biochemists can either observe individual trajectories or choose to aggregate the information into a functional boxplot or density visualization. Our solution is based on a tight collaboration with the domain experts, aiming to address their needs as much as possible. The usefulness of our novel approach is demonstrated by two case studies, conducted by the collaborating protein engineers.", "keywords": "Human-centered computing; Visualization; Visualization application domains; Scientific visualization; Human-centered computing; Visualization; Visualization systems and toolkits", "link": "https://doi.org/10.1109/PacificVis.2019.00032", "refList": ["10.1021/acscatal.6b02081", "10.1109/tvcg.2015.2467204", "10.1109/tvcg.2010.44", "10.1007/s11634-013-0158-y", "10.1186/s12859-016-1445-3", "10.1111/cgf.12106", "10.1021/ci200227u", "10.1007/978-3-319-15976-8\\_1", "10.1039/c3fd00145h", "10.1109/tvcg.2014.2346455", "10.1080/13658816.2010.511223", "10.1002/jcc.21334", "10.1109/tvcg.2016.2598825", "10.1109/romoco.2017.8003911", "10.1093/bioinformatics/btx125", "10.1109/tvcg.2006.99", "10.1111/cgf.12928", "10.1038/nchembio.205", "10.1002/anie.201206708", "10.1002/prot.25177", "10.1198/jcgs.2009.08158", "10.1021/bi901900s", "10.1198/jcgs.2011.09224", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/bti1017", "10.1016/s0065-3233(08)60520-3", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.2312/molva.20181102", "10.1021/ct9000685", "10.1074/jbc.ra117.000328", "10.2312/vcbm.20171235", "10.1111/cgf.13428"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13701", "year": "2019", "title": "Analysis of Long Molecular Dynamics Simulations Using Interactive Focus+Context Visualization", "conferenceName": "EuroVis", "authors": "Jan Byska;Thomas Trautner;S{\\'{e}}rgio M. Marques;Jir{\\'{\\i}} Damborsk{\\'{y}};Barbora Kozl{\\'{\\i}}kov{\\'{a}};Manuela Waldner", "citationCount": "1", "affiliation": "Byska, J (Corresponding Author), Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J (Corresponding Author), Masaryk Univ, Fac Informat, Brno, Czech Republic.\nByska, J.; Trautner, T., Univ Bergen, Dept Informat, Bergen, Norway.\nByska, J.; Kozlikova, B., Masaryk Univ, Fac Informat, Brno, Czech Republic.\nTrautner, T.; Waldner, M., TU Wien, Fac Informat, Vienna, Austria.\nMarques, S. M.; Damborsky, J., Masaryk Univ, Loschmidt Labs, Brno, Czech Republic.\nMarques, S. M.; Damborsky, J., St Annes Univ Hosp, Int Clin Res Ctr, Brno, Czech Republic.", "countries": "Republic;Norway;Austria", "abstract": "Analyzing molecular dynamics (MD) simulations is a key aspect to understand protein dynamics and function. With increasing computational power, it is now possible to generate very long and complex simulations, which are cumbersome to explore using traditional 3D animations of protein movements. Guided by requirements derived from multiple focus groups with protein engineering experts, we designed and developed a novel interactive visual analysis approach for long and crowded MD simulations. In this approach, we link a dynamic 3D focus+context visualization with a 2D chart of time series data to guide the detection and navigation towards important spatio-temporal events. The 3D visualization renders elements of interest in more detail and increases the temporal resolution dependent on the time series data or the spatial region of interest. In case studies with different MD simulation data sets and research questions, we found that the proposed visual analysis approach facilitates exploratory analysis to generate, confirm, or reject hypotheses about causalities. Finally, we derived design guidelines for interactive visual analysis of complex MD simulation data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13701", "refList": ["10.1109/tvcg.2012.222", "10.1038/nchembio.1502", "10.1002/jcc.20084", "10.1186/1471-2105-14-s19-s5", "10.1021/acs.jcim.7b00070", "10.2312/egwr/egsr06/377-387", "10.1109/tvcg.2018.2864851", "10.1111/cgf.12612", "10.1109/tvcg.2015.2467434", "10.1111/j.1467-8659.2008.01314.x", "10.1109/tvcg.2010.250", "10.1007/3-540-30790-7\\_18", "10.1093/bioinformatics/btx125", "10.4230/dfu.sciviz", "10.1111/cgf.12892", "10.1111/cgf.12928", "10.1111/j.1467-9280.1997.tb00427.x", "10.1007/bf01897116", "10.1002/anie.201206708", "10.1111/j.1467-8659.2011.01930.x", "10.1109/iciapw.2007.10", "10.1038/171737a0", "10.1007/s11042-010-0606-z", "10.1093/bioinformatics/bty386", "10.1111/j.1467-8659.2008.01227.x", "10.1093/bioinformatics/btu426", "10.1109/biovis.2011.6094055", "10.1109/tvcg.2007.70589", "10.1186/s12859-016-1448-0", "10.1111/cgf.13072", "10.1111/j.1467-8659.2011.01917.x", "10.1021/jacs.7b12191", "10.1016/0263-7855(96)00018-5", "10.1109/tvcg.2012.213", "10.2312/vcbm.20171235", "10.1371/journal.pone.0057990", "10.1038/scientificamerican0666-42", "10.1093/bib/bbt021", "10.1111/cgf.13428", "10.1145/22339.22342"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934612", "title": "Multi-Scale Procedural Animations of Microtubule Dynamics Based on Measured Data", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Klein;Ivan Viola;M. Eduard Gröller;Peter Mindek", "citationCount": "0", "affiliation": "Klein, T (Corresponding Author), TU Wien, Vienna, Austria. Klein, Tobias; Groeller, Eduard; Mindek, Peter, TU Wien, Vienna, Austria. Viola, Ivan, KAUST, Thuwal, Saudi Arabia. Groeller, Eduard, VRVis, Vienna, Austria. Mindek, Peter, Nanographics GmbH, Vienna, Austria.", "countries": "Arabia;Austria", "abstract": "Biologists often use computer graphics to visualize structures, which due to physical limitations are not possible to image with a microscope. One example for such structures are microtubules, which are present in every eukaryotic cell. They are part of the cytoskeleton maintaining the shape of the cell and playing a key role in the cell division. In this paper, we propose a scientifically-accurate multi-scale procedural model of microtubule dynamics as a novel application scenario for procedural animation, which can generate visualizations of their overall shape, molecular structure, as well as animations of the dynamic behaviour of their growth and disassembly. The model is spanning from tens of micrometers down to atomic resolution. All the aspects of the model are driven by scientific data. The advantage over a traditional, manual animation approach is that when the underlying data change, for instance due to new evidence, the model can be recreated immediately. The procedural animation concept is presented in its generic form, with several novel extensions, facilitating an easy translation to other domains with emergent multi-scale behavior.", "keywords": "Procedural modeling,molecular visualization,animation,microtubules", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934612", "refList": ["10.1145/1141911.1141931", "10.1016/j.cell.2008.06.013", "10.1111/cgf.12068", "10.1111/cgf.12374", "10.1111/j.1467-8659.2009.01636.x", "10.1111/cgf.13426", "10.1093/nar/28.1.235", "10.1007/s00018-009-0245-6", "10.1016/j.jmb.2018.06.009", "10.1111/cgf.12370", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2014.2350479", "10.1109/tvcg.2017.2744258", "10.1145/3154353.3154364", "10.1111/j.1467-8659.2012.03128.x", "10.1126/science.1252884", "10.1109/tvcg.2006.115", "10.2312/vcbm.20151209", "10.1016/j.cag.2015.07.017", "10.1111/cgf.12312", "10.1145/1866158.1866183", "10.1109/mcg.2008.58", "10.2312/vcbm.20181244", "10.1002/9780470719442.ch13", "10.2312/vcbm.20161267", "10.1103/physreve.50.1579", "10.1111/cgf.12315", "10.1016/j.cag.2010.11.011", "10.1111/cgf.13072", "10.1111/cgf.13611", "10.1111/j.1467-8659.2011.01917.x", "10.1038/nrm3874", "10.1083/jcb.120.4.923", "10.1111/cgf.12197", "10.1016/0968-0004(91)90083-8", "10.1145/1141911.1142016", "10.1109/mcg.2018.2877076", "10.1111/cgf.13701", "10.1145/545261.545288", "10.1016/j.sbi.2015.03.015", "10.1016/j.str.2010.12.023", "10.1038/nmeth.3204", "10.1083/jcb.18.2.367"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}], "len": 19}, "index": 592, "embedding": [-0.8856717944145203, 1.4780644178390503, -1.0404996871948242, -0.2560294270515442, -0.6897369623184204, 0.16650904715061188, -0.42539986968040466, 1.223766565322876, -0.46884602308273315, -0.8865914940834045, 1.260303258895874, -0.9812887907028198, 0.033031586557626724, 2.776402711868286, 2.9253005981445312, 2.5665836334228516, -0.24749651551246643, 0.06877747178077698, -0.4073387682437897, 5.004546642303467, -0.06630208343267441, 3.4987425804138184, 2.266277313232422, 1.9734337329864502, -2.3829734325408936, 2.2764153480529785, -0.5834015607833862, 0.9997870922088623, 1.1947342157363892, -2.3510966300964355, 0.9739807844161987, 1.8294517993927002], "projection": [-0.13083918392658234, 9.476210594177246], "size": 10, "height": 4, "width": 4}