{"data": {"doi": "10.1109/tvcg.2016.2598866", "title": "Decal-Maps: Real-Time Layering of Decals on Surfaces for Multivariate Visualization", "year": "2016", "conferenceName": "SciVis", "authors": "Allan Rocha;Usman R. Alim;Julio Daniel Silva;Mario Costa Sousa", "citationCount": "8", "affiliation": "Rocha, A (Corresponding Author), Univ Calgary, Calgary, AB T2N 1N4, Canada. Rocha, Allan; Alim, Usman; Silva, Julio Daniel; Sousa, Mario Costa, Univ Calgary, Calgary, AB T2N 1N4, Canada.", "countries": "Canada", "abstract": "We introduce the use of decals for multivariate visualization design. Decals are visual representations that are used for communication; for example, a pattern, a text, a glyph, or a symbol, transferred from a 2D-image to a surface upon contact. By creating what we define as decal-maps, we can design a set of images or patterns that represent one or more data attributes. We place decals on the surface considering the data pertaining to the locations we choose. We propose a (texture mapping) local parametrization that allows placing decals on arbitrary surfaces interactively, even when dealing with a high number of decals. Moreover, we extend the concept of layering to allow the co-visualization of an increased number of attributes on arbitrary surfaces. By combining decal-maps, color-maps and a layered visualization, we aim to facilitate and encourage the creative process of designing multivariate visualizations. Finally, we demonstrate the general applicability of our technique by providing examples of its use in a variety of contexts.", "keywords": "Multivariate;Visualization;Real-time;Decal;Surface;Layering;Design", "link": "http://dx.doi.org/10.1109/TVCG.2016.2598866", "refList": ["10.1109/visual.1999.809905", "10.1109/tvcg.2012.34", "10.1007/978-3-540-33037-08", "10.1145/1053427.1053454", "10.1109/tvcg.2004.1260759", "10.1109/visual.1998.745294", "10.2312/conf/eg2012/stars/075-094", "10.1111/j.1467-8659.2004.00753.x", "10.1145/1866158.1866188", "10.1111/j.1467-8659.2012.03082.x", "10.1111/cgf.12369", "10.1109/tvcg.2011.25", "10.1109/tvcg.2010.181", "10.1111/cgf.12260", "10.1109/tvcg.2011.243", "10.1109/mcg.2002.999781", "10.2312/conf/eg2013/stars/039-063", "10.1109/mcg.2006.88", "10.1016/j.cag.2011.01.011", "10.1145/1141911.1141930", "10.1109/visual.2003.1250362", "10.1109/tvcg.2011.170", "10.1109/visual.1991.175811", "10.1111/j.1467-8659.2009.01429.x", "10.1111/j.1467-8659.2010.01650.x", "10.1109/tvcg.2015.2467153", "10.1109/tvcg.2012.110", "10.1007/978-3-540", "10.1111/j.1467-8659.2012.03127.x", "10.2307/2284077", "10.1016/j.cag.2010.04.003", "10.1109/38.909009", "10.1007/978-3-540-33037-0\\_8"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864509", "title": "Visual Analysis of Aneurysm Data using Statistical Graphics", "year": "2018", "conferenceName": "SciVis", "authors": "Monique Meuschke;Tobias Günther;Philipp Berg;Ralph Wickenhöfer;Bernhard Preim;Kai Lawonn", "citationCount": "1", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Magdeburg, Germany. Meuschke, M (Corresponding Author), Res Campus STIMULATE, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Univ Magdeburg, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Res Campus STIMULATE, Magdeburg, Germany. Gunther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland. Wickenhoefer, Ralph, Heart Jesus Hosp, Dernbach, Germany. Lawonn, Kai, Univ Koblenz Landau, Koblenz, Germany.", "countries": "Germany;Switzerland", "abstract": "This paper presents a framework to explore multi-field data of aneurysms occurring at intracranial and cardiac arteries by using statistical graphics. The rupture of an aneurysm is often a fatal scenario, whereas during treatment serious complications for the patient can occur. Whether an aneurysm ruptures or whether a treatment is successful depends on the interaction of different morphological such as wall deformation and thickness, and hemodynamic attributes like wall shear stress and pressure. Therefore, medical researchers are very interested in better understanding these relationships. However, the required analysis is a time-consuming process, where suspicious wall regions are difficult to detect due to the time-dependent behavior of the data. Our proposed visualization framework enables medical researchers to efficiently assess aneurysm risk and treatment options. This comprises a powerful set of views including 2D and 3D depictions of the aneurysm morphology as well as statistical plots of different scalar fields. Brushing and linking aids the user to identify interesting wall regions and to understand the influence of different attributes on the aneurysm's state. Moreover, a visual comparison of pre- and post-treatment as well as different treatment options is provided. Our analysis techniques are designed in collaboration with domain experts, e.g., physicians, and we provide details about the evaluation.", "keywords": "Medical visualizations,aneurysms,blood flow,parametrization", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864509", "refList": ["10.1109/tvcg.2013.139", "10.1136/neurintsurg-2014-011247", "10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1111/j.1467-8659.2008.01289.x", "10.3171/2009.2.focus0921", "10.1109/tvcg.2011.235", "10.1080/03610910903168603", "10.1111/cgf.12911", "10.1145/2516971.2516977", "10.1590/s2179-83972012000100014", "10.1109/mcg.2018.032421654", "10.1109/tvcg.2016.2598795", "10.1016/b978-0-12-811018-8.00014-x", "10.1145/1360612.1360643", "10.1111/cgf.12369", "10.1109/smi.2005.17", "10.1186/s12968-015-0174-5", "10.2312/conf/eg2013/stars/039-063", "10.1109/enc.2004.1342596", "10.1067/mje.2002.123374", "10.1016/j.jbiomech.2015.09.039", "10.2312/vissym/vissym04/147-154", "10.1115/1.4033082", "10.1016/j.cag.2011.01.011", "10.1002/jmri.20361", "10.1007/s007910050004", "10.1109/tvcg.2010.111", "10.1016/j.cag.2016.05.024", "10.1109/tvcg.2010.153", "10.1109/visual.2000.885739", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.1007/978-3-662-46224-9\\_45", "10.1109/iv.2005.3", "10.3171/2013.12.jns13945", "10.1007/s00115-011-3372-x", "10.2307/2032161", "10.1109/tvcg.2016.2598866", "10.1115/1.4026108", "10.1161/01.str.0000260955.51401.cd", "10.1111/cgf.13171", "10.1111/cgf.12355", "10.1098/rsif.2011.0490", "10.1109/34.868688", "10.1109/42.875181", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 5}, {"doi": "10.1109/tvcg.2019.2934334", "title": "Scale Trotter: Illustrative Visual Travels Across Negative Scales", "year": "2019", "conferenceName": "SciVis", "authors": "Sarkis Halladjian;Haichao Miao;David Kouril;M. Eduard Gröller;Ivan Viola;Tobias Isenberg", "citationCount": "1", "affiliation": "Halladjian, S (Corresponding Author), INRIA, Paris, France. Halladjian, S (Corresponding Author), Univ Paris Saclay, St Aubin, France. Halladjian, Sarkis; Isenberg, Tobias, INRIA, Paris, France. Halladjian, Sarkis, Univ Paris Saclay, St Aubin, France. Miao, Haichao; Kouril, David; Groller, M. Eduard, TU Wien, Vienna, Austria. Groller, M. Eduard, VRVis Res Ctr, Vienna, Austria. Viola, Ivan, King Abdullah Univ Sci \\& Technol, Thuwal, Saudi Arabia.", "countries": "Arabia;France;Austria", "abstract": "We present ScaleTrotter, a conceptual framework for an interactive, multi-scale visualization of biological mesoscale data and, specifically, genome data. ScaleTrotter allows viewers to smoothly transition from the nucleus of a cell to the atomistic composition of the DNA, while bridging several orders of magnitude in scale. The challenges in creating an interactive visualization of genome data are fundamentally different in several ways from those in other domains like astronomy that require a multi-scale representation as well. First, genome data has intertwined scale levels—the DNA is an extremely long, connected molecule that manifests itself at all scale levels. Second, elements of the DNA do not disappear as one zooms out—instead the scale levels at which they are observed group these elements differently. Third, we have detailed information and thus geometry for the entire dataset and for all scale levels, posing a challenge for interactive visual exploration. Finally, the conceptual scale levels for genome data are close in scale space, requiring us to find ways to visually embed a smaller scale into a coarser one. We address these challenges by creating a new multi-scale visualization concept. We use a scale-dependent camera model that controls the visual embedding of the scales into their respective parents, the rendering of a subset of the scale hierarchy, and the location, size, and scope of the view. In traversing the scales, ScaleTrotter is roaming between 2D and 3D visual representations that are depicted in integrated visuals. We discuss, specifically, how this form of multi-scale visualization follows from the specific characteristics of the genome data and describe its implementation. Finally, we discuss the implications of our work to the general illustrative depiction of multi-scale data.", "keywords": "Multi-scale visualization,scale transition,abstraction,human genome,DNA,Hi-C data", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934334", "refList": ["10.1126/science.291.5507.1177", "10.1038/nrneph.2010.55", "10.1016/j.jmb.2018.06.009", "10.1109/tvcg.2017.2744518", "10.1109/tvcg.2017.2743958", "10.1111/j.1467-8659.2012.03128.x", "10.1145/1507149.1507186", "10.1111/j.1467-8659.2012.03082.x", "10.1109/tvcg.2007.2", "10.1145/2024156.2024165", "10.1201/b17511", "10.1038/srep20802", "10.1145/1239451.1239482", "10.1109/mcg.2005.34", "10.1111/cgf.13429", "10.1186/1471-2105-11-444", "10.1109/tvcg.2015.2403323", "10.2312/vcbm.20151209", "10.1109/ldav.2016.7874310", "10.3791/1869", "10.1109/tvcg.2017.2747545", "10.1109/tvcg.2017.2743981", "10.1111/cgf.12892", "10.1126/science.aag0025", "10.1101/gr.213611.116", "10.2312/eurovisshort.20171146", "10.1109/mcg.2008.63", "10.1111/cgf.12349", "10.1017/s0890060411000230", "10.1109/tvcg.2007.70591", "10.1109/infvis.2004.12", "10.1111/cgf.13202", "10.2312/vissym/eurovis05/303-310", "10.1111/cgf.13072", "10.1016/j.jmb.2018.09.004", "10.1111/j.1467-8659.2011.01917.x", "10.1111/cgf.12197", "10.2312/eurovisstar.20151112", "10.1086/344286", "10.1093/nar/gks586", "10.2312/ega.20101005", "10.1186/s13059-018-1486-1", "10.1109/visual.2004.103", "10.1111/j.1467-8659.2009.01692.x", "10.1109/tvcg.2017.2744278", "10.1109/tvcg.2012.159", "10.1109/tvcg.2018.2864507", "10.1038/nrm1225", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030415", "title": "Modeling in the Time of COVID-19: Statistical and Rule-based Mesoscale Models", "year": "2020", "conferenceName": "SciVis", "authors": "Ngan Nguyen;Ondrej Strnad;Tobias Klein;Deng Luo;Ruwayda Alharbi;Peter Wonka;Martina Maritan;Peter Mindek;Ludovic Autin;David S. Goodsell;Ivan Viola", "citationCount": "0", "affiliation": "Nguyen, N (Corresponding Author), King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Nguyen, Ngan; Strnad, Ondrej; Luo, Deng; Alharbi, Ruwayda; Wonka, Peter; Viola, Ivan, King Abdullah Univ Sci \\& Technol KAUST, Thuwal, Saudi Arabia. Klein, Tobias; Mindek, Peter, TU Wien, Vienna, Austria. Klein, Tobias; Mindek, Peter, Nanographics GmbH, Vienna, Austria. Maritan, Martina; Autin, Ludovic; Goodsell, David S., Scripps Res Inst, La Jolla, CA 92037 USA.", "countries": "USA;Arabia;Austria", "abstract": "We present a new technique for the rapid modeling and construction of scientifically accurate mesoscale biological models. The resulting 3D models are based on a few 2D microscopy scans and the latest knowledge available about the biological entity, represented as a set of geometric relationships. Our new visual-programming technique is based on statistical and rule-based modeling approaches that are rapid to author, fast to construct, and easy to revise. From a few 2D microscopy scans, we determine the statistical properties of various structural aspects, such as the outer membrane shape, the spatial properties, and the distribution characteristics of the macromolecular elements on the membrane. This information is utilized in the construction of the 3D model. Once all the imaging evidence is incorporated into the model, additional information can be incorporated by interactively defining the rules that spatially characterize the rest of the biological entity, such as mutual interactions among macromolecules, and their distances and orientations relative to other structures. These rules are defined through an intuitive 3D interactive visualization as a visual-programming feedback loop. We demonstrate the applicability of our approach on a use case of the modeling procedure of the SARS-CoV-2 virion ultrastructure. This atomistic model, which we present here, can steer biological research to new promising directions in our efforts to fight the spread of the virus.", "keywords": "molecular visualization,mesoscale modeling", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030415", "refList": ["10.1145/2187836.2187957", "10.1109/tvcg.2009.157", "10.1099/0022-1317-39-3-545", "10.1007/978-3-319-73915-1\\_31", "10.1109/tvcg.2013.158", "10.1016/j.cag.2013.01.010", "10.1109/vast.2009.5333893", "10.1038/s41594-020-0468-7", "10.1145/174462.156635", "10.1038/nmeth.f.301", "10.1038/s41586-020-2008-3", "10.1016/j.jsb.2010.11.021", "10.7554/elife.57309", "10.1109/tvcg.2017.2744518", "10.1007/s00371-017-1397-2", "10.1109/tvcg.2017.2744258", "10.1111/cgf.13373", "10.1016/0022-5193(68)90079-9", "10.1111/j.1467-8659.2012.03128.x", "10.1145/2897824.2925951", "10.1007/978-3-319-28661-7\\_5", "10.1128/jvi.00645-06", "10.1016/bs.aivir.2016.08.005", "10.1007/978-3-319-50106-2\\_29", "10.1007/978-3-319-50106-2\\_30", "10.1107/s0907444910007493", "10.1093/gigascience/giz064", "10.1007/s11540-006-9010-5", "10.1111/cgf.13640", "10.1109/tvcg.2006.115", "10.1145/3130800.3130804", "10.1016/j.bbamem.2018.02.017", "10.1111/cgf.13816", "10.1021/acs.jctc.9b00453", "10.1016/j.jmgm.2016.07.008", "10.1126/science.abc6952", "10.1007/978-3-319-27261-0\\_16", "10.1007/978-3-319-73915-1\\_29", "10.1146/annurev.bb.06.060177.001055", "10.1002/(sici)1097-0282(199603)38:3", "10.1109/tvcg.2019.2934334", "10.1145/357306.357310", "10.1111/j.1467-8659.2009.01612.x", "10.3238/arztebl.2011.0087", "10.1093/bioinformatics/bty272", "10.1007/978-3-319-07121-35", "10.1107/s0021889883010985", "10.1101/2020.03.25.008904", "10.1126/science.abb9983", "10.1002/jcc.21861", "10.1111/cgf.12197", "10.1145/3197517.3201393", "10.1016/j.tibs.2020.02.010", "10.1007/s13238-016-0352-8", "10.1101/2020.06.26.173476", "10.1145/882262.882291", "10.1109/mcg.2018.2877076", "10.1093/nar/gkh468", "10.1038/nsb1203-980", "10.1007/978-3-319-07121-3\\_5", "10.1093/nar/gky427", "10.1111/cgf.12370", "10.1109/38.310720", "10.1038/nmeth.3204", "10.1109/tvcg.2016.2603178"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.13434", "year": "2018", "title": "Illustrative Multivariate Visualization for Geological Modelling", "conferenceName": "EuroVis", "authors": "Allan Rocha;Roberta C. Ramos Mota;Hamidreza Hamdi;Usman R. Alim;Mario Costa Sousa", "citationCount": "3", "affiliation": "Rocha, A (Corresponding Author), Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nRocha, A.; Mota, R. C. R.; Alim, U. R.; Sousa, M. Costa, Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nHamdi, H., Univ Calgary, Dept Geosci, Calgary, AB, Canada.", "countries": "Canada", "abstract": "In this paper, we present a novel illustrative multivariate visualization for geological modelling to assist geologists and reservoir engineers in visualizing multivariate datasets in superimposed representations, in contrast to the single-attribute visualizations supported by commercial software. Our approach extends the use of decals from a single surface to 3D irregular grids, using the layering concept to represent multiple attributes. We also build upon prior work to augment the design and implementation of different geological attributes (namely, rock type, porosity, and permeability). More specifically, we propose a new sampling strategy to generate decals for porosity on the geological grid, a hybrid visualization for permeability which combines 2D decals and 3D ellipsoid glyphs, and a perceptually-based design that allows us to visualize additional attributes (e.g., oil saturation) while avoiding visual interference between layers. Furthermore, our visual design draws from traditional geological illustrations, facilitating the understanding and communication between interdisciplinary teams. An evaluation by domain experts highlights the potential of our approach for geological modelling and interpretation in this complex domain.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13434", "refList": ["10.1145/1408626.1408633", "10.1145/2983310.2985762", "10.1177/1473871611416549", "10.1109/sibgrapi.2011.20", "10.1109/visual.1999.809905", "10.1109/tvcg.2012.34", "10.1145/2076354.2076390", "10.2312/egt.20061068", "10.1109/tvcg.2011.127", "10.1144/sp347.13", "10.1016/j.cag.2017.05.001", "10.1109/tvcg.2008.170", "10.2312/envirvis.20161099", "10.1109/tvcg.2017.2747545", "10.1111/cgf.13322", "10.1109/tvcg.2013.124", "10.2312/conf/eg2013/stars/039-063", "10.2312/vissym/vissym04/147-154", "10.1016/j.cag.2011.01.011", "10.1111/cgf.12127", "10.1145/1179849.1180035", "10.1016/j.gmod.2016.02.001", "10.1109/sibgrapi.2015.12", "10.1111/j.1467-8659.2009.01429.x", "10.3997/2214-4609.201411305", "10.1016/j.cag.2017.05.005", "10.1144/petgeo2012-074", "10.1109/tvcg.2012.110", "10.1007/s11390-015-1535-0", "10.1109/sibgrapi.2011.45", "10.1145/1281500.1281671", "10.1145/2448531.2448537", "10.20380/gi2014.19", "10.2312/envirvis.20171101", "10.1111/cgf.13171", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/pacificvis48177.2020.1008", "year": "2020", "title": "Tensor Spines - A Hyperstreamlines Variant Suitable for Indefinite Symmetric Second-Order Tensors", "conferenceName": "PacificVis", "authors": "Vanessa Kretzschmar;Fabian G{\\\"{u}}nther;Markus Stommel;Gerik Scheuermann", "citationCount": "0", "affiliation": "Kretzschmar, V (Corresponding Author), TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, V (Corresponding Author), Univ Leipzig, Leipzig, Germany.\nKretzschmar, Vanessa; Guenther, Fabian; Stommel, Markus, TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, Vanessa; Scheuermann, Gerik, Univ Leipzig, Leipzig, Germany.", "countries": "Germany", "abstract": "Modern engineering uses optimization to design long-living and robust components. One part of this process is to find the optimal stress-aware design under given geometric constraints and loading conditions. Tensor visualization provides techniques to show and evaluate the stress distribution based on finite element method simulations. One such technique are hyperstreamlines. They allow us to explore the stress along a line following one principal stress direction while showing the other principal stress directions and their values. In this paper, we show shortcomings of this approach from an engineer's point of view and propose a variant called tensor spines. It provides an improved perception of the relation between the principal stresses helping engineers to optimize their designs further.", "keywords": "Human-centered computing; Visualization; Visualization techniques", "link": "https://doi.org/10.1109/PacificVis48177.2020.1008", "refList": ["10.1109/38.219447", "10.1002/nag.223", "10.1109/tvcg.2016.2598998", "10.1109/pacificvis.2014.51", "10.1111/cgf.13693", "10.1109/tvcg.2015.2484343", "10.1111/cgf.13434", "10.1007/s00371-017-1450-1", "10.1007/b106657\\_8", "10.1109/scivis.2015.7429491", "10.1111/j.1467-8659.2012.03231.x", "10.2312/vissym/vissym04/147-154", "10.1109/visual.2004.105", "10.1111/cgf.13423", "10.1109/visual.2003.1250379", "10.1111/cgf.13171", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.7567", "year": "2020", "title": "PINGU Principles of Interactive Navigation for Geospatial Understanding", "conferenceName": "PacificVis", "authors": "Zolt{\\'{a}}n Or{\\'{e}}mus;Kahin Akram Hassan;Jir{\\'{\\i}} Chmel{\\'{\\i}}k;Michaela Knazkov{\\'{a}};Jan Byska;Renata Georgia Raidou;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nOremus, Zoltan; Chmelik, Jiri; Knazkova, Michaela; Byska, Jan; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nHassan, Kahin Akram, Linkoping Univ, Linkoping, Sweden.\nRaidou, Renata Georgia, TU Wien, Vienna, Austria.", "countries": "Sweden;Republic;Austria", "abstract": "Monitoring conditions in the periglacial areas of Antarctica helps geographers and geologists to understand physical processes associated with mesoscale land systems. Analyzing these unique temporal datasets poses a significant challenge for domain experts, due to the complex and often incomplete data, for which corresponding exploratory tools are not available. In this paper, we present a novel visual analysis tool for extraction and interactive exploration of temporal measurements captured at the polar station at the James Ross Island in Antarctica. The tool allows domain experts to quickly extract information about the snow level, originating from a series of photos acquired by trail cameras. Using linked views, the domain experts can interactively explore and combine this information with other spatial and non-spatial measures, such as temperature or wind speed, to reveal the interplay of periglacial and aeolian processes. An abstracted interactive map of the area indicates the position of measurement spots to facilitate navigation. The design of the tool was made in tight collaboration with geographers, which resulted in an early prototype, tested in the pilot study. The following version of the tool and its usability has been evaluated in the user study with five domain experts and their feedback was incorporated into the final version, presented in this paper. This version was again discussed with two experts in an informal interview. Within these evaluations, they confirmed the significant benefit of the tool for their research tasks.", "keywords": "Human-centered computing; Visualization; Visualization techniques; Treemaps; Human-centered computing; Visualization; Visualization design and evaluation methods", "link": "https://doi.org/10.1109/PacificVis48177.2020.7567", "refList": ["10.1109/vast.2012.6400553", "10.2307/1269768", "10.1109/iv.2005.135", "10.1145/1456650.1456652", "10.1016/j.cag.2013.01.010", "10.1109/vast.2014.7042489", "10.1002/2017gl074039", "10.1109/tvcg.2013.126", "10.1111/j.1467-8306.2005.00449.x", "10.1177/1473871612457601", "10.1002/fee.1222", "10.1029/2009jf001306", "10.1088/1742-6596/500/18/182006", "10.1109/visual.1991.175794", "10.1109/tvcg.2008.170", "10.1109/vl.1996.545307", "10.1109/cmv.2004.1319531", "10.1007/bf01898350", "10.5194/tc-7-1399-2013", "10.1007/s00267-008-9086-6", "10.1109/tvcg.2011.181", "10.1007/s10109-004-0127-2", "10.1109/iv.2005.3", "10.1007/978-3-540-33037-0\\_10", "10.1109/tvcg.2017.2779501", "10.1111/j.1467-8659.2012.03184.x", "10.1038/sj.bdj.2008.292", "10.1016/j.jvlc.2011.04.001", "10.1111/cgf.12390", "10.1111/cgf.12650", "10.1111/j.1467-8659.2011.01947.x", "10.1111/cgf.13434", "10.1364/oe.15.000033", "10.1111/cgf.13279", "10.1109/tvcg.2008.139", "10.1007/978-3-540-33037-010", "10.1016/j.cag.2007.01.030", "10.1029/2001jd000927", "10.1016/s0167-9473(02)00295-5"], "wos": 1, "children": [], "len": 1}], "len": 5}, {"doi": "10.1111/cgf.13983", "year": "2020", "title": "Fiber Surfaces for many Variables", "conferenceName": "EuroVis", "authors": "Christian Blecha;Felix Raith;A. J. Pr{\\\"{a}}ger;Thomas Nagel;Olaf Kolditz;Jobst Ma{\\ss}mann;Niklas R{\\\"{o}}ber;Michael B{\\\"{o}}ttinger;Gerik Scheuermann", "citationCount": "0", "affiliation": "Blecha, C (Corresponding Author), Univ Leipzig, Inst Comp Sci, Leipzig, Germany.\nBlecha, C.; Raith, F.; Praeger, A. J.; Scheuermann, G., Univ Leipzig, Inst Comp Sci, Leipzig, Germany.\nNagel, T., Tech Univ Bergakad Freiberg, Geotech Inst, Chair Soil Mech \\& Fdn Engn, Freiberg, Germany.\nKolditz, O., Helmholtz Ctr Environm Res, Dept Environm Informat, Leipzig, Germany.\nMassmann, J., Fed Inst Geosci \\& Nat Resources BGR, Hannover, NH, Germany.\nRoeber, N.; Boettinger, M., Deutsch Klimarechenzentrum, Hamburg, Germany.", "countries": "Germany", "abstract": "Scientific visualization deals with increasingly complex data consisting of multiple fields. Typical disciplines generating multivariate data are fluid dynamics, structural mechanics, geology, bioengineering, and climate research. Quite often, scientists are interested in the relation between some of these variables. A popular visualization technique for a single scalar field is the extraction and rendering of isosurfaces. With this technique, the domain can be split into two parts, i.e. a volume with higher values and one with lower values than the selected isovalue. Fiber surfaces generalize this concept to two or three scalar variables up to now. This article extends the notion further to potentially any finite number of scalar fields. We generalize the fiber surface extraction algorithm of Raith et al. {[}RBN{*} 19] from 3 to d dimensions and demonstrate the technique using two examples from geology and climate research. The first application concerns a generic model of a nuclear waste repository and the second one an atmospheric simulation over central Europe. Both require complex simulations which involve multiple physical processes. In both cases, the new extended fiber surfaces helps us finding regions of interest like the nuclear waste repository or the power supply of a storm due to their characteristic properties.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13983", "refList": ["10.1109/tvcg.2007.70615", "10.1007/s12665-012-1546-x", "10.1007/s11242-019-01310-1", "10.2312/conf/eg2013/stars/095-116", "10.1109/tvcg.2016.2599040", "10.1111/j.1467-8659.2011.01959.x", "10.1002/qj.2947", "10.1109/tvcg.2015.2467433", "10.1109/tvcg.2018.2864846", "10.1111/cgf.12636", "10.1109/cmv.2007.20", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2016.2570215", "10.1109/tvcg.2018.2867488", "10.1109/pacificvis.2017.8031588", "10.1111/cgf.12646", "10.1109/tvcg.2016.2599017", "10.1109/pacificvis.2019.00030", "10.1109/tvcg.2006.165", "10.1111/j.1467-8659.2009.01429.x", "10.1109/tvcg.2010.64", "10.1145/1377676.1377720", "10.1016/j.jrmge.2017.05.007", "10.18240/ijo.2016.07.04", "10.1186/s40645-019-0304-z", "10.1016/j.parco.2015.10.016", "10.1109/tvcg.2015.2466992", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13171", "year": "2017", "title": "Glyph-Based Comparative Stress Tensor Visualization in Cerebral Aneurysms", "conferenceName": "EuroVis", "authors": "Monique Meuschke;Samuel Vo{\\ss};Oliver Beuing;Bernhard Preim;Kai Lawonn", "citationCount": "7", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nMeuschke, M.; Preim, B., Univ Magdeburg, Dept Simulat \\& Graph, Magdeburg, Germany.\nVoss, S., Univ Magdeburg, Dept Fluid Dynam \\& Tech Flows, Magdeburg, Germany.\nBeuing, O., Univ Hosp, Dept Neuroradiol, Magdeburg, Germany.\nLawonn, K., Univ Koblenz Landau, Inst Computat Visualist, Mainz, Germany.", "countries": "Germany", "abstract": "We present the first visualization tool that enables a comparative depiction of structural stress tensor data for vessel walls of cerebral aneurysms. Such aneurysms bear the risk of rupture, whereas their treatment also carries considerable risks for the patient. Medical researchers emphasize the importance of analyzing the interaction of morphological and hemodynamic information for the patient-specific rupture risk evaluation and treatment analysis. Tensor data such as the stress inside the aneurysm walls characterizes the interplay between the morphology and blood flow and seems to be an important rupture-prone criterion. We use different glyph-based techniques to depict local stress tensors simultaneously and compare their applicability to cerebral aneurysms in a user study. We thus offer medical researchers an effective visual exploration tool to assess the aneurysm rupture risk. We developed a GPU-based implementation of our techniques with a flexible interactive data exploration mechanism. Our depictions are designed in collaboration with domain experts, and we provide details about the evaluation.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13171", "refList": ["10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1148/rg.233025036", "10.1177/1473871611416549", "10.3171/2009.2.focus0921", "10.1109/tvcg.2011.235", "10.1109/tvcg.2015.2467961", "10.1002/mrm.1910360612", "10.1109/visual.2002.1183797", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2011.243", "10.1161/strokeaha.113.004421", "10.2312/conf/eg2013/stars/039-063", "10.1007/978-3-319-24571-3\\_48", "10.2312/vissym/vissym04/147-154", "10.1016/j.cag.2011.01.011", "10.1007/s10439-012-0632-2", "10.1007/s007910050004", "10.3174/ajnr.a4157", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.3174/ajnr.a3558", "10.1111/j.1467-8659.2009.01711.x", "10.1155/2016/9307560", "10.1109/tvcg.2010.199", "10.1111/cgf.12119", "10.1111/cgf.12355", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864509", "title": "Visual Analysis of Aneurysm Data using Statistical Graphics", "year": "2018", "conferenceName": "SciVis", "authors": "Monique Meuschke;Tobias Günther;Philipp Berg;Ralph Wickenhöfer;Bernhard Preim;Kai Lawonn", "citationCount": "1", "affiliation": "Meuschke, M (Corresponding Author), Univ Magdeburg, Magdeburg, Germany. Meuschke, M (Corresponding Author), Res Campus STIMULATE, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Univ Magdeburg, Magdeburg, Germany. Meuschke, Monique; Berg, Philipp; Preim, Bernhard, Res Campus STIMULATE, Magdeburg, Germany. Gunther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland. Wickenhoefer, Ralph, Heart Jesus Hosp, Dernbach, Germany. Lawonn, Kai, Univ Koblenz Landau, Koblenz, Germany.", "countries": "Germany;Switzerland", "abstract": "This paper presents a framework to explore multi-field data of aneurysms occurring at intracranial and cardiac arteries by using statistical graphics. The rupture of an aneurysm is often a fatal scenario, whereas during treatment serious complications for the patient can occur. Whether an aneurysm ruptures or whether a treatment is successful depends on the interaction of different morphological such as wall deformation and thickness, and hemodynamic attributes like wall shear stress and pressure. Therefore, medical researchers are very interested in better understanding these relationships. However, the required analysis is a time-consuming process, where suspicious wall regions are difficult to detect due to the time-dependent behavior of the data. Our proposed visualization framework enables medical researchers to efficiently assess aneurysm risk and treatment options. This comprises a powerful set of views including 2D and 3D depictions of the aneurysm morphology as well as statistical plots of different scalar fields. Brushing and linking aids the user to identify interesting wall regions and to understand the influence of different attributes on the aneurysm's state. Moreover, a visual comparison of pre- and post-treatment as well as different treatment options is provided. Our analysis techniques are designed in collaboration with domain experts, e.g., physicians, and we provide details about the evaluation.", "keywords": "Medical visualizations,aneurysms,blood flow,parametrization", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864509", "refList": ["10.1109/tvcg.2013.139", "10.1136/neurintsurg-2014-011247", "10.1109/tvcg.2014.2346406", "10.1002/fld.1786", "10.1111/j.1467-8659.2008.01289.x", "10.3171/2009.2.focus0921", "10.1109/tvcg.2011.235", "10.1080/03610910903168603", "10.1111/cgf.12911", "10.1145/2516971.2516977", "10.1590/s2179-83972012000100014", "10.1109/mcg.2018.032421654", "10.1109/tvcg.2016.2598795", "10.1016/b978-0-12-811018-8.00014-x", "10.1145/1360612.1360643", "10.1111/cgf.12369", "10.1109/smi.2005.17", "10.1186/s12968-015-0174-5", "10.2312/conf/eg2013/stars/039-063", "10.1109/enc.2004.1342596", "10.1067/mje.2002.123374", "10.1016/j.jbiomech.2015.09.039", "10.2312/vissym/vissym04/147-154", "10.1115/1.4033082", "10.1016/j.cag.2011.01.011", "10.1002/jmri.20361", "10.1007/s007910050004", "10.1109/tvcg.2010.111", "10.1016/j.cag.2016.05.024", "10.1109/tvcg.2010.153", "10.1109/visual.2000.885739", "10.3174/ajnr.a2274", "10.1115/1.4031794", "10.1007/978-3-662-46224-9\\_45", "10.1109/iv.2005.3", "10.3171/2013.12.jns13945", "10.1007/s00115-011-3372-x", "10.2307/2032161", "10.1109/tvcg.2016.2598866", "10.1115/1.4026108", "10.1161/01.str.0000260955.51401.cd", "10.1111/cgf.13171", "10.1111/cgf.12355", "10.1098/rsif.2011.0490", "10.1109/34.868688", "10.1109/42.875181", "10.1111/j.1467-8659.2009.01459.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934337", "title": "Temporal Views of Flattened Mitral Valve Geometries", "year": "2019", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sandy Engelhardt;Nils Lichtenberg;Raffaele De Simone;Kai Lawonn", "citationCount": "1", "affiliation": "Eulzer, P (Corresponding Author), Univ Koblenz Landau, Mainz, Germany. Eulzer, Pepe; Lichtenberg, Nils; Lawonn, Kai, Univ Koblenz Landau, Mainz, Germany. Engelhardt, Sandy, Mannheim Univ Appl Sci, Mannheim, Germany. de Simone, Raffaele, Heidelberg Univ Hosp, Heidelberg, Germany.", "countries": "Germany", "abstract": "The mitral valve, one of the four valves in the human heart, controls the bloodflow between the left atrium and ventricle and may suffer from various pathologies. Malfunctioning valves can be treated by reconstructive surgeries, which have to be carefully planned and evaluated. While current research focuses on the modeling and segmentation of the valve, we base our work on existing segmentations of patient-specific mitral valves, that are also time-resolved ($3\\mathrm{D}+\\mathrm{t}$) over the cardiac cycle. The interpretation of the data can be ambiguous, due to the complex surface of the valve and multiple time steps. We therefore propose a software prototype to analyze such $3\\mathrm{D}+\\mathrm{t}$ data, by extracting pathophysiological parameters and presenting them via dimensionally reduced visualizations. For this, we rely on an existing algorithm to unroll the convoluted valve surface towards a flattened 2D representation. In this paper, we show that the $3\\mathrm{D}+\\mathrm{t}$ data can be transferred to 3D or 2D representations in a way that allows the domain expert to faithfully grasp important aspects of the cardiac cycle. In this course, we not only consider common pathophysiological parameters, but also introduce new observations that are derived from landmarks within the segmentation model. Our analysis techniques were developed in collaboration with domain experts and a survey showed that the insights have the potential to support mitral valve diagnosis and the comparison of the pre- and post-operative condition of a patient.", "keywords": "Mitral valve,quantification,medical visualization,parameterization,spatio-temporal visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934337", "refList": ["10.1007/s00392-006-0458-8", "10.1109/tvcg.2013.139", "10.1007/978-3-642-23626-6\\_64", "10.1109/tvcg.2010.200", "10.1109/tvcg.2017.2674938", "10.1111/cgf.13445", "10.1016/j.neuroimage.2003.07.008", "10.1109/tvcg.2018.2864509", "10.1109/tvcg.2011.235", "10.1111/cgf.12911", "10.1111/cgf.13427", "10.1016/j.echo.2012.03.010", "10.1109/tvcg.2016.2598795", "10.1111/cgf.12369", "10.1109/tvcg.2014.2346459", "10.1002/clc.20131", "10.1007/978-3-319-20309-6\\_16", "10.1109/tvcg.2006.112", "10.1016/j.cag.2016.05.024", "10.1007/978-3-662-46224-9\\_45", "10.1109/visual.2001.964540", "10.1016/j.jacc.2008.04.038", "10.1109/iv.2005.3", "10.1186/1475-925x-13-31", "10.1016/j.jtcvs.2007.12.087", "10.1006/nimg.1998.0396", "10.1016/j.media.2016.09.006", "10.1117/12.772699", "10.1016/s0003-4975(97)00850-3", "10.1016/j.athoracsur.2009.12.061", "10.1371/journal.pone.0130906", "10.1007/978-3-642-21028-0\\_29", "10.1007/978-3-642-13711-2\\_13", "10.1016/j.athoracsur.2018.03.086", "10.1016/j.jbiomech.2011.11.033"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 5}, {"doi": "10.1109/tvcg.2020.3030437", "title": "In Search of Patient Zero: Visual Analytics of Pathogen Transmission Pathways in Hospitals", "year": "2020", "conferenceName": "VAST", "authors": "Tom Baumgartl;Markus Petzold;Marcel Wunderlich;Markus Höhn;D. Archambault;M. Lieser;A. Dalpke;Simone Scheithauer;Michael Marschollek;Vanessa Eichel;Nico T. Mutters;Highmed Consortium;Tatiana von Landesberger", "citationCount": "0", "affiliation": "Baumgartl, T (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Tech Univ Darmstadt, Darmstadt, Germany. Baumgartl, T.; Wunderlich, M.; Hoehn, M.; Landesberger, T. von, Univ Rostock, Rostock, Germany. Archambault, D., Swansea Univ, Swansea, W Glam, Wales. Petzold, M.; Lieser, M.; Eichel, V. M.; Mutters, N. T., Univ Hosp Heidelberg, Heidelbeig, Germany. Dalpke, A., Tech Univ Dresden, Dresden, Germany. Scheithauer, S., Univ Gottingen, Univ Med Gottingen, Gottingen, Germany. Marschollek, M., L Reichertz Inst Med Informat, Hannover, Germany.", "countries": "Wales;Germany", "abstract": "Pathogen outbreaks (i.e., outbreaks of bacteria and viruses) in hospitals can cause high mortality rates and increase costs for hospitals significantly. An outbreak is generally noticed when the number of infected patients rises above an endemic level or the usual prevalence of a pathogen in a defined population. Reconstructing transmission pathways back to the source of an outbreak - the patient zero or index patient - requires the analysis of microbiological data and patient contacts. This is often manually completed by infection control experts. We present a novel visual analytics approach to support the analysis of transmission pathways, patient contacts, the progression of the outbreak, and patient timelines during hospitalization. Infection control experts applied our solution to a real outbreak of Klebsiella pneumoniae in a large German hospital. Using our system, our experts were able to scale the analysis of transmission pathways to longer time intervals (i.e., several years of data instead of days) and across a larger number of wards. Also, the system is able to reduce the analysis time from days to hours. In our final study, feedback from twenty-five experts from seven German hospitals provides evidence that our solution brings significant benefits for analyzing outbreaks.", "keywords": "dynamic networks,visualization applications,health,medicine,outbreak,Klebsiella,infection control", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030437", "refList": ["10.1109/tvcg.2011.189", "10.1109/tvcg.2015.2467435", "10.1109/tvcg.2014.2346591", "10.1007/s00586-005-1037-9", "10.1111/j.1467-8659.2009.01681.x", "10.1111/cgf.13306", "10.1109/tvcg.2015.2467961", "10.1109/icdmw.2009.55", "10.1109/tvcg.2009.184", "10.1097/brs.0b013e31820cccfb", "10.1007/s00586-005-1029-9", "10.1109/tvcg.2016.2598795", "10.5772/intechopen", "10.5772/intechopen.68835", "10.1109/ems.2013.28", "10.1111/cgf.13322", "10.2312/conf/eg2013/stars/039-063", "10.1515/bmt-2014-5012", "10.1109/tvcg.2008.155", "10.1016/j.cag.2011.01.011", "10.1111/cgf.13763", "10.2106/00004623-200407000-00020", "10.2307/1422551", "10.1016/j.cad.2005.02.002", "10.1111/cgf.13413", "10.1097/00007632-199906150-00004", "10.1007/s00586-006-0254-1", "10.1007/s005860000239", "10.5772/62864", "10.1007/978-3-662-56537-7", "10.1016/j.cag.2017.05.005", "10.1109/tbme.2007.901024", "10.1109/tvcg.2019.2934337", "10.1016/s0140-6736(99)01312-4", "10.1515/cdbme-2015-0092", "10.3390/healthcare3030838", "10.1097/01.brs.0000152379.54463.65", "10.1109/tvcg.2015.2467198", "10.1097/brs.0b013e3182843ac8", "10.1016/j.spinee.2017.03.009", "10.1109/tvcg.2014.2346448", "10.1097/brs.0b013e3182647af2", "10.1111/cgf.12355", "10.1109/tvcg.2018.2855742", "10.1109/tvcg.2018.2864510", "10.1007/978-3-662-56537-780", "10.1007/bf02221446", "10.1111/cgf.13171", "10.1007/s11548-010-0476-x"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.1008", "year": "2020", "title": "Tensor Spines - A Hyperstreamlines Variant Suitable for Indefinite Symmetric Second-Order Tensors", "conferenceName": "PacificVis", "authors": "Vanessa Kretzschmar;Fabian G{\\\"{u}}nther;Markus Stommel;Gerik Scheuermann", "citationCount": "0", "affiliation": "Kretzschmar, V (Corresponding Author), TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, V (Corresponding Author), Univ Leipzig, Leipzig, Germany.\nKretzschmar, Vanessa; Guenther, Fabian; Stommel, Markus, TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, Vanessa; Scheuermann, Gerik, Univ Leipzig, Leipzig, Germany.", "countries": "Germany", "abstract": "Modern engineering uses optimization to design long-living and robust components. One part of this process is to find the optimal stress-aware design under given geometric constraints and loading conditions. Tensor visualization provides techniques to show and evaluate the stress distribution based on finite element method simulations. One such technique are hyperstreamlines. They allow us to explore the stress along a line following one principal stress direction while showing the other principal stress directions and their values. In this paper, we show shortcomings of this approach from an engineer's point of view and propose a variant called tensor spines. It provides an improved perception of the relation between the principal stresses helping engineers to optimize their designs further.", "keywords": "Human-centered computing; Visualization; Visualization techniques", "link": "https://doi.org/10.1109/PacificVis48177.2020.1008", "refList": ["10.1109/38.219447", "10.1002/nag.223", "10.1109/tvcg.2016.2598998", "10.1109/pacificvis.2014.51", "10.1111/cgf.13693", "10.1109/tvcg.2015.2484343", "10.1111/cgf.13434", "10.1007/s00371-017-1450-1", "10.1007/b106657\\_8", "10.1109/scivis.2015.7429491", "10.1111/j.1467-8659.2012.03231.x", "10.2312/vissym/vissym04/147-154", "10.1109/visual.2004.105", "10.1111/cgf.13423", "10.1109/visual.2003.1250379", "10.1111/cgf.13171", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13434", "year": "2018", "title": "Illustrative Multivariate Visualization for Geological Modelling", "conferenceName": "EuroVis", "authors": "Allan Rocha;Roberta C. Ramos Mota;Hamidreza Hamdi;Usman R. Alim;Mario Costa Sousa", "citationCount": "3", "affiliation": "Rocha, A (Corresponding Author), Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nRocha, A.; Mota, R. C. R.; Alim, U. R.; Sousa, M. Costa, Univ Calgary, Dept Comp Sci, Calgary, AB, Canada.\nHamdi, H., Univ Calgary, Dept Geosci, Calgary, AB, Canada.", "countries": "Canada", "abstract": "In this paper, we present a novel illustrative multivariate visualization for geological modelling to assist geologists and reservoir engineers in visualizing multivariate datasets in superimposed representations, in contrast to the single-attribute visualizations supported by commercial software. Our approach extends the use of decals from a single surface to 3D irregular grids, using the layering concept to represent multiple attributes. We also build upon prior work to augment the design and implementation of different geological attributes (namely, rock type, porosity, and permeability). More specifically, we propose a new sampling strategy to generate decals for porosity on the geological grid, a hybrid visualization for permeability which combines 2D decals and 3D ellipsoid glyphs, and a perceptually-based design that allows us to visualize additional attributes (e.g., oil saturation) while avoiding visual interference between layers. Furthermore, our visual design draws from traditional geological illustrations, facilitating the understanding and communication between interdisciplinary teams. An evaluation by domain experts highlights the potential of our approach for geological modelling and interpretation in this complex domain.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13434", "refList": ["10.1145/1408626.1408633", "10.1145/2983310.2985762", "10.1177/1473871611416549", "10.1109/sibgrapi.2011.20", "10.1109/visual.1999.809905", "10.1109/tvcg.2012.34", "10.1145/2076354.2076390", "10.2312/egt.20061068", "10.1109/tvcg.2011.127", "10.1144/sp347.13", "10.1016/j.cag.2017.05.001", "10.1109/tvcg.2008.170", "10.2312/envirvis.20161099", "10.1109/tvcg.2017.2747545", "10.1111/cgf.13322", "10.1109/tvcg.2013.124", "10.2312/conf/eg2013/stars/039-063", "10.2312/vissym/vissym04/147-154", "10.1016/j.cag.2011.01.011", "10.1111/cgf.12127", "10.1145/1179849.1180035", "10.1016/j.gmod.2016.02.001", "10.1109/sibgrapi.2015.12", "10.1111/j.1467-8659.2009.01429.x", "10.3997/2214-4609.201411305", "10.1016/j.cag.2017.05.005", "10.1144/petgeo2012-074", "10.1109/tvcg.2012.110", "10.1007/s11390-015-1535-0", "10.1109/sibgrapi.2011.45", "10.1145/1281500.1281671", "10.1145/2448531.2448537", "10.20380/gi2014.19", "10.2312/envirvis.20171101", "10.1111/cgf.13171", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [{"doi": "10.1109/pacificvis48177.2020.1008", "year": "2020", "title": "Tensor Spines - A Hyperstreamlines Variant Suitable for Indefinite Symmetric Second-Order Tensors", "conferenceName": "PacificVis", "authors": "Vanessa Kretzschmar;Fabian G{\\\"{u}}nther;Markus Stommel;Gerik Scheuermann", "citationCount": "0", "affiliation": "Kretzschmar, V (Corresponding Author), TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, V (Corresponding Author), Univ Leipzig, Leipzig, Germany.\nKretzschmar, Vanessa; Guenther, Fabian; Stommel, Markus, TU Dortmund Univ, Dortmund, Germany.\nKretzschmar, Vanessa; Scheuermann, Gerik, Univ Leipzig, Leipzig, Germany.", "countries": "Germany", "abstract": "Modern engineering uses optimization to design long-living and robust components. One part of this process is to find the optimal stress-aware design under given geometric constraints and loading conditions. Tensor visualization provides techniques to show and evaluate the stress distribution based on finite element method simulations. One such technique are hyperstreamlines. They allow us to explore the stress along a line following one principal stress direction while showing the other principal stress directions and their values. In this paper, we show shortcomings of this approach from an engineer's point of view and propose a variant called tensor spines. It provides an improved perception of the relation between the principal stresses helping engineers to optimize their designs further.", "keywords": "Human-centered computing; Visualization; Visualization techniques", "link": "https://doi.org/10.1109/PacificVis48177.2020.1008", "refList": ["10.1109/38.219447", "10.1002/nag.223", "10.1109/tvcg.2016.2598998", "10.1109/pacificvis.2014.51", "10.1111/cgf.13693", "10.1109/tvcg.2015.2484343", "10.1111/cgf.13434", "10.1007/s00371-017-1450-1", "10.1007/b106657\\_8", "10.1109/scivis.2015.7429491", "10.1111/j.1467-8659.2012.03231.x", "10.2312/vissym/vissym04/147-154", "10.1109/visual.2004.105", "10.1111/cgf.13423", "10.1109/visual.2003.1250379", "10.1111/cgf.13171", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.7567", "year": "2020", "title": "PINGU Principles of Interactive Navigation for Geospatial Understanding", "conferenceName": "PacificVis", "authors": "Zolt{\\'{a}}n Or{\\'{e}}mus;Kahin Akram Hassan;Jir{\\'{\\i}} Chmel{\\'{\\i}}k;Michaela Knazkov{\\'{a}};Jan Byska;Renata Georgia Raidou;Barbora Kozl{\\'{\\i}}kov{\\'{a}}", "citationCount": "0", "affiliation": "Kozlikova, B (Corresponding Author), Masaryk Univ, Brno, Czech Republic.\nOremus, Zoltan; Chmelik, Jiri; Knazkova, Michaela; Byska, Jan; Kozlikova, Barbora, Masaryk Univ, Brno, Czech Republic.\nHassan, Kahin Akram, Linkoping Univ, Linkoping, Sweden.\nRaidou, Renata Georgia, TU Wien, Vienna, Austria.", "countries": "Sweden;Republic;Austria", "abstract": "Monitoring conditions in the periglacial areas of Antarctica helps geographers and geologists to understand physical processes associated with mesoscale land systems. Analyzing these unique temporal datasets poses a significant challenge for domain experts, due to the complex and often incomplete data, for which corresponding exploratory tools are not available. In this paper, we present a novel visual analysis tool for extraction and interactive exploration of temporal measurements captured at the polar station at the James Ross Island in Antarctica. The tool allows domain experts to quickly extract information about the snow level, originating from a series of photos acquired by trail cameras. Using linked views, the domain experts can interactively explore and combine this information with other spatial and non-spatial measures, such as temperature or wind speed, to reveal the interplay of periglacial and aeolian processes. An abstracted interactive map of the area indicates the position of measurement spots to facilitate navigation. The design of the tool was made in tight collaboration with geographers, which resulted in an early prototype, tested in the pilot study. The following version of the tool and its usability has been evaluated in the user study with five domain experts and their feedback was incorporated into the final version, presented in this paper. This version was again discussed with two experts in an informal interview. Within these evaluations, they confirmed the significant benefit of the tool for their research tasks.", "keywords": "Human-centered computing; Visualization; Visualization techniques; Treemaps; Human-centered computing; Visualization; Visualization design and evaluation methods", "link": "https://doi.org/10.1109/PacificVis48177.2020.7567", "refList": ["10.1109/vast.2012.6400553", "10.2307/1269768", "10.1109/iv.2005.135", "10.1145/1456650.1456652", "10.1016/j.cag.2013.01.010", "10.1109/vast.2014.7042489", "10.1002/2017gl074039", "10.1109/tvcg.2013.126", "10.1111/j.1467-8306.2005.00449.x", "10.1177/1473871612457601", "10.1002/fee.1222", "10.1029/2009jf001306", "10.1088/1742-6596/500/18/182006", "10.1109/visual.1991.175794", "10.1109/tvcg.2008.170", "10.1109/vl.1996.545307", "10.1109/cmv.2004.1319531", "10.1007/bf01898350", "10.5194/tc-7-1399-2013", "10.1007/s00267-008-9086-6", "10.1109/tvcg.2011.181", "10.1007/s10109-004-0127-2", "10.1109/iv.2005.3", "10.1007/978-3-540-33037-0\\_10", "10.1109/tvcg.2017.2779501", "10.1111/j.1467-8659.2012.03184.x", "10.1038/sj.bdj.2008.292", "10.1016/j.jvlc.2011.04.001", "10.1111/cgf.12390", "10.1111/cgf.12650", "10.1111/j.1467-8659.2011.01947.x", "10.1111/cgf.13434", "10.1364/oe.15.000033", "10.1111/cgf.13279", "10.1109/tvcg.2008.139", "10.1007/978-3-540-33037-010", "10.1016/j.cag.2007.01.030", "10.1029/2001jd000927", "10.1016/s0167-9473(02)00295-5"], "wos": 1, "children": [], "len": 1}], "len": 5}], "len": 17}], "len": 37}, "index": 602, "embedding": [-0.4786299765110016, 1.8989098072052002, -1.030107021331787, -2.273205041885376, -0.6539726853370667, 0.16650904715061188, 1.324788212776184, 2.730271339416504, -0.4441397190093994, 1.9671363830566406, 0.1595647633075714, 0.06058485433459282, -0.14601923525333405, 0.15009430050849915, 1.7419445514678955, 3.232442617416382, 0.17255324125289917, 2.518077850341797, -0.7047576308250427, 2.414644479751587, -0.06630208343267441, 3.968060255050659, 1.540427803993225, 3.2830703258514404, -2.257655382156372, 3.6036360263824463, -0.5452967882156372, 1.0839694738388062, 2.314364433288574, 1.18087637424469, 0.18315550684928894, 2.330615520477295], "projection": [-0.24228081107139587, 10.442673683166504], "size": 19, "height": 5, "width": 8}