{"data": {"doi": "10.1109/tvcg.2016.2599016", "title": "Backward Finite-Time Lyapunov Exponents in Inertial Flows", "year": "2016", "conferenceName": "SciVis", "authors": "Tobias Günther;Holger Theisel", "citationCount": "2", "affiliation": "Gunther, T (Corresponding Author), Univ Magdeburg, Visual Comp Grp, D-39106 Magdeburg, Germany. Guenther, Tobias; Theisel, Holger, Univ Magdeburg, Visual Comp Grp, D-39106 Magdeburg, Germany.", "countries": "Germany", "abstract": "Inertial particles are finite-sized objects that are carried by fluid flows and in contrast to massless tracer particles they are subject to inertia effects. In unsteady flows, the dynamics of tracer particles have been extensively studied by the extraction of Lagrangian coherent structures (LCS), such as hyperbolic LCS as ridges of the Finite-Time Lyapunov Exponent (FTLE). The extension of the rich LCS framework to inertial particles is currently a hot topic in the CFD literature and is actively under research. Recently, backward FTLE on tracer particles has been shown to correlate with the preferential particle settling of small inertial particles. For larger particles, inertial trajectories may deviate strongly from (massless) tracer trajectories, and thus for a better agreement, backward FTLE should be computed on inertial trajectories directly. Inertial backward integration, however, has not been possible until the recent introduction of the influence curve concept, which - given an observation and an initial velocity - allows to recover all sources of inertial particles as tangent curves of a derived vector field. In this paper, we show that FTLE on the influence curve vector field is in agreement with preferential particle settling and more importantly it is not only valid for small (near-tracer) particles. We further generalize the influence curve concept to general equations of motion in unsteady spatio-velocity phase spaces, which enables backward integration with more general equations of motion. Applying the influence curve concept to tracer particles in the spatio-velocity domain emits streaklines in massless flows as tangent curves of the influence curve vector field. We demonstrate the correlation between inertial backward FTLE and the preferential particle settling in a number of unsteady vector fields", "keywords": "Inertial particles;finite-time Lyapunov exponents;backward integration;preferential particle settling", "link": "http://dx.doi.org/10.1109/TVCG.2016.2599016", "refList": ["10.1017/s0022112087000193", "10.1103/physrevlett.98.084502", "10.1063/1.2204064", "10.1063/1.858045", "10.5194/npg-22-571-2015", "10.1016/b978-012387582-2/50040-x", "10.1111/cgf.12846", "10.1007/s11538-010-9594-4", "10.1175/1520-0469(1998)055", "10.1063/1.1612500", "10.1016/0301-9322(94)90072-8", "10.1109/pacificvis.2012.6183582", "10.1016/j.physd.2005.10.007", "10.1016/s0167-2789(00)00142-1", "10.1109/tvcg.2007.70551", "10.1016/j.nonrwa.2014.08.002", "10.1109/tvcg.2007.70554", "10.1109/tvcg.2014.2346415", "10.1063/1.866206", "10.1103/physreve.73.026302", "10.1109/tvcg.2012.131", "10.1109/tvcg.2010.227", "10.1111/cgf.12659", "10.1109/tvcg.2014.2325043", "10.1109/tvcg.2011.265", "10.1063/1.1940367", "10.1016/s0167-2789(00)00199-8", "10.1023/a:1001816013475", "10.1063/1.864230", "10.1017/s0022112008005089", "10.1109/tvcg.2013.128", "10.1088/1742-6596/333/1/012003", "10.1111/cgf.12108", "10.1007/978-94-007-2482-2\\_30", "10.1016/j.jocs.2014.12.002", "10.1063/1.4916583", "10.1109/tvcg.2010.198", "10.1111/cgf.12269", "10.1109/tvcg.2012.33", "10.1126/science.1072678", "10.1103/physrevlett.84.5764", "10.1007/bf01275644", "10.1146/annurev-fluid-010313-141322", "10.1016/j.physd.2007.09.027", "10.1088/0031-8949/2010/t142/014001", "10.1063/1.4729453", "10.1017/jfm.2015.557", "10.1103/physreve.80.066318", "10.1103/physreve.93.023107", "10.1103/physrevlett.89.164501", "10.1126/science.183.4121.202", "10.1063/1.1694714"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864828", "title": "Objective Vortex Corelines of Finite-sized Objects in Fluid Flows", "year": "2018", "conferenceName": "SciVis", "authors": "Tobias Günther;Holger Theisel", "citationCount": "1", "affiliation": "Gunther, T (Corresponding Author), Swiss Fed Inst Technol, Comp Graph Lab, Zurich, Switzerland. Guenther, Tobias, Swiss Fed Inst Technol, Comp Graph Lab, Zurich, Switzerland. Theisel, Holger, Univ Magdeburg, Visual Comp Grp, Magdeburg, Germany.", "countries": "Switzerland;Germany", "abstract": "Vortices are one of the most-frequently studied phenomena in fluid flows. The center of the rotating motion is called the vortex coreline and its successful detection strongly depends on the choice of the reference frame. The optimal frame moves with the center of the vortex, which incidentally makes the observed fluid flow steady and thus standard vortex coreline extractors such as Sujudi-Haimes become applicable. Recently, an objective optimization framework was proposed that determines a near-steady reference frame for tracer particles. In this paper, we extend this technique to the detection of vortex corelines of inertial particles. An inertial particle is a finite-sized object that is carried by a fluid flow. In contrast to the usual tracer particles, they do not move tangentially with the flow, since they are subject to gravity and exhibit mass-dependent inertia. Their particle state is determined by their position and own velocity, which makes the search for the optimal frame a high-dimensional problem. We demonstrate in this paper that the objective detection of an inertial vortex coreline can be reduced in 2D to a critical point search in 2D. For 3D flows, however, the vortex coreline criterion remains a parallel vectors condition in 6D. To detect the vortex corelines we propose a recursive subdivision approach that is tailored to the underlying structure of the 6D vectors. The resulting algorithm is objective, and we demonstrate the vortex coreline extraction in a number of 2D and 3D vector fields.", "keywords": "Vortex extraction,inertial particles,objectivity,vortex coreline", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864828", "refList": ["10.1016/0377-0257(79)87004-4", "10.1111/cgf.12358", "10.1016/0167-2789(91)90088-q", "10.1109/2.35197", "10.1109/tvcg.2016.2599016", "10.5194/npg-22-571-2015", "10.1109/tvcg.2007.70633", "10.1007/978-3-540-70823-0\\_9", "10.1016/b978-012387582-2/50040-x", "10.1111/cgf.12846", "10.1007/s11538-010-9594-4", "10.1017/s002211209900467x", "10.1143/jpsj.66.1331", "10.1063/1.857730", "10.1017/s0022112092001460", "10.1016/s0097-8493(02)00056-0", "10.1017/jfm.2016.151", "10.1175/2009jas2865.1", "10.1111/j.1467-8659.2008.01238.x", "10.1016/j.nonrwa.2014.08.002", "10.1109/visual.1997.663910", "10.1109/visual.1999.809896", "10.1146/annurev.fluid.23.1.601", "10.1109/tvcg.2015.2467200", "10.1145/1057432.1057452", "10.1109/tvcg.2014.2346415", "10.1111/cgf.13114", "10.1007/s100219900068", "10.2514/2.744", "10.1111/cgf.12659", "10.1145/3072959.3073684", "10.1023/a:1001816013475", "10.1007/s10569-015-9617-4", "10.1016/0960-0779(94)90137-6", "10.1016/0010-4655(88)90020-3", "10.1109/visual.1991.175773", "10.1063/1.864230", "10.1088/1742-6596/333/1/012003", "10.1111/cgf.12108", "10.1017/s0022112004002526", "10.1017/s0022112008005089", "10.1007/978-94-007-2482-2\\_30", "10.1016/j.ijengsci.2007.10.005", "10.1111/cgf.12913", "10.1109/tvcg.2009.11", "10.1111/cgf.13439", "10.1016/j.crme.2015.08.002", "10.1109/tvcg.2007.70545", "10.1145/2897824.2925919", "10.1109/visual.1998.745296", "10.1109/tvcg.2016.2599018", "10.1016/j.physd.2007.09.027", "10.1088/0031-8949/2010/t142/014001", "10.1016/0011-7471(70)90059-8", "10.1017/s0022112095000462", "10.1109/tvcg.2007.1053"], "wos": 1, "children": [{"doi": "10.1111/cgf.13689", "year": "2019", "title": "Robust Reference Frame Extraction from Unsteady 2D Vector Fields with Convolutional Neural Networks", "conferenceName": "EuroVis", "authors": "Byungsoo Kim;Tobias G{\\\"{u}}nther", "citationCount": "3", "affiliation": "Kim, B (Corresponding Author), Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.\nKim, Byungsoo; Guenther, Tobias, Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "Robust feature extraction is an integral part of scientific visualization. In unsteady vector field analysis, researchers recently directed their attention towards the computation of near-steady reference frames for vortex extraction, which is a numerically challenging endeavor. In this paper, we utilize a convolutional neural network to combine two steps of the visualization pipeline in an end-to-end manner: the filtering and the feature extraction. We use neural networks for the extraction of a steady reference frame for a given unsteady 2D vector field. By conditioning the neural network to noisy inputs and resampling artifacts, we obtain numerically stabler results than existing optimization-based approaches. Supervised deep learning typically requires a large amount of training data. Thus, our second contribution is the creation of a vector field benchmark data set, which is generally useful for any local deep learning-based feature extraction. Based on Vatistas velocity profile, we formulate a parametric vector field mixture model that we parameterize based on numerically-computed example vector fields in near-steady reference frames. Given the parametric model, we can efficiently synthesize thousands of vector fields that serve as input to our deep learning architecture. The proposed network is evaluated on an unseen numerical fluid flow simulation.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13689", "refList": ["10.1016/0377-0257(79)87004-4", "10.1111/cgf.12358", "10.1109/tvcg.2018.2864828", "10.1016/0167-2789(91)90088-q", "10.1007/978-3-540-70823-0\\_9", "10.1016/b978-012387582-2/50040-x", "10.1111/cgf.13405", "10.1111/cgf.13319", "10.1109/tvcg.2018.2843369", "10.1007/bf00538235", "10.23940/ijpe.18.03", "10.1017/jfm.2016.151", "10.1109/visual.1999.809896", "10.1146/annurev.fluid.23.1.601", "10.1109/tvcg.2007.1036", "10.1109/tvcg.2018.2864839", "10.1007/978-3-319-54024-5\\_6", "10.1109/tvcg.2013.189", "10.1145/3072959.3073684", "10.1109/tvcg.2015.2467203", "10.2514/2.957", "10.1016/0960-0779(94)90137-6", "10.1109/visual.1991.175773", "10.1109/visual.1996.568137", "10.1017/s0022112004002526", "10.1109/pacificvis.2016.7465253", "10.1007/bf00849110", "10.1007/bf00198434", "10.1109/tvcg.2007.70545", "10.3390/informatics4030027", "10.1137/140983665", "10.1016/0011-7471(70)90059-8", "10.1017/s0022112095000462", "10.1145/1183287.1183290"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3028947", "title": "A Fluid Flow Data Set for Machine Learning and its Application to Neural Flow Map Interpolation", "year": "2020", "conferenceName": "SciVis", "authors": "Jakob Jakob;Markus H. Gross;Tobias Günther", "citationCount": "0", "affiliation": "Jakob, J (Corresponding Author), Swiss Fed Inst Technol, Zurich, Switzerland. Jakob, Jakob; Gross, Markus; Guenther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "In recent years, deep learning has opened countless research opportunities across many different disciplines. At present, visualization is mainly applied to explore and explain neural networks. Its counterpart-the application of deep learning to visualization problems-requires us to share data more openly in order to enable more scientists to engage in data-driven research. In this paper, we construct a large fluid flow data set and apply it to a deep learning problem in scientific visualization. Parameterized by the Reynolds number, the data set contains a wide spectrum of laminar and turbulent fluid flow regimes. The full data set was simulated on a high-performance compute cluster and contains 8000 time-dependent 2D vector fields, accumulating to more than 16 TB in size. Using our public fluid data set, we trained deep convolutional neural networks in order to set a benchmark for an improved post-hoc Lagrangian fluid flow analysis. In in-situ settings, flow maps are exported and interpolated in order to assess the transport characteristics of time-dependent fluids. Using deep learning, we improve the accuracy of flow map interpolations, allowing a more precise flow analysis at a reduced memory IO footprint.", "keywords": "Scientific visualization,deep learning,flow maps", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028947", "refList": ["10.1007/978-3-319-10593-2\\_25", "10.1145/3355089.3356560", "10.1109/access.2019.2903582", "10.1111/cgf.13405", "10.1109/tmm.2019.2919431", "10.1017/jfm.2016.151", "10.1016/j.physd.2005.10.007", "10.1007/978-3-030-00533-7\\_36", "10.3390/rs11161921", "10.1007/978-3-030-48457-6\\_1", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/tvcg.2007.70554", "10.1109/mcg.2018.2881523", "10.1109/cvpr.2016.207", "10.1145/1073204.1073264", "10.1145/3072959.3073643", "10.1109/tpami.2015.2439281", "10.2312/pgv", "10.4208/cicp.oa-2018-0035", "10.1109/cvpr.2017.693", "10.1109/tvcg.2013.128", "10.1109/igarss.2018.8519261", "10.1063/1.3270044", "10.2312/pgv.20191115", "10.1145/3197517.3201304", "10.1145/3065386", "10.1145/1360612.1360649", "10.1109/mcse.2015.103", "10.1145/3355089.3356575", "10.1109/mcg.2018.2881502", "10.1029/2019jd032121", "10.3390/informatics4030027", "10.1109/access.2019.2931781", "10.1007/s12650-018-0523-1", "10.1109/tvcg.2019.2934332", "10.1146/annurev.fluid.32.1.165", "10.1007/978-3-319-46475-6\\_43", "10.1126/science.1127647", "10.1007/978-3-319-46475-6\\_25", "10.1111/cgf.13689"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.8737", "year": "2020", "title": "SSR-VFD: Spatial Super-Resolution for Vector Field Data Analysis and Visualization", "conferenceName": "PacificVis", "authors": "Li Guo;Shaojie Ye;Jun Han;Hao Zheng;Han Gao;Danny Z. Chen;Jian{-}Xun Wang;Chaoli Wang", "citationCount": "1", "affiliation": "Guo, L (Corresponding Author), Nankai Univ, Tianjin, Peoples R China.\nGuo, Li, Nankai Univ, Tianjin, Peoples R China.\nYe, Shaojie, Zhejiang Univ, Hangzhou, Zhejiang, Peoples R China.\nHan, Jun; Zheng, Hao; Gao, Han; Chen, Danny Z.; Wang, Jian-Xun; Wang, Chaoli, Univ Notre Dame, Notre Dame, IN 46556 USA.", "countries": "USA;China", "abstract": "We present SSR-VFD, a novel deep learning framework that produces coherent spatial super-resolution (SSR) of three-dimensional vector field data (VFD). SSR-VFD is the first work that advocates a machine learning approach to generate high-resolution vector fields from low-resolution ones. The core of SSR-VFD lies in the use of three separate neural nets that take the three components of a low-resolution vector field as input and jointly output a synthesized high-resolution vector field. To capture spatial coherence, we take into account magnitude and angle losses in network optimization. Our method can work in the in situ scenario where VFD are down-sampled at simulation time for storage saving and these reduced VFD are upsampled back to their original resolution during postprocessing. To demonstrate the effectiveness of SSR-VFD, we show quantitative and qualitative results with several vector field data sets of different characteristics and compare our method against volume upscaling using bicubic interpolation, and two solutions based on CNN and GAN, respectively.", "keywords": "Spatial super-resolution; vector field data; convolutional neural network; deep learning", "link": "https://doi.org/10.1109/PacificVis48177.2020.8737", "refList": ["10.1016/j.ijvsm.2017.05.001", "10.1016/j.jvs.2005.01.020", "10.1109/iccv.2015.123", "10.1111/cgf.13620", "10.1109/cvpr.2019.00831", "10.1109/cvpr.2019.00817", "10.1109/cvpr.2019.00399", "10.1109/tvcg.2019.2934312", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/tvcg.2018.2816059", "10.1109/mcg.2018.2881523", "10.1109/tpami.2015.2439281", "10.1109/bigdata.2018.8622520", "10.1145/3197517.3201304", "10.1109/tvcg.2018.2796085", "10.1109/tvcg.2019.2934255", "10.1109/cvpr.2016.90", "10.1109/pacificvis.2019.00041", "10.1111/cgf.13689"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030374", "title": "VC-Net: Deep Volume-Composition Networks for Segmentation and Visualization of Highly Sparse and Noisy Image Data", "year": "2020", "conferenceName": "SciVis", "authors": "Yifan Wang;Guoli Yan;Haikuan Zhu;Sagar Buch;Ying Wang;E. Mark Haacke;Jing Hua;Zichun Zhong", "citationCount": "0", "affiliation": "Wang, YF (Corresponding Author), Wayne State Univ, Dept Comp Sci, Detroit, MI 48202 USA. Wang, Yifan; Yan, Guoli; Zhu, Haikuan; Hua, Jing; Zhong, Zichun, Wayne State Univ, Dept Comp Sci, Detroit, MI 48202 USA. Buch, Sagar; Wang, Ying; Haacke, Ewart Mark, Wayne State Univ, Dept Radiol, Detroit, MI 48201 USA.", "countries": "USA", "abstract": "The fundamental motivation of the proposed work is to present a new visualization-guided computing paradigm to combine direct 3D volume processing and volume rendered clues for effective 3D exploration. For example, extracting and visualizing microstructures in-vivo have been a long-standing challenging problem. However, due to the high sparseness and noisiness in cerebrovasculature data as well as highly complex geometry and topology variations of micro vessels, it is still extremely challenging to extract the complete 3D vessel structure and visualize it in 3D with high fidelity. In this paper, we present an end-to-end deep learning method, VC-Net, for robust extraction of 3D microvascular structure through embedding the image composition, generated by maximum intensity projection (MIP), into the 3D volumetric image learning process to enhance the overall performance. The core novelty is to automatically leverage the volume visualization technique (e.g., MIP - a volume rendering scheme for 3D volume images) to enhance the 3D data exploration at the deep learning level. The MIP embedding features can enhance the local vessel signal (through canceling out the noise) and adapt to the geometric variability and scalability of vessels, which is of great importance in microvascular tracking. A multi-stream convolutional neural network (CNN) framework is proposed to effectively learn the 3D volume and 2D MIP feature vectors, respectively, and then explore their inter-dependencies in a joint volume-composition embedding space by unprojecting the 2D feature vectors into the 3D volume embedding space. It is noted that the proposed framework can better capture the small/micro vessels and improve the vessel connectivity. To our knowledge, this is the first time that a deep learning framework is proposed to construct a joint convolutional embedding space, where the computed vessel probabilities from volume rendering based 2D projection and 3D volume can be explored and integrated synergistically. Experimental results are evaluated and compared with the traditional 3D vessel segmentation methods and the state-of-the-art in deep learning, by using extensive public and real patient (micro- )cerebrovascular image datasets. The application of this accurate segmentation and visualization of sparse and complicated 3D microvascular structure facilitated by our method demonstrates the potential in a powerful MR arteriogram and venogram diagnosis of vascular disease.", "keywords": "Deep neural network,3D cerebrovascular segmentation and visualization,maximum intensity projection (MIP),joint embedding", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030374", "refList": ["10.1109/cluster.2018.00036", "10.1109/iccv.2015.123", "10.1109/tvcg.2013.133", "10.1109/cvpr.2017.19", "10.1109/tvcg.2019.2934312", "10.1007/978-3-319-46487-9\\_40", "10.1109/tvcg.2006.175", "10.1109/tvcg.2007.70523", "10.1109/tvcg.2018.2880207", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/iccv.2017.244", "10.1109/cvpr.2017.632", "10.1109/tvcg.2018.2816059", "10.1109/pacificvis.2009.4906852", "10.1109/tvcg.2018.2864808", "10.1109/mcg.2018.2881523", "10.1109/tvcg.2015.2467431", "10.1109/tpami.2015.2439281", "10.1109/pacificvis48177.2020.8737", "10.1109/cvpr.2019.00244", "10.1109/tvcg.2006.165", "10.1109/bigdata.2018.8622520", "10.1007/978-3-319-46466-4\\_29", "10.1109/visual.2019.8933759", "10.1145/3197517.3201304", "10.1109/pacificvis.2011.5742378", "10.1109/cvpr.2006.91", "10.1109/pacificvis.2011.5742369", "10.1109/tvcg.2019.2934255", "10.1109/cvpr.2016.90", "10.1007/978-3-319-24574-4\\_28", "10.1109/pacificvis.2019.00041", "10.1109/tvcg.2019.2934332", "10.1109/cvpr.2018.00916", "10.1007/978-3-319-46475-6\\_43"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 7}], "len": 9}, {"doi": "10.1111/cgf.13420", "year": "2018", "title": "Visualizing the Phase Space of Heterogeneous Inertial Particles in 2D Flows", "conferenceName": "EuroVis", "authors": "Irene Baeza Rojo;Markus H. Gross;Tobias G{\\\"{u}}nther", "citationCount": "2", "affiliation": "Rojo, IB (Corresponding Author), Swiss Fed Inst Technol, Comp Graph Lab, Zurich, Switzerland.\nRojo, Irene Baeza; Gross, Markus; Guenther, Tobias, Swiss Fed Inst Technol, Comp Graph Lab, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "In many scientific disciplines, the motion of finite-sized objects in fluid flows plays an important role, such as in brownout engineering, sediment transport, oceanology or meteorology. These finite-sized objects are called inertial particles and, in contrast to traditional tracer particles, their motion depends on their current position, their own particle velocity, the time and their size. Thus, the visualization of their motion becomes a high-dimensional problem that entails computational and perceptual challenges. So far, no visualization explored and visualized the particle trajectories under variation of all seeding parameters. In this paper, we propose three coordinated views that visualize the different aspects of the high-dimensional space in which the particles live. We visualize the evolution of particles over time, showing that particles travel different distances in the same time, depending on their size. The second view provides a clear illustration of the trajectories of different particle sizes and allows the user to easily identify differences due to particle size. Finally, we embed the trajectories in the space-velocity domain and visualize their distance to an attracting manifold using ribbons. In all views, we support interactive linking and brushing, and provide abstraction through density volumes that are shown by direct volume rendering and isosurface slabs. Using our method, users gain deeper insights into the dynamics of inertial particles in 2D fluids, including size-dependent separation, preferential clustering and attraction. We demonstrate the effectiveness of our method in multiple steady and unsteady 2D flows.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13420", "refList": ["10.1109/tvcg.2013.143", "10.1109/tvcg.2015.2467204", "10.1145/1618452.1618487", "10.1109/visual.1998.745323", "10.1109/tvcg.2016.2599016", "10.5194/npg-22-571-2015", "10.1109/visual.1996.567777", "10.1111/cgf.12846", "10.1103/physreve.93.033108", "10.1007/s11538-010-9594-4", "10.1109/visual.1997.663867", "10.1109/icdmw.2009.55", "10.1109/tvcg.2014.2346319", "10.1016/j.physd.2005.10.007", "10.1109/tvcg.2014.2346455", "10.1016/s0167-2789(00)00142-1", "10.1175/2009jas2865.1", "10.1016/j.nonrwa.2014.08.002", "10.1109/mcg.2014.52", "10.1117/12.906872", "10.1109/tvcg.2014.2346415", "10.1111/cgf.13114", "10.1111/cgf.12659", "10.1109/2945.981847", "10.1023/a:1001816013475", "10.1007/s10569-015-9617-4", "10.1111/j.1467-8659.2010.01650.x", "10.1063/1.864230", "10.1017/s0022112008005089", "10.1088/1742-6596/333/1/012003", "10.1111/cgf.12108", "10.1007/978-94-007-2482-2\\_30", "10.1111/cgf.12913", "10.1111/cgf.13115", "10.1109/vast.2015.7347634", "10.1109/tvcg.2016.2599018", "10.1103/physreve.84.016406", "10.1016/j.physd.2007.09.027", "10.1088/0031-8949/2010/t142/014001", "10.1016/0022-0396(79)90152-9"], "wos": 1, "children": [{"doi": "10.1111/cgf.13978", "year": "2020", "title": "Phase Space Projection of Dynamical Systems", "conferenceName": "EuroVis", "authors": "Nemanja Bartolovic;Markus Gross;Tobias G{\\\"{u}}nther", "citationCount": "0", "affiliation": "Bartolovic, N (Corresponding Author), Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.\nBartolovic, Nemanja; Gross, Markus; Gunther, Tobias, Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "Dynamical systems are commonly used to describe the state of time-dependent systems. In many engineering and control problems, the state space is high-dimensional making it difficult to analyze and visualize the behavior of the system for varying input conditions. We present a novel dimensionality reduction technique that is tailored to high-dimensional dynamical systems. In contrast to standard general purpose dimensionality reduction algorithms, we use energy minimization to preserve properties of the flow in the high-dimensional space. Once the projection operator is optimized, further high-dimensional trajectories are projected easily. Our 3D projection maintains a number of useful flow properties, such as critical points and flow maps, and is optimized to match geometric characteristics of the high-dimensional input, as well as optional user constraints. We apply our method to trajectories traced in the phase spaces of second-order dynamical systems, including finite-sized objects in fluids, the circular restricted three-body problem and a damped double pendulum. We compare the projections with standard visualization techniques, such as PCA, t-SNE and UMAP, and visualize the dynamical systems with multiple coordinated views interactively, featuring a spatial embedding, projection to subspaces, our dimensionality reduction and a seed point exploration tool.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13978", "refList": ["10.1109/tvcg.2013.182", "10.1109/tvcg.2008.153", "10.1007/s003710050110", "10.1063/1.2204064", "10.1111/j.1467-8659.2011.01958.x", "10.1109/tvcg.2016.2599016", "10.1109/visual.1996.567777", "10.1109/infvis.2004.68", "10.1038/nbt.4314", "10.1109/tvcg.2011.254", "10.1109/tvcg.2011.27", "10.1111/cgf.12846", "10.1162/089976698300017467", "10.1111/cgf.13421", "10.1007/978-3-540-33037-08", "10.1038/s41591-019-0521-4", "10.1109/tvcg.2013.65", "10.1111/cgf.13828", "10.1080/13506280444000102.http://www.uvt.nl/ticc", "10.1109/tvcg.2011.78", "10.1037/h0071325", "10.1111/cgf.13114", "10.1111/cgf.13420", "10.1111/cgf.12659", "10.1145/3072959.3073684", "10.1109/cahpc.2018.8645912", "10.1109/tvcg.2011.177", "10.1109/tvcg.2011.201", "10.1016/j.arcontrol.2005.08.002", "10.1109/tvcg.2016.2640960", "10.1007/s11071-005-2790-3", "10.1109/sbac-pad.2018.00060", "10.1109/tvcg.2015.2467132.3", "10.1007/978-3-540", "10.1088/0034-4885/77/6/065901", "10.1109/tvcg.2016.2599018", "10.1109/tvcg.2018.2846735", "10.1007/bf02199365", "10.1007/978-3-540-33037-0\\_8"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.13978", "year": "2020", "title": "Phase Space Projection of Dynamical Systems", "conferenceName": "EuroVis", "authors": "Nemanja Bartolovic;Markus Gross;Tobias G{\\\"{u}}nther", "citationCount": "0", "affiliation": "Bartolovic, N (Corresponding Author), Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.\nBartolovic, Nemanja; Gross, Markus; Gunther, Tobias, Swiss Fed Inst Technol, Dept Comp Sci, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "Dynamical systems are commonly used to describe the state of time-dependent systems. In many engineering and control problems, the state space is high-dimensional making it difficult to analyze and visualize the behavior of the system for varying input conditions. We present a novel dimensionality reduction technique that is tailored to high-dimensional dynamical systems. In contrast to standard general purpose dimensionality reduction algorithms, we use energy minimization to preserve properties of the flow in the high-dimensional space. Once the projection operator is optimized, further high-dimensional trajectories are projected easily. Our 3D projection maintains a number of useful flow properties, such as critical points and flow maps, and is optimized to match geometric characteristics of the high-dimensional input, as well as optional user constraints. We apply our method to trajectories traced in the phase spaces of second-order dynamical systems, including finite-sized objects in fluids, the circular restricted three-body problem and a damped double pendulum. We compare the projections with standard visualization techniques, such as PCA, t-SNE and UMAP, and visualize the dynamical systems with multiple coordinated views interactively, featuring a spatial embedding, projection to subspaces, our dimensionality reduction and a seed point exploration tool.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13978", "refList": ["10.1109/tvcg.2013.182", "10.1109/tvcg.2008.153", "10.1007/s003710050110", "10.1063/1.2204064", "10.1111/j.1467-8659.2011.01958.x", "10.1109/tvcg.2016.2599016", "10.1109/visual.1996.567777", "10.1109/infvis.2004.68", "10.1038/nbt.4314", "10.1109/tvcg.2011.254", "10.1109/tvcg.2011.27", "10.1111/cgf.12846", "10.1162/089976698300017467", "10.1111/cgf.13421", "10.1007/978-3-540-33037-08", "10.1038/s41591-019-0521-4", "10.1109/tvcg.2013.65", "10.1111/cgf.13828", "10.1080/13506280444000102.http://www.uvt.nl/ticc", "10.1109/tvcg.2011.78", "10.1037/h0071325", "10.1111/cgf.13114", "10.1111/cgf.13420", "10.1111/cgf.12659", "10.1145/3072959.3073684", "10.1109/cahpc.2018.8645912", "10.1109/tvcg.2011.177", "10.1109/tvcg.2011.201", "10.1016/j.arcontrol.2005.08.002", "10.1109/tvcg.2016.2640960", "10.1007/s11071-005-2790-3", "10.1109/sbac-pad.2018.00060", "10.1109/tvcg.2015.2467132.3", "10.1007/978-3-540", "10.1088/0034-4885/77/6/065901", "10.1109/tvcg.2016.2599018", "10.1109/tvcg.2018.2846735", "10.1007/bf02199365", "10.1007/978-3-540-33037-0\\_8"], "wos": 1, "children": [], "len": 1}], "len": 17}, "index": 615, "embedding": [1.0854476690292358, 1.0028833150863647, -1.0254276990890503, -0.7150399088859558, -0.14495980739593506, 0.16650904715061188, -0.706787109375, 2.458988666534424, 2.02895450592041, 0.6686571836471558, 1.3942804336547852, 0.9559103846549988, 2.4024035930633545, 2.1323225498199463, -0.7231093645095825, 0.3907182216644287, 1.52899968624115, 0.06482167541980743, 0.05207948759198189, 2.3676464557647705, -0.06630208343267441, -0.6113291382789612, -1.2249194383621216, 1.5172876119613647, -2.4643778800964355, 1.7645710706710815, -0.5077023506164551, 0.4149886965751648, 1.905336856842041, -2.256183385848999, 0.6786290407180786, 0.5544145107269287], "projection": [1.2112492322921753, 8.741236686706543], "size": 9, "height": 5, "width": 3}