{"data": {"doi": "10.1109/tvcg.2017.2743938", "title": "The Topology ToolKit", "year": "2017", "conferenceName": "SciVis", "authors": "Julien Tierny;Guillaume Favelier;Joshua A. Levine;Charles Gueunet;Michael Michaux", "citationCount": "12", "affiliation": "Tierny, J (Corresponding Author), Univ Paris 06, Sorbonne Univ, UPMC, CNRS,LIP6,UMR 7606, Paris, France. Tierny, Julien; Favelier, Guillaume; Gueunet, Charles; Michaux, Michael, Univ Paris 06, Sorbonne Univ, UPMC, CNRS,LIP6,UMR 7606, Paris, France. Levine, Joshua A., Univ Arizona, Tucson, AZ 85721 USA. Gueunet, Charles, Kitware SAS, Villeurbanne, France.", "countries": "USA;France", "abstract": "This system paper presents the Topology ToolKit (TTK), a software platform designed for the topological analysis of scalar data in scientific visualization. While topological data analysis has gained in popularity over the last two decades, it has not yet been widely adopted as a standard data analysis tool for end users or developers. TTK aims at addressing this problem by providing a unified, generic, efficient, and robust implementation of key algorithms for the topological analysis of scalar data, including: critical points, integral lines, persistence diagrams, persistence curves, merge trees, contour trees, Morse-Smale complexes, fiber surfaces, continuous scatterplots, Jacobi sets, Reeb spaces, and more. TTK is easily accessible to end users due to a tight integration with ParaView. It is also easily accessible to developers through a variety of bindings (Python, VTK/C++) for fast prototyping or through direct, dependency-free, C++, to ease integration into pre-existing complex systems. While developing TTK, we faced several algorithmic and software engineering challenges, which we document in this paper. In particular, we present an algorithm for the construction of a discrete gradient that complies to the critical points extracted in the piecewise-linear setting. This algorithm guarantees a combinatorial consistency across the topological abstractions supported by TTK, and importantly, a unified implementation of topological data simplification for multi-scale exploration and analysis. We also present a cached triangulation data structure, that supports time efficient and generic traversals, which self-adjusts its memory usage on demand for input simplicial meshes and which implicitly emulates a triangulation for regular grids with no memory overhead. Finally, we describe an original software architecture, which guarantees memory efficient and direct accesses to TTK features, while still allowing for researchers powerful and easy bindings and extensions. TTK is open source (BSD license) and its code. online documentation and video tutorials are available on TTK's website [108].", "keywords": "Topological data analysis,scalar data,data segmentation,feature extraction,bivariate data,uncertain data", "link": "http://dx.doi.org/10.1109/TVCG.2017.2743938", "refList": ["10.1109/tvcg.2013.81", "10.1142/s0218195905001580", "10.2312/spbg/spbg07/091-100", "10.1109/tvcg.2014.2346322", "10.1007/s00453-014-9887-3", "10.1145/1239451.1239509", "10.1016/b978-012387582-2/50038-1", "10.1007/s10915-011-9501-7", "10.1111/cgf.12121", "10.1016/j.parco.2007.09.001"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934338", "title": "The Effect of Data Transformations on Scalar Field Topological Analysis of High-Order FEM Solutions", "year": "2019", "conferenceName": "SciVis", "authors": "Ashok Jallepalli;Joshua A. Levine;Robert Michael Kirby", "citationCount": "0", "affiliation": "Jallepalli, A (Corresponding Author), Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Jallepalli, Ashok; Kirby, Robert M., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Levine, Joshua A., Univ Arizona, Dept Comp Sci, Tucson, AZ 85721 USA.", "countries": "USA", "abstract": "High-order finite element methods (HO-FEM) are gaining popularity in the simulation community due to their success in solving complex flow dynamics. There is an increasing need to analyze the data produced as output by these simulations. Simultaneously, topological analysis tools are emerging as powerful methods for investigating simulation data. However, most of the current approaches to topological analysis have had limited application to HO-FEM simulation data for two reasons. First, the current topological tools are designed for linear data (polynomial degree one), but the polynomial degree of the data output by these simulations is typically higher (routinely up to polynomial degree six). Second, the simulation data and derived quantities of the simulation data have discontinuities at element boundaries, and these discontinuities do not match the input requirements for the topological tools. One solution to both issues is to transform the high-order data to achieve low-order, continuous inputs for topological analysis. Nevertheless, there has been little work evaluating the possible transformation choices and their downstream effect on the topological analysis. We perform an empirical study to evaluate two commonly used data transformation methodologies along with the recently introduced L-SIAC filter for processing high-order simulation data. Our results show diverse behaviors are possible. We offer some guidance about how best to consider a pipeline of topological analysis of HO-FEM simulations with the currently available implementations of topological analysis.", "keywords": "High-Order Finite Element Methods,Filtering Techniques,Scalar Field Visualization,Topological Analysis", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934338", "refList": ["10.1109/tvcg.2008.9", "10.1137/15m1053220", "10.1007/s10915-014-9946-6", "10.1111/cgf.13165", "10.1016/j.combustflame.2008.10.029", "10.1016/j.cagd.2012.03.017", "10.2307/2005782", "10.1137/16m1097845", "10.1007/s10915-013-9748-2", "10.1016/j.cpc.2015.02.008", "10.1016/j.comgeo.2006.05.009", "10.1016/j.compfluid.2013.12.007", "10.1016/s0925-7721(02)00093-7", "10.1007/s10915-011-9535-x", "10.1109/tvcg.2017.2743938", "10.1145/1239451.1239509", "10.1090/s0025-5718-02-01464-3", "10.1007/s10915-008-9230-8", "10.1016/b978-012387582-2/50038-1", "10.1103/physreve.86.016309", "10.1109/tvcg.2009.69", "10.1016/j.cam.2015.08.011", "10.1016/j.jcp.2018.06.037", "10.1109/tvcg.2017.2744058", "10.1109/visual.2004.113", "10.1137/120874059", "10.1007/s00453-003-1052-3", "10.1109/tvcg.2011.109", "10.1137/100782188", "10.1007/978-3-540-88606-8\\_5", "10.1109/pacificvis.2015.7156387", "10.1137/110830678", "10.2514/1.j054181", "10.1007/s10915-017-0517-5", "10.1142/s0218195909002903"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934257", "title": "Toward Localized Topological Data Structures: Querying the Forest for the Tree", "year": "2019", "conferenceName": "SciVis", "authors": "Pavol Klacansky;Attila Gyulassy;Peer-Timo Bremer;Valerio Pascucci", "citationCount": "1", "affiliation": "Klacansky, P (Corresponding Author), Univ Utah, Sci Comp \\& Imaging Inst, Salt Lake City, UT 84112 USA. Klacansky, Pavol; Gyulassy, Attila; Pascucci, Valerio, Univ Utah, Sci Comp \\& Imaging Inst, Salt Lake City, UT 84112 USA. Bremer, Peer-Timo, Lawrence Livermore Natl Lab, Livermore, CA USA.", "countries": "USA", "abstract": "Topological approaches to data analysis can answer complex questions about the number, connectivity, and scale of intrinsic features in scalar data. However, the global nature of many topological structures makes their computation challenging at scale, and thus often limits the size of data that can be processed. One key quality to achieving scalability and performance on modern architectures is data locality, i.e., a process operates on data that resides in a nearby memory system, avoiding frequent jumps in data access patterns. From this perspective, topological computations are particularly challenging because the implied data structures represent features that can span the entire data set, often requiring a global traversal phase that limits their scalability. Traditionally, expensive preprocessing is considered an acceptable trade-off as it accelerates all subsequent queries. Most published use cases, however, explore only a fraction of all possible queries, most often those returning small, local features. In these cases, much of the global information is not utilized, yet computing it dominates the overall response time. We address this challenge for merge trees, one of the most commonly used topological structures. In particular, we propose an alternative representation, the merge forest, a collection of local trees corresponding to regions in a domain decomposition. Local trees are connected by a bridge set that allows us to recover any necessary global information at query time. The resulting system couples (i) a preprocessing that scales linearly in practice with (ii) fast runtime queries that provide the same functionality as traditional queries of a global merge tree. We test the scalability of our approach on a shared-memory parallel computer and demonstrate how data structure locality enables the analysis of large data with an order of magnitude performance improvement over the status quo. Furthermore, a merge forest reduces the memory overhead compared to a global merge tree and enables the processing of data sets that are an order of magnitude larger than possible with previous algorithms.", "keywords": "Merge tree,parallel computation,topology", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934257", "refList": ["10.1109/ldav.2017.8231846", "10.1145/276884.276892", "10.1090/mbk/069", "10.1007/s00454-002-2885-2", "10.1109/tvcg.2015.2452919", "10.1016/0956-0521(91)90014-v", "10.1145/262839.269238", "10.1145/364099.364331", "10.1016/j.comgeo.2006.05.009", "10.1109/ldav.2016.7874333", "10.1080/16864360.2017.1419648", "10.1016/s0925-7721(02)00093-7", "10.1145/2517327.2442526", "10.1109/tvcg.2017.2743938", "10.1016/j.proci.2014.05.147", "10.1109/tvcg.2010.253", "10.1103/physrevlett.113.155005", "10.1007/978-3-319-44684-420", "10.1109/ldav.2016.7874312", "10.1007/b106657\\_2", "10.1109/sc.2014.88", "10.1109/ldav.2015.7348066", "10.1007/978-3-319-04099-86", "10.1109/ldav.2012.6378962", "10.1109/pacificvis.2017.8031584", "10.2140/camcos.2016.11.37", "10.1016/j.combustflame.2014.08.021", "10.1109/tvcg.2006.22", "10.1007/pl00009159", "10.1007/s00453-003-1052-3", "10.1109/tvcg.2007.47", "10.1017/jfm.2015.268", "10.1007/s00454-017-9901-z", "10.1145/62.2160", "10.1145/2996913.2996952", "10.1145/1868237.1868249", "10.1145/77635.77639", "10.1016/j.comgeo.2004.05.002", "10.1088/1742-6596/180/1/012086", "10.1109/pacificvis.2015.7156387", "10.1109/tpds.2019.2898436", "10.1145/1463822.1463869", "10.1109/tvcg.2017.2744238", "10.1109/hipc.2012.6507496", "10.1109/tvcg.2006.162", "10.1017/s0022112004009681", "10.2307/2317380"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030353", "title": "Localized Topological Simplification of Scalar Data", "year": "2020", "conferenceName": "SciVis", "authors": "Jonas Lukasczyk;Christoph Garth;Ross Maciejewski;Julien Tierny", "citationCount": "0", "affiliation": "Lukasczyk, J (Corresponding Author), Arizona State Univ, Tempe, AZ 85287 USA. Lukasczyk, Jonas; Maciejewski, Ross, Arizona State Univ, Tempe, AZ 85287 USA. Garth, Christoph, Tech Univ Kaiserslautern, Kaiserslautern, Germany. Tierny, Julien, Sorbonne Univ, Paris, France. Tierny, Julien, CNRS, Paris, France.", "countries": "Germany;USA;France", "abstract": "This paper describes a localized algorithm for the topological simplification of scalar data, an essential pre-processing step of topological data analysis (TDA). Given a scalar field $f$ and a selection of extrema to preserve, the proposed localized topological simplification (LTS) derives a function g that is close to $f$ and only exhibits the selected set of extrema. Specifically, sub- and superlevel set components associated with undesired extrema are first locally flattened and then correctly embedded into the global scalar field, such that these regions are guaranteed-from a combinatorial perspective-to no longer contain any undesired extrema. In contrast to previous global approaches, LTS only and independently processes regions of the domain that actually need to be simplified, which already results in a noticeable speedup. Moreover, due to the localized nature of the algorithm, LTS can utilize shared-memory parallelism to simplify regions simultaneously with a high parallel efficiency (70%). Hence, LTS significantly improves interactivity for the exploration of simplification parameters and their effect on subsequent topological analysis. For such exploration tasks, LTS brings the overall execution time of a plethora of TDA pipelines from minutes down to seconds, with an average observed speedup over state-of-the-art techniques of up to $\\times 36$. Furthermore, in the special case where preserved extrema are selected based on topological persistence, an adapted version of LTS partially computes the persistence diagram and simultaneously simplifies features below a predefined persistence threshold. The effectiveness of LTS, its parallel efficiency, and its resulting benefits for TDA are demonstrated on several simulated and acquired datasets from different application domains, including physics, chemistry, and biomedical imaging.", "keywords": "Topological data analysis,scalar data,simplification,feature extraction,parallel computing", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030353", "refList": ["10.1016/j.cag.2014.01.006", "10.1002/jcc.25181", "10.1109/tvcg.2007.70601", "10.2307/2412323", "10.1016/j.jsc.2016.03.009", "10.1007/s00454-006-1276-5", "10.1111/cgf.12596", "10.1007/s00454-002-2885-2", "10.1109/tvcg.2015.2452919", "10.1016/j.neucom.2006.11.018", "10.21105/joss.00726", "10.1109/tvcg.2007.70603", "10.1109/tvcg.2014.2346449", "10.1109/tvcg.2010.213", "10.1109/tvcg.2006.186", "10.1080/10618600.2012.657132", "10.1111/j.1467-8659.2009.01706.x", "10.1109/tvcg.2012.120", "10.1109/tvcg.2011.249", "10.1109/ldav.2016.7874305", "10.1109/tvcg.2017.2743980", "10.1109/pacificvis.2010.5429601", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2010.253", "10.1002/qua.26133", "10.1109/tvcg.2011.220", "10.1007/s10107-006-0077-1", "10.1145/1377676.1377719", "10.1111/cgf.12933", "10.1109/tvcg.2016.2598495", "10.1126/science.290.5500.2319", "10.1111/cgf.12361", "10.1016/j.neucom.2004.11.042", "10.1109/vast.2010.5652940", "10.1109/ldav48142.2019.8944365", "10.1016/j.patrec.2017.09.032", "10.1145/77635.77639", "10.1109/tvcg.2015.2489660", "10.1111/cgf.12640", "10.1126/science.290.5500.2323", "10.1111/j.1365-2966.2011.18394.x", "10.1109/tvcg.2014.2346403", "10.1090/s0273-0979-09-01249-x", "10.1111/cgf.12655", "10.1109/tvcg.2018.2846735", "10.1145/2535927", "10.1137/060654797", "10.1145/235815.235821"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13983", "year": "2020", "title": "Fiber Surfaces for many Variables", "conferenceName": "EuroVis", "authors": "Christian Blecha;Felix Raith;A. J. Pr{\\\"{a}}ger;Thomas Nagel;Olaf Kolditz;Jobst Ma{\\ss}mann;Niklas R{\\\"{o}}ber;Michael B{\\\"{o}}ttinger;Gerik Scheuermann", "citationCount": "0", "affiliation": "Blecha, C (Corresponding Author), Univ Leipzig, Inst Comp Sci, Leipzig, Germany.\nBlecha, C.; Raith, F.; Praeger, A. J.; Scheuermann, G., Univ Leipzig, Inst Comp Sci, Leipzig, Germany.\nNagel, T., Tech Univ Bergakad Freiberg, Geotech Inst, Chair Soil Mech \\& Fdn Engn, Freiberg, Germany.\nKolditz, O., Helmholtz Ctr Environm Res, Dept Environm Informat, Leipzig, Germany.\nMassmann, J., Fed Inst Geosci \\& Nat Resources BGR, Hannover, NH, Germany.\nRoeber, N.; Boettinger, M., Deutsch Klimarechenzentrum, Hamburg, Germany.", "countries": "Germany", "abstract": "Scientific visualization deals with increasingly complex data consisting of multiple fields. Typical disciplines generating multivariate data are fluid dynamics, structural mechanics, geology, bioengineering, and climate research. Quite often, scientists are interested in the relation between some of these variables. A popular visualization technique for a single scalar field is the extraction and rendering of isosurfaces. With this technique, the domain can be split into two parts, i.e. a volume with higher values and one with lower values than the selected isovalue. Fiber surfaces generalize this concept to two or three scalar variables up to now. This article extends the notion further to potentially any finite number of scalar fields. We generalize the fiber surface extraction algorithm of Raith et al. {[}RBN{*} 19] from 3 to d dimensions and demonstrate the technique using two examples from geology and climate research. The first application concerns a generic model of a nuclear waste repository and the second one an atmospheric simulation over central Europe. Both require complex simulations which involve multiple physical processes. In both cases, the new extended fiber surfaces helps us finding regions of interest like the nuclear waste repository or the power supply of a storm due to their characteristic properties.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13983", "refList": ["10.1109/tvcg.2007.70615", "10.1007/s12665-012-1546-x", "10.1007/s11242-019-01310-1", "10.2312/conf/eg2013/stars/095-116", "10.1109/tvcg.2016.2599040", "10.1111/j.1467-8659.2011.01959.x", "10.1002/qj.2947", "10.1109/tvcg.2015.2467433", "10.1109/tvcg.2018.2864846", "10.1111/cgf.12636", "10.1109/cmv.2007.20", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2016.2570215", "10.1109/tvcg.2018.2867488", "10.1109/pacificvis.2017.8031588", "10.1111/cgf.12646", "10.1109/tvcg.2016.2599017", "10.1109/pacificvis.2019.00030", "10.1109/tvcg.2006.165", "10.1111/j.1467-8659.2009.01429.x", "10.1109/tvcg.2010.64", "10.1145/1377676.1377720", "10.1016/j.jrmge.2017.05.007", "10.18240/ijo.2016.07.04", "10.1186/s40645-019-0304-z", "10.1016/j.parco.2015.10.016", "10.1109/tvcg.2015.2466992", "10.1109/tvcg.2016.2598866"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.14037", "year": "2020", "title": "State of the Art in Time-Dependent Flow Topology: Interpreting Physical Meaningfulness Through Mathematical Properties", "conferenceName": "EuroVis", "authors": "Roxana Bujack;Lin Yan;Ingrid Hotz;Christoph Garth;Bei Wang", "citationCount": "0", "affiliation": "Bujack, R (Corresponding Author), Los Alamos Natl Lab, Los Alamos, NM 87545 USA.\nBujack, Roxana, Los Alamos Natl Lab, Los Alamos, NM 87545 USA.\nYan, Lin; Wang, Bei, Univ Utah, Sci Comp \\& Imaging Inst, Salt Lake City, UT 84112 USA.\nHotz, Ingrid, Linkopings Univ, Sci Visualizat Grp, Linkoping, Sweden.\nGarth, Christoph, Univ Kaiserslautern, Kaiserslautern, Germany.", "countries": "Sweden;Germany;USA", "abstract": "We present a state-of-the-art report on time-dependent flow topology. We survey representative papers in visualization and provide a taxonomy of existing approaches that generalize flow topology from time-independent to time-dependent settings. The approaches are classified based upon four categories: tracking of steady topology, reference frame adaption, pathline classification or clustering, and generalization of critical points. Our unique contributions include introducing a set of desirable mathematical properties to interpret physical meaningfulness for time-dependent flow visualization, inferring mathematical properties associated with selective research papers, and utilizing such properties for classification. The five most important properties identified in the existing literature include coincidence with the steady case, induction of a partition within the domain, Lagrangian invariance, objectivity, and Galilean invariance.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14037", "refList": ["10.2514/6.1995-1715", "10.1111/cgf.12100", "10.1007/978-3-540-70823-0\\_1", "10.1111/cgf.12885", "10.1063/1.857730", "10.1109/tvcg.2019.2934312", "10.1109/tvcg.2013.92", "10.1063/1.166399", "10.1109/tvcg.2005.68.3", "10.1063/1.4971788", "10.1111/cgf.12933", "10.1145/3072959.3073684", "10.1063/1.4982720", "10.1109/tvcg.2018.2864432", "10.1017/s0022112004002526", "10.1109/tvcg.2010.93", "10.1109/pacificvis.2016.7465253", "10.1109/tvcg.2018.2864505", "10.1063/1.858828", "10.1109/tvcg.2019.2934255", "10.5194/npg-9-237-2002", "10.1063/1.4800210", "10.1007/978-3-540-88606-8\\_12", "10.1111/j.1467-8659.2011.01942.x", "10.1109/2945.928168", "10.1007/978-3-662-10388-31", "10.1016/j.physd.2013.01.013", "10.1111/cgf.12358", "10.1017/s002211209900720x", "10.1017/s0022112097008057", "10.1111/j.1467-8659.2009.01546.x", "10.1109/2.35197", "10.1111/j.1467-8659.2012.03089.x", "10.1111/cgf.13319", "10.1109/tvcg.2019.2934375.3", "10.1016/j.crme.2015.08.002.4", "10.1016/s0167-2789(00)00142-1", "10.1111/cgf.12359", "10.1103/physreve.93.063107", "10.1016/j.physd.2009.05.005", "10.1063/1.1477449", "10.1111/j.1467-8659.2009.01686.x", "10.1109/pacificvis.2011.5742374", "10.1017/jfm.2013.391", "10.1111/cgf.12121", "10.1186/1743-422x-3-15", "10.1063/1.3502450", "10.1063/1.868323", "10.1016/j.cnsns.2013.05.002", "10.1109/visual.2004.99", "10.1109/visual.2004.107", "10.1111/j.1467-8659.2009.01604.x", "10.1146/annurev-fluid-010313-141322", "10.1063/1.3690153", "10.1109/tvcg.2019.2934375", "10.1109/tvcg.2013.143", "10.1137/130940633", "10.1016/j.cag.2014.01.007", "10.1016/s0097-8493(02)00056-0", "10.1109/vl.1996.545307", "10.1109/tvcg.2011.284", "10.1109/tvcg.2011.265", "10.1017/jfm.2016.792", "10.1109/tvcg.2013.208", "10.1007/s12650-016-0348-8", "10.1023/b:elas.0000005548.36767.e7", "10.1007/978-1-4939-0419-8\\_\\_9", "10.1007/bf00849110", "10.1615/int.j.uncertaintyquantification.2012003956", "10.1017/s0022112096001802", "10.1017/s0962492902000065", "10.1109/pacificvis.2019.00041", "10.1111/j.1467-8659.2011.01901.x", "10.1109/tvcg.2008.33", "10.1016/j.physd.2005.10.007", "10.1016/s0894-1777(96)00090-8", "10.1145/2517327.2442526", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2018.2816059", "10.1109/tvcg.2019.2934242", "10.2514/6.1995-1715.4", "10.1111/cgf.12109", "10.1109/tvcg.2011.269", "10.1109/visual.1990.146359", "10.1111/j.1467-8659.2003.00723.x", "10.5194/npg-18-977-2011", "10.1109/visual.1998.745296", "10.1109/tvcg.2007.70557", "10.1109/tvcg.2014.2312012"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13982", "year": "2020", "title": "Extraction of Distinguished Hyperbolic Trajectories for 2D Time-Dependent Vector Field Topology", "conferenceName": "EuroVis", "authors": "Lutz Hofmann;Filip Sadlo", "citationCount": "0", "affiliation": "Hofmann, L (Corresponding Author), Heidelberg Univ, Heidelberg, Germany.\nHofmann, Lutz; Sadlo, Filip, Heidelberg Univ, Heidelberg, Germany.", "countries": "Germany", "abstract": "This paper does two main contributions to 2D time-dependent vector field topology. First, we present a technique for robust, accurate, and efficient extraction of distinguished hyperbolic trajectories (DHT), the generative structures of 2D time-dependent vector field topology. It is based on refinement of initial candidate curves. In contrast to previous approaches, it is robust because the refinement converges for reasonably close initial candidates, it is accurate due to its adaptive scheme, and it is efficient due to its high convergence speed. Second, we provide a detailed evaluation and discussion of previous approaches for the extraction of DHTs and time-dependent vector field topology in general. We demonstrate the utility of our approach using analytical flows, as well as data from computational fluid dynamics.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13982", "refList": ["10.1063/1.3579597", "10.1109/2.35197", "10.1111/j.1467-8659.2012.03063.x", "10.1007/978-3-540-70823-0\\_2", "10.1111/cgf.12885", "10.5194/npg-11-17-2004", "10.1016/j.physd.2005.10.007", "10.1109/visual.1998.745297", "10.1109/tvcg.2018.2868760", "10.1109/tvcg.2007.70551", "10.1109/tvcg.2017.2743938", "10.1109/visual.1999.809896", "10.1109/tvcg.2007.70554", "10.1109/tvcg.2015.2467200", "10.1016/j.physd.2009.05.005", "10.1007/978-3-540-88606-8\\_2", "10.1109/tvcg.2012.131", "10.1007/978-3-540-88606-8\\_1", "10.1145/3072959.3073684", "10.1142/s0218127403007321", "10.1016/s0167-2789(00)00199-8", "10.1063/1.166479", "10.1007/s003329900057", "10.1109/tvcg.2010.198", "10.1109/visual.2004.99", "10.1109/visual.2003.1250376", "10.1109/tvcg.2007.70545", "10.5194/npg-9-237-2002", "10.5194/npg-17-1-2010", "10.1109/tvcg.2007.70557", "10.1109/tvcg.2019.2934375"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13985", "year": "2020", "title": "Fuzzy Contour Trees: Alignment and Joint Layout of Multiple Contour Trees", "conferenceName": "EuroVis", "authors": "Anna Pia Lohfink;Florian Wetzels;Jonas Lukasczyk;Gunther H. Weber;Christoph Garth", "citationCount": "0", "affiliation": "Lohfink, AP (Corresponding Author), Tech Univ Kaiserslautern, Kaiserslautern, Germany.\nLohfink, Anna-Pia; Wetzels, Florian; Garth, Christoph, Tech Univ Kaiserslautern, Kaiserslautern, Germany.\nLukasczyk, Jonas, Arizona State Univ, Tempe, AZ 85287 USA.\nWeber, Gunther H., Lawrence Berkeley Natl Lab, Davis, CA USA.\nWeber, Gunther H., Univ Calif Davis, Davis, CA 95616 USA.", "countries": "Germany;USA", "abstract": "We describe a novel technique for the simultaneous visualization of multiple scalar fields, e.g. representing the members of an ensemble, based on their contour trees. Using tree alignments, a graph-theoretic concept similar to edit distance mappings, we identify commonalities across multiple contour trees and leverage these to obtain a layout that can represent all trees simultaneously in an easy-to-interpret, minimally-cluttered manner. We describe a heuristic algorithm to compute tree alignments for a given similarity metric, and give an algorithm to compute a joint layout of the resulting aligned contour trees. We apply our approach to the visualization of scalar field ensembles, discuss basic visualization and interaction possibilities, and demonstrate results on several analytic and real-world examples.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13985", "refList": ["10.4230/lipics.socg.2017.25", "10.1109/tvcg.2016.2598919", "10.1109/tvcg.2013.269", "10.1109/pacificvis.2016.7465251", "10.1145/322139.322143", "10.1109/visual.2004.96", "10.1109/tvcg.2011.185", "10.1007/s00454-012-9465-x", "10.1016/s0925-7721(02)00093-7", "10.1109/tvcg.2018.2853721", "10.1111/cgf.12359", "10.1109/tvcg.2011.236", "10.1111/cgf.12360", "10.1109/tvcg.2017.2743938", "10.1007/b106657\\_2", "10.1109/tvcg.2019.2948616", "10.1007/978-3-319-04099-8\\_10", "10.2312/3dor.20161084", "10.1109/ldav.2015.7348089", "10.1111/cgf.12933", "10.1109/tvcg.2019.2934242", "10.1109/tvcg.2010.270", "10.1109/tvcg.2009.69", "10.1109/tvcg.2018.2873612", "10.1109/tvcg.2018.2864432", "10.4028/www.scientific.net/amm.869.9", "10.1109/tvcg.2007.47", "10.1007/s00454-016-9763-9", "10.1016/s0925-7721(02)00132-3", "10.1109/sc.2014.40", "10.1615/int.j.uncertaintyquantification.2012003956", "10.1145/2582112.2582169", "10.1057/palgrave.ivs.9500157", "10.1109/tvcg.2008.143", "10.1111/cgf.13164", "10.1089/cmb.1994.1.337", "10.1016/j.tcs.2004.12.030", "10.1145/322290.322295", "10.1007/978-3-319-63962-8\\_324-1"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13984", "year": "2020", "title": "Visual Analysis of the Finite-Time Lyapunov Exponent", "conferenceName": "EuroVis", "authors": "Antoni Sagrist{\\`{a}};Stefan Jordan;Filip Sadlo", "citationCount": "0", "affiliation": "Sagrista, A (Corresponding Author), Heidelberg Univ, Heidelberg, Germany.\nSagrista, Antoni; Jordan, Stefan; Sadlo, Filip, Heidelberg Univ, Heidelberg, Germany.", "countries": "Germany", "abstract": "In this paper, we present an integrated visual analytics approach to support the parametrization and exploration of flow visualization based on the finite-time Lyapunov exponent. Such visualization of time-dependent flow faces various challenges, including the choice of appropriate advection times, temporal regions of interest, and spatial resolution. Our approach eases these challenges by providing the user with context by means of parametric aggregations, with support and guidance for a more directed exploration, and with a set of derived measures for better qualitative assessment. We demonstrate the utility of our approach with examples from computation fluid dynamics and time-dependent dynamical systems.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13984", "refList": ["10.1145/37402.37422", "10.1109/38.79452", "10.1016/j.parco.2011.09.001", "10.1016/j.physd.2005.10.007", "10.1109/2.35197", "10.1109/tvcg.2007.70551", "10.1016/s0167-2789(00)00199-8", "10.1109/tvcg.2016.2599018", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2015.2467449", "10.2307/2003354", "10.1109/tvcg.2007.70554", "10.1090/s0002-9904-1967-11798-1", "10.1109/visual.2005.1532788", "10.1017/s0022112004009929", "10.1111/j.1467-8659.2011.01901.x", "10.1111/cgf.13439", "10.1111/cgf.12933"], "wos": 1, "children": [], "len": 1}], "len": 17}, "index": 636, "embedding": [5.900523662567139, 0.7397398948669434, -0.3391150236129761, 5.049367904663086, 2.2446043491363525, 0.16650904715061188, -0.7182635068893433, 3.304448366165161, 2.609703540802002, 2.019462823867798, 4.046046733856201, 2.7878451347351074, 1.667433500289917, 2.0518689155578613, -0.7106465697288513, 0.06702279299497604, 1.4152922630310059, 0.07991757988929749, 0.47060978412628174, 4.186389923095703, -0.06630208343267441, -0.6180840134620667, 1.0398132801055908, 0.9222736358642578, -0.7634287476539612, 0.41718488931655884, -0.5399249196052551, -0.17674389481544495, 3.5133705139160156, -1.0919010639190674, 1.8779301643371582, 0.9736238121986389], "projection": [-0.9568525552749634, 6.5822858810424805], "size": 9, "height": 2, "width": 8}