{"data": {"doi": "10.1109/tvcg.2017.2744099", "title": "Uncertainty Visualization Using Copula-Based Analysis in Mixed Distribution Models", "year": "2017", "conferenceName": "SciVis", "authors": "Subhashis Hazarika;Ayan Biswas;Han-Wei Shen", "citationCount": "6", "affiliation": "Hazarika, S (Corresponding Author), Ohio State Univ, Dept Comp Sci \\& Engn, GRAVITY Res Grp, Columbus, OH 43210 USA. Hazarika, Subhashis; Shen, Han-Wei, Ohio State Univ, Dept Comp Sci \\& Engn, GRAVITY Res Grp, Columbus, OH 43210 USA. Biswas, Ayan, Los Alamos Natl Lab, Los Alamos, NM USA.", "countries": "USA", "abstract": "Distributions are often used to model uncertainty in many scientific datasets. To preserve the correlation among the spatially sampled grid locations in the dataset, various standard multivariate distribution models have been proposed in visualization literature. These models treat each grid location as a univariate random variable which models the uncertainty at that location. Standard multivariate distributions (both parametric and nonparametric) assume that all the univariate marginals are of the same type/family of distribution. But in reality, different grid locations show different statistical behavior which may not be modeled best by the same type of distribution. In this paper, we propose a new multivariate uncertainty modeling strategy to address the needs of uncertainty modeling in scientific datasets. Our proposed method is based on a statistically sound multivariate technique called Copula, which makes it possible to separate the process of estimating the univariate marginals and the process of modeling dependency, unlike the standard multivariate distributions. The modeling flexibility offered by our proposed method makes it possible to design distribution fields which can have different types of distribution (Gaussian, Histogram, KDE etc.) at the grid locations, while maintaining the correlation structure at the same time. Depending on the results of various standard statistical tests, we can choose an optimal distribution representation at each location, resulting in a more cost efficient modeling without significantly sacrificing on the analysis quality. To demonstrate the efficacy of our proposed modeling strategy, we extract and visualize uncertain features like isocontours and vortices in various real world datasets. We also study various modeling criterion to help users in the task of univariate model selection.", "keywords": "Uncertainty visualization,probability distribution,probabilistic feature,statistical modeling,copula", "link": "http://dx.doi.org/10.1109/TVCG.2017.2744099", "refList": ["10.1093/biomet/52.3-4.591", "10.1109/tvcg.2013.143", "10.1080/13504860210136721a", "10.1111/cgf.12100", "10.1016/j.cag.2014.01.007", "10.1109/ldav.2011.6092313", "10.1007/s003710050111", "10.1109/tvcg.2010.247", "10.2307/2286009", "10.1109/tvcg.2015.2467958", "10.1111/j.1467-8659.2011.01944.x", "10.1109/tvcg.2015.2507569", "10.1007/978-1-4471-2804-5\\_6", "10.1111/cgf.12912", "10.1007/bf00053369", "10.1002/sta4.39", "10.1109/mcg.2004.20", "10.1109/mcg.2003.1231171", "10.1109/tvcg.2016.2598604", "10.1109/tvcg.2013.208", "10.1145/2020408.2020509", "10.5812/ijem.3505", "10.1111/j.1467-8659.2012.03097.x", "10.1111/j.1467-8659.2009.01604.x", "10.1109/icdmw.2011.135", "10.1109/mcg.2012.87", "10.1109/mcg.2005.71", "10.1515/bile-2015-0008", "10.1016/b978-044450896-6.50010-8", "10.1111/j.1467-8659.2011.01942.x", "10.1109/ldav.2012.6378978", "10.1007/978-3-642-35407-6\\_3", "10.1109/tvcg.2012.249", "10.2312/localchapterevents/tpcg/tpcg08/059-065", "10.1109/tvcg.2015.2467436", "10.1111/j.1467-8659.2012.03096.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2018.2864505", "title": "Probabilistic Asymptotic Decider for Topological Ambiguity Resolution in Level-Set Extraction for Uncertain 2D Data", "year": "2018", "conferenceName": "SciVis", "authors": "Tushar M. Athawale;Christopher R. Johnson", "citationCount": "3", "affiliation": "Athawale, T (Corresponding Author), Univ Utah, Sci Comp \\& Imaging SCI Inst, Salt Lake City, UT 84112 USA. Athawale, Tushar; Johnson, Chris R., Univ Utah, Sci Comp \\& Imaging SCI Inst, Salt Lake City, UT 84112 USA.", "countries": "USA", "abstract": "We present a framework for the analysis of uncertainty in isocontour extraction. The marching squares (MS) algorithm for isocontour reconstruction generates a linear topology that is consistent with hyperbolic curves of a piecewise bilinear interpolation. The saddle points of the bilinear interpolant cause topological ambiguity in isocontour extraction. The midpoint decider and the asymptotic decider are well-known mathematical techniques for resolving topological ambiguities. The latter technique investigates the data values at the cell saddle points for ambiguity resolution. The uncertainty in data, however, leads to uncertainty in underlying bilinear interpolation functions for the MS algorithm, and hence, their saddle points. In our work, we study the behavior of the asymptotic decider when data at grid vertices is uncertain. First, we derive closed-form distributions characterizing variations in the saddle point values for uncertain bilinear interpolants. The derivation assumes uniform and nonparametric noise models, and it exploits the concept of ratio distribution for analytic formulations. Next, the probabilistic asymptotic decider is devised for ambiguity resolution in uncertain data using distributions of the saddle point values derived in the first step. Finally, the confidence in probabilistic topological decisions is visualized using a colormapping technique. We demonstrate the higher accuracy and stability of the probabilistic asymptotic decider in uncertain data with regard to existing decision frameworks, such as deciders in the mean field and the probabilistic midpoint decider, through the isocontour visualization of synthetic and real datasets.", "keywords": "Isocontour visualization,topological uncertainty,marching squares,asymptotic decider,bilinear interpolation,probabilistic computation", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864505", "refList": ["10.1175/bams-85-6-853", "10.1198/jasa.2009.0108", "10.1016/s0097-8493(02)00055-9", "10.1007/bf01900699", "10.1109/tvcg.2013.143", "10.1111/cgf.12100", "10.1109/iv.2002.1028780", "10.1109/tvcg.2010.247", "10.1109/tvcg.2015.2467958", "10.1007/978-1-4471-2804-5\\_6", "10.1016/s0925-7721(02)00093-7", "10.1111/cgf.12359", "10.1002/sta4.39", "10.1007/978-1-4471-6497-5\\_1", "10.1109/mcg.2004.20", "10.1109/mcg.2003.1231171", "10.1109/tvcg.2011.203", "10.1109/tvcg.2013.208", "10.1109/visual.2002.1183769", "10.1109/tvcg.2007.70518", "10.1109/visual.1991.175782", "10.1615/int.j.uncertaintyquantification.2012004074", "10.2307/2291420", "10.2312/egs.20031054", "10.1145/37402.37422", "10.1111/j.1467-8659.2009.01604.x", "10.1615/int.j.uncertaintyquantification.2012003956", "10.1063/1.3490510", "10.1111/j.1467-8659.2011.01942.x", "10.1109/tvcg.2017.2744099", "10.1109/ldav.2012.6378978", "10.1016/s0021-9991(03)00298-5", "10.1109/tvcg.2016.2637333", "10.1145/2820783.2820823", "10.1016/b978-008044531-1/50435-8", "10.1109/tvcg.2004.30"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030377", "title": "Uncertainty-Oriented Ensemble Data Visualization and Exploration using Variable Spatial Spreading", "year": "2020", "conferenceName": "SciVis", "authors": "Mingdong Zhang;Li Chen;Quan Li;Xiaoru Yuan;Junhai Yong", "citationCount": "0", "affiliation": "Chen, L (Corresponding Author), Tsinghua Univ, BNRist, Sch Software, Beijing, Peoples R China. Zhang, Mingdong; Chen, Li; Yong, Junhai, Tsinghua Univ, BNRist, Sch Software, Beijing, Peoples R China. Li, Quan, WeBank, AI Grp, Shenzhen, Guangdong, Peoples R China. Yuan, Xiaoru, Peking Univ, Minist Educ, Key Lab Machine Percept, Beijing, Peoples R China. Yuan, Xiaoru, Peking Univ, Natl Engn Lab Big Data Anal \\& Applicat, Beijing, Peoples R China.", "countries": "China", "abstract": "As an important method of handling potential uncertainties in numerical simulations, ensemble simulation has been widely applied in many disciplines. Visualization is a promising and powerful ensemble simulation analysis method. However, conventional visualization methods mainly aim at data simplification and highlighting important information based on domain expertise instead of providing a flexible data exploration and intervention mechanism. Trial-and-error procedures have to be repeatedly conducted by such approaches. To resolve this issue, we propose a new perspective of ensemble data analysis using the attribute variable dimension as the primary analysis dimension. Particularly, we propose a variable uncertainty calculation method based on variable spatial spreading. Based on this method, we design an interactive ensemble analysis framework that provides a flexible interactive exploration of the ensemble data. Particularly, the proposed spreading curve view, the region stability heat map view, and the temporal analysis view, together with the commonly used 2D map view, jointly support uncertainty distribution perception, region selection, and temporal analysis, as well as other analysis requirements. We verify our approach by analyzing a real-world ensemble simulation dataset. Feedback collected from domain experts confirms the efficacy of our framework.", "keywords": "Uncertainty visualization,ensemble visualization,spatial spreading,temporal analysis", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030377", "refList": ["10.1198/jasa.2009.0108", "10.1016/s0097-8493(02)00055-9", "10.1109/tvcg.2013.143", "10.1111/cgf.12100", "10.1109/ldav.2011.6092313", "10.1109/38.920623", "10.1007/s003710050111", "10.1109/tvcg.2020.3022359", "10.1109/tvcg.2013.90", "10.1111/j.2517-6161.1977.tb01600.x", "10.1109/tvcg.2010.247", "10.1109/ldav", "10.1111/j.1467-8659.2011.01944.x", "10.1109/tvcg.2013.92", "10.1007/978-1-4471-2804-5\\_6", "10.1111/j.1467-8659.2008.01189.x", "10.1109/tvcg.2014.2346455", "10.1007/978-3-319-14249-4\\_30", "10.1111/cgf.12636", "10.1117/12.643631", "10.1109/mcg.2005.60", "10.1117/12.535534", "10.1016/j.dynatmoce.2013.03.002", "10.1002/sta4.39", "10.1615/int.j.uncertaintyquantification.2015011789", "10.1109/mcg.2004.20", "10.1109/mcg.2003.1231171", "10.1109/icit.2003.1290301", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2017.2776935", "10.1109/tvcg.2013.208", "10.1214/aoms/1177704472", "10.1109/tvcg.2018.2864432", "10.1007/978-1-4471-2804-56", "10.1109/tvcg.2007.70518", "10.1109/tvcg.2012.227", "10.1111/j.1467-8659.2009.01685.x", "10.1109/tvcg.2018.2864505", "10.1109/visual.1997.663848", "10.1016/s0168-9002(98)01347-3", "10.1111/j.1467-8659.2009.01604.x", "10.1109/mcg.2012.87", "10.1109/tvcg.2018.2879866", "10.1109/tvcg.2016.2637333", "10.1214/aoms/1177728190"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.14037", "year": "2020", "title": "State of the Art in Time-Dependent Flow Topology: Interpreting Physical Meaningfulness Through Mathematical Properties", "conferenceName": "EuroVis", "authors": "Roxana Bujack;Lin Yan;Ingrid Hotz;Christoph Garth;Bei Wang", "citationCount": "0", "affiliation": "Bujack, R (Corresponding Author), Los Alamos Natl Lab, Los Alamos, NM 87545 USA.\nBujack, Roxana, Los Alamos Natl Lab, Los Alamos, NM 87545 USA.\nYan, Lin; Wang, Bei, Univ Utah, Sci Comp \\& Imaging Inst, Salt Lake City, UT 84112 USA.\nHotz, Ingrid, Linkopings Univ, Sci Visualizat Grp, Linkoping, Sweden.\nGarth, Christoph, Univ Kaiserslautern, Kaiserslautern, Germany.", "countries": "Sweden;Germany;USA", "abstract": "We present a state-of-the-art report on time-dependent flow topology. We survey representative papers in visualization and provide a taxonomy of existing approaches that generalize flow topology from time-independent to time-dependent settings. The approaches are classified based upon four categories: tracking of steady topology, reference frame adaption, pathline classification or clustering, and generalization of critical points. Our unique contributions include introducing a set of desirable mathematical properties to interpret physical meaningfulness for time-dependent flow visualization, inferring mathematical properties associated with selective research papers, and utilizing such properties for classification. The five most important properties identified in the existing literature include coincidence with the steady case, induction of a partition within the domain, Lagrangian invariance, objectivity, and Galilean invariance.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14037", "refList": ["10.2514/6.1995-1715", "10.1111/cgf.12100", "10.1007/978-3-540-70823-0\\_1", "10.1111/cgf.12885", "10.1063/1.857730", "10.1109/tvcg.2019.2934312", "10.1109/tvcg.2013.92", "10.1063/1.166399", "10.1109/tvcg.2005.68.3", "10.1063/1.4971788", "10.1111/cgf.12933", "10.1145/3072959.3073684", "10.1063/1.4982720", "10.1109/tvcg.2018.2864432", "10.1017/s0022112004002526", "10.1109/tvcg.2010.93", "10.1109/pacificvis.2016.7465253", "10.1109/tvcg.2018.2864505", "10.1063/1.858828", "10.1109/tvcg.2019.2934255", "10.5194/npg-9-237-2002", "10.1063/1.4800210", "10.1007/978-3-540-88606-8\\_12", "10.1111/j.1467-8659.2011.01942.x", "10.1109/2945.928168", "10.1007/978-3-662-10388-31", "10.1016/j.physd.2013.01.013", "10.1111/cgf.12358", "10.1017/s002211209900720x", "10.1017/s0022112097008057", "10.1111/j.1467-8659.2009.01546.x", "10.1109/2.35197", "10.1111/j.1467-8659.2012.03089.x", "10.1111/cgf.13319", "10.1109/tvcg.2019.2934375.3", "10.1016/j.crme.2015.08.002.4", "10.1016/s0167-2789(00)00142-1", "10.1111/cgf.12359", "10.1103/physreve.93.063107", "10.1016/j.physd.2009.05.005", "10.1063/1.1477449", "10.1111/j.1467-8659.2009.01686.x", "10.1109/pacificvis.2011.5742374", "10.1017/jfm.2013.391", "10.1111/cgf.12121", "10.1186/1743-422x-3-15", "10.1063/1.3502450", "10.1063/1.868323", "10.1016/j.cnsns.2013.05.002", "10.1109/visual.2004.99", "10.1109/visual.2004.107", "10.1111/j.1467-8659.2009.01604.x", "10.1146/annurev-fluid-010313-141322", "10.1063/1.3690153", "10.1109/tvcg.2019.2934375", "10.1109/tvcg.2013.143", "10.1137/130940633", "10.1016/j.cag.2014.01.007", "10.1016/s0097-8493(02)00056-0", "10.1109/vl.1996.545307", "10.1109/tvcg.2011.284", "10.1109/tvcg.2011.265", "10.1017/jfm.2016.792", "10.1109/tvcg.2013.208", "10.1007/s12650-016-0348-8", "10.1023/b:elas.0000005548.36767.e7", "10.1007/978-1-4939-0419-8\\_\\_9", "10.1007/bf00849110", "10.1615/int.j.uncertaintyquantification.2012003956", "10.1017/s0022112096001802", "10.1017/s0962492902000065", "10.1109/pacificvis.2019.00041", "10.1111/j.1467-8659.2011.01901.x", "10.1109/tvcg.2008.33", "10.1016/j.physd.2005.10.007", "10.1016/s0894-1777(96)00090-8", "10.1145/2517327.2442526", "10.1109/tvcg.2017.2743938", "10.1109/tvcg.2018.2816059", "10.1109/tvcg.2019.2934242", "10.2514/6.1995-1715.4", "10.1111/cgf.12109", "10.1109/tvcg.2011.269", "10.1109/visual.1990.146359", "10.1111/j.1467-8659.2003.00723.x", "10.5194/npg-18-977-2011", "10.1109/visual.1998.745296", "10.1109/tvcg.2007.70557", "10.1109/tvcg.2014.2312012"], "wos": 1, "children": [], "len": 1}], "len": 5}, {"doi": "10.1109/tvcg.2018.2864801", "title": "CoDDA: A Flexible Copula-based Distribution Driven Analysis Framework for Large-Scale Multivariate Data", "year": "2018", "conferenceName": "SciVis", "authors": "Subhashis Hazarika;Soumya Dutta;Han-Wei Shen;Jen-Ping Chen", "citationCount": "3", "affiliation": "Hazarika, S (Corresponding Author), Ohio State Univ, GRAVITY Res Grp, Dept Comp Sci \\& Engn, Columbus, OH 43210 USA. Hazarika, Subhashis; Dutta, Soumya; Shen, Han-Wei, Ohio State Univ, GRAVITY Res Grp, Dept Comp Sci \\& Engn, Columbus, OH 43210 USA. Chen, Jen-Ping, Ohio State Univ, Dept Mech \\& Aerosp Engn, Columbus, OH 43210 USA.", "countries": "USA", "abstract": "CoDDA (Copula-based Distribution Driven Analysis) is a flexible framework for large-scale multivariate datasets. A common strategy to deal with large-scale scientific simulation data is to partition the simulation domain and create statistical data summaries. Instead of storing the high-resolution raw data from the simulation, storing the compact statistical data summaries results in reduced storage overhead and alleviated I/O bottleneck. Such summaries, often represented in the form of statistical probability distributions, can serve various post-hoc analysis and visualization tasks. However, for multivariate simulation data using standard multivariate distributions for creating data summaries is not feasible. They are either storage inefficient or are computationally expensive to be estimated in simulation time (in situ) for large number of variables. In this work, using copula functions, we propose a flexible multivariate distribution-based data modeling and analysis framework that offers significant data reduction and can be used in an in situ environment. The framework also facilitates in storing the associated spatial information along with the multivariate distributions in an efficient representation. Using the proposed multivariate data summaries, we perform various multivariate post-hoc analyses like query-driven visualization and sampling-based visualization. We evaluate our proposed method on multiple real-world multivariate scientific datasets. To demonstrate the efficacy of our framework in an in situ environment, we apply it on a large-scale flow simulation.", "keywords": "In situ processing,Distribution-based,Multivariate,Query-driven,Copula", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864801", "refList": ["10.1109/tvcg.2007.70615", "10.1109/tvcg.2015.2467204", "10.1080/13504860210136721a", "10.1111/cgf.12100", "10.1109/ldav.2011.6092313", "10.1109/tvcg.2015.2467411", "10.1109/iv.2002.1028780", "10.1109/tvcg.2010.247", "10.2312/egpgv/egpgv11/101-109", "10.1111/j.1467-8659.2009.01677.x", "10.1109/tvcg.2015.2467958", "10.1111/j.1467-8659.2011.01944.x", "10.1109/pacificvis.2017.8031585", "10.1111/j.1467-8659.2011.01964.x", "10.1109/tvcg.2010.80", "10.1109/tvcg.2016.2598604", "10.1109/mcg.2010.55", "10.1109/pacificvis.2014.60", "10.1109/tvcg.2006.165", "10.1109/ldav.2011.6092322", "10.1109/tpami.2014.2307886", "10.2307/2684359", "10.1145/2020408.2020509", "10.1137/15m1016308", "10.1109/ldav.2015.7348071", "10.1109/pacificvis.2017.8031590", "10.1109/sc.2014.40", "10.1109/tvcg.2015.2467952", "10.1109/icdmw.2011.135", "10.1109/pacificvis.2018.00017", "10.1109/vast.2015.7347634", "10.1016/b978-044450896-6.50010-8", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1016/j.insmatheco.2006.11.011", "10.1007/978-3-642-35407-6\\_3", "10.1109/tvcg.2006.100", "10.1109/ldav.2011.6092178", "10.1115/1.2812968", "10.1109/ldav.2014.7013204", "10.1109/ldav.2016.7874311", "10.1109/tvcg.2015.2467436", "10.1111/cgf.12930", "10.1111/j.1467-8659.2012.03096.x", "10.1109/tvcg.2007.70519"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934335", "title": "Void-and-Cluster Sampling of Large Scattered Data and Trajectories", "year": "2019", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "3", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "We propose a data reduction technique for scattered data based on statistical sampling. Our void-and-cluster sampling technique finds a representative subset that is optimally distributed in the spatial domain with respect to the blue noise property. In addition, it can adapt to a given density function, which we use to sample regions of high complexity in the multivariate value domain more densely. Moreover, our sampling technique implicitly defines an ordering on the samples that enables progressive data loading and a continuous level-of-detail representation. We extend our technique to sample time-dependent trajectories, for example pathlines in a time interval, using an efficient and iterative approach. Furthermore, we introduce a local and continuous error measure to quantify how well a set of samples represents the original dataset. We apply this error measure during sampling to guide the number of samples that are taken. Finally, we use this error measure and other quantities to evaluate the quality, performance, and scalability of our algorithm.", "keywords": "Data reduction,sampling,blue noise,entropy-based sampling,scattered data,pathlines", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934335", "refList": ["10.1145/3281464.3281467", "10.1109/ldav.2014.7013206", "10.1137/0903027", "10.1109/ldav.2011.6092313", "10.1111/cgf.13336", "10.1117/12.152707", "10.1109/tvcg.2014.2350479", "10.1109/pacificvis.2017.8031585", "10.1111/j.1467-8659.2011.01964.x", "10.1145/1556262.1556289", "10.1109/iv.2017.20", "10.1109/tvcg.2016.2598604", "10.1109/tvcg.2010.227", "10.1007/s10586-014-0360-5", "10.1109/tvcg.2018.2864801", "10.1145/1531326.1531392", "10.1145/1278780.1278807", "10.1109/tvcg.2010.148", "10.1016/j.jfluidstructs.2013.08.007", "10.1109/tvcg.2016.2620975", "10.1146/annurev.aa.30.090192.002551", "10.1109/pacificvis.2011.5742372", "10.1109/tvcg.2014.2346324", "10.1109/5.3288", "10.1109/pacificvis.2017.8031590", "10.1109/pacificvis.2018.00016", "10.1109/bigdata.2013.6691717"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1109/tvcg.2020.3030473", "title": "Data-Driven Space-Filling Curves", "year": "2020", "conferenceName": "SciVis", "authors": "Liang Zhou;Christopher R. Johnson;Daniel Weiskopf", "citationCount": "0", "affiliation": "Zhou, L (Corresponding Author), Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang, Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang; Johnson, Chris R., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Visualizat Res Ctr VLSUS, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "Abstract-We propose a data-driven space-filling curve method for 2D and 3D visualization. Our flexible curve traverses the data elements in the spatial domain in a way that the resulting linearization better preserves features in space compared to existing methods. We achieve such data coherency by calculating a Hamiltonian path that approximately minimizes an objective function that describes the similarity of data values and location coherency in a neighborhood. Our extended variant even supports multiscale data via quadtrees and octrees. Our method is useful in many areas of visualization including multivariate or comparative visualization ensemble visualization of 2D and 3D data on regular grids or multiscale visual analysis of particle simulations. The effectiveness of our method is evaluated with numerical comparisons to existing techniques and through examples of ensemble and multivariate datasets.", "keywords": "Space-filling curves,comparative visualization,ensemble visualization,multivariate visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030473", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1467-8659.2011.01914.x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.1109/tvcg.2019", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2010.176", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 9}, {"doi": "10.1109/tvcg.2020.3030473", "title": "Data-Driven Space-Filling Curves", "year": "2020", "conferenceName": "SciVis", "authors": "Liang Zhou;Christopher R. Johnson;Daniel Weiskopf", "citationCount": "0", "affiliation": "Zhou, L (Corresponding Author), Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang, Peking Univ, Natl Inst Hlth Data Sci, Beijing, Peoples R China. Zhou, Liang; Johnson, Chris R., Univ Utah, SCI Inst, Salt Lake City, UT 84112 USA. Weiskopf, Daniel, Univ Stuttgart, Visualizat Res Ctr VLSUS, Stuttgart, Germany.", "countries": "USA;Germany;China", "abstract": "Abstract-We propose a data-driven space-filling curve method for 2D and 3D visualization. Our flexible curve traverses the data elements in the spatial domain in a way that the resulting linearization better preserves features in space compared to existing methods. We achieve such data coherency by calculating a Hamiltonian path that approximately minimizes an objective function that describes the similarity of data values and location coherency in a neighborhood. Our extended variant even supports multiscale data via quadtrees and octrees. Our method is useful in many areas of visualization including multivariate or comparative visualization ensemble visualization of 2D and 3D data on regular grids or multiscale visual analysis of particle simulations. The effectiveness of our method is evaluated with numerical comparisons to existing techniques and through examples of ensemble and multivariate datasets.", "keywords": "Space-filling curves,comparative visualization,ensemble visualization,multivariate visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030473", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1467-8659.2011.01914.x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.1109/tvcg.2019", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2010.176", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030379", "title": "Visual Analysis of Large Multivariate Scattered Data using Clustering and Probabilistic Summaries", "year": "2020", "conferenceName": "SciVis", "authors": "Tobias Rapp;Christoph Peters 0002;Carsten Dachsbacher", "citationCount": "0", "affiliation": "Rapp, T (Corresponding Author), Karlsruhe Inst Technol, Karlsruhe, Germany. Rapp, Tobias; Peters, Christoph; Dachsbacher, Carsten, Karlsruhe Inst Technol, Karlsruhe, Germany.", "countries": "Germany", "abstract": "Rapidly growing data sizes of scientific simulations pose significant challenges for interactive visualization and analysis techniques. In this work, we propose a compact probabilistic representation to interactively visualize large scattered datasets. In contrast to previous approaches that represent blocks of volumetric data using probability distributions, we model clusters of arbitrarily structured multivariate data. In detail, we discuss how to efficiently represent and store a high-dimensional distribution for each cluster. We observe that it suffices to consider low-dimensional marginal distributions for two or three data dimensions at a time to employ common visual analysis techniques. Based on this observation, we represent high-dimensional distributions by combinations of low-dimensional Gaussian mixture models. We discuss the application of common interactive visual analysis techniques to this representation. In particular, we investigate several frequency-based views, such as density plots in 1D and 2D, density-based parallel coordinates, and a time histogram. We visualize the uncertainty introduced by the representation, discuss a level-of-detail mechanism, and explicitly visualize outliers. Furthermore, we propose a spatial visualization by splatting anisotropic 3D Gaussians for which we derive a closed-form solution. Lastly, we describe the application of brushing and linking to this clustered representation. Our evaluation on several large, real-world datasets demonstrates the scaling of our approach.", "keywords": "interactive visual analysis,probabilistic data summaries,multivariate data,scattered data,Gaussian mixture models,Gaussian rendering", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030379", "refList": ["10.1109/tvcg.2006.170", "10.1111/j.1365-2966.2009.15715,x", "10.1109/tvcg.2008.119", "10.1109/infvis.2004.68", "10.1109/pacificvis.2011.5742387", "10.1111/j.1365-2966.2009.15715.x", "10.1109/ldav.2011.6092313", "10.1109/pacificvis48177.2020.1186", "10.1111/j.467-8659,2011.01914,x", "10.1109/tvcg.2013.65", "10.1109/mcg.2005.106", "10.1111/j.1467-8659.2006.00978.x", "10.1007/978-1-4842-4427-229", "10.1109/pacificvis.2017.8031585", "10.1016/j.ascom.2015.09.003", "10.1146/annurev-statistics-030718-104938", "10.1111/j.1467-8659.2011.01964.x", "10.1145/3203206", "10.1007/b106657\\_11", "10.1111/cgf.12363", "10.1109/tvcg.2016.2598604", "10.1109/tvcc.2006.170", "10.1214/aos/1176344136", "10.1109/tvcg.2018.2864801", "10.2312/vissym/vissym04/035-044", "10.1007/978-1-4842-4427-2", "10.1109/tvcg.2002.1021579", "10.1109/tvcg.2009.131", "10.1109/pacificvis.2019.00043", "10.1109/tvcci.2016.2637333", "10.1109/tvcg.2014.2346324", "10.1109/visual.2001.964490", "10.1057/palgrave.ivs.9500061", "10.1109/infvis.2005.1532138", "10.1109/pacificvis.2017.8031590", "10.1109/tvcg.2008.131", "10.1109/visual.2003", "10.1109/tvcg.2019.2934335", "10.1109/ldav.2012.6378978", "10.1109/tvcg.2017.2744099", "10.1109/tvcg.2016.2637333", "10.1007/978-1-4471-6497-515"], "wos": 1, "children": [], "len": 1}], "len": 21}, "index": 656, "embedding": [1.3053865432739258, -0.28269457817077637, -0.4931102991104126, -2.350348949432373, 1.7592592239379883, 0.16650904715061188, -0.7643030881881714, -0.9931802153587341, 0.6826035380363464, 0.5393528938293457, 0.4092606008052826, 1.523694634437561, 0.656749427318573, -1.4984636306762695, -0.8806813955307007, -0.5318171381950378, 1.0830618143081665, 0.06589167565107346, 0.6528364419937134, -0.9167535305023193, -0.06630208343267441, -0.6124352812767029, 0.46421125531196594, -0.15392345190048218, -1.7287416458129883, 0.05785536766052246, 1.1659070253372192, 0.4264586865901947, 0.3245898485183716, -2.2501423358917236, 0.5618469715118408, -0.3720399737358093], "projection": [-0.4692296087741852, 3.6171793937683105], "size": 11, "height": 4, "width": 5}