{"data": {"doi": "10.1109/tvcg.2018.2864889", "title": "In Pursuit of Error: A Survey of Uncertainty Visualization Evaluation", "year": "2018", "conferenceName": "InfoVis", "authors": "Jessica Hullman;Xiaoli Qiao;Michael Correll;Alex Kale;Matthew Kay", "citationCount": "10", "affiliation": "Hullman, J (Corresponding Author), Northwestern Univ, Evanston, IL 60208 USA. Hullman, Jessica, Northwestern Univ, Evanston, IL 60208 USA. Qiao, Xiaoli; Kale, Alex, Univ Washington, Seattle, WA 98195 USA. Correll, Michael, Tableau Software, Seattle, WA USA. Kay, Matthew, Univ Michigan, Ann Arbor, MI 48109 USA.", "countries": "USA", "abstract": "Understanding and accounting for uncertainty is critical to effectively reasoning about visualized data. However, evaluating the impact of an uncertainty visualization is complex due to the difficulties that people have interpreting uncertainty and the challenge of defining correct behavior with uncertainty information. Currently, evaluators of uncertainty visualization must rely on general purpose visualization evaluation frameworks which can be ill-equipped to provide guidance with the unique difficulties of assessing judgments under uncertainty. To help evaluators navigate these complexities, we present a taxonomy for characterizing decisions made in designing an evaluation of an uncertainty visualization. Our taxonomy differentiates six levels of decisions that comprise an uncertainty visualization evaluation: the behavioral targets of the study, expected effects from an uncertainty visualization, evaluation goals, measures, elicitation techniques, and analysis approaches. Applying our taxonomy to 86 user studies of uncertainty visualizations, we find that existing evaluation practice, particularly in visualization research, focuses on Performance and Satisfaction-based measures that assume more predictable and statistically-driven judgment behavior than is suggested by research on human judgment and decision making. We reflect on common themes in evaluation practice concerning the interpretation and semantics of uncertainty, the use of confidence reporting, and a bias toward evaluating performance as accuracy rather than decision quality. We conclude with a concrete set of recommendations for evaluators designed to reduce the mismatch between the conceptualization of uncertainty in visualization versus other fields.", "keywords": "Uncertainty visualization,user study,subjective confidence,probability distribution", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864889", "refList": ["10.1145/1520340.1520616", "10.1006/obhd.1997.2679", "10.1037/h0031322", "10.1559/152304003100011180", "10.1007/bf01211526", "10.1371/journal.pmed.0020124", "10.1179/1743277414y.0000000099", "10.1007/s003710050111", "10.1109/tvcg.2013.126", "10.1145/3025453.3025998", "10.2307/1914185", "10.3758/s13423-012-0247-5", "10.1109/tvcg.2009.114", "10.1371/journal.pone.0142444", "10.1518/155534309x474460", "10.1057/ivs.2009.1", "10.1037/xap0000037", "10.1109/tvcg.2013.247", "10.1109/tvcg.2007.70530", "10.2307/1884324", "10.1037/a0025185", "10.1080/15230406.2015.1089792", "10.1109/ivs.2013.6629529", "10.1016/0010-0285(73)90033-9", "10.1117/12.643631", "10.1109/tvcg.2017.2743898", "10.1016/s0098-3004(97)00011-3", "10.1175/waf1020.1", "10.14714/cp13.1000", "10.1111/j.1539-6924.1987.tb00488.x", "10.1080/13658816.2015.1131829", "10.1559/1523040054738936", "10.1007/978-1-4471-6497-5\\_1", "10.1109/mcg.2003.1231171", "10.3138/3645-4v22-0m23-3t52", "10.1007/978-94-010-1834-0\\_8", "10.1002/rcs.1541", "10.1016/0749-5978(91)90008-h", "10.1109/tvcg.2015.2467752", "10.1111/risa.12531", "10.1109/tvcg.2011.279", "10.1109/tvcg.2007.70518", "10.1518/001872005775570916", "10.1177/1555343411432338", "10.1037/1082-989x.10.4.389", "10.1111/acfi.2000.40.issue-2", "10.1007/s11548-012-0790-6", "10.1145/1168149.1168158", "10.1109/tvcg.2012.220", "10.1177/0963721413481473", "10.3758/pbr.16.1.204", "10.1117/12.587254", "10.1037/0033-295x.102.4.684", "10.1109/tvcg.2014.2346298", "10.1016/j.neuron.2016.03.025", "10.1080/10447318.2016.1224527", "10.1559/152304000783548037", "10.1080/00223980.1993.9915580", "10.1145/2858036.2858558", "10.1080/17524032.2016.1176946", "10.1371/journal.pone.0096511"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934287", "title": "Why Authors Don't Visualize Uncertainty", "year": "2019", "conferenceName": "InfoVis", "authors": "Jessica Hullman", "citationCount": "5", "affiliation": "Hullman, J (Corresponding Author), Northwestern Univ, Evanston, IL 60208 USA. Hullman, Jessica, Northwestern Univ, Evanston, IL 60208 USA.", "countries": "USA", "abstract": "Clear presentation of uncertainty is an exception rather than rule in media articles, data-driven reports, and consumer applications, despite proposed techniques for communicating sources of uncertainty in data. This work considers, Why do so many visualization authors choose not to visualize uncertainty? I contribute a detailed characterization of practices, associations, and attitudes related to uncertainty communication among visualization authors, derived from the results of surveying 90 authors who regularly create visualizations for others as part of their work, and interviewing thirteen influential visualization designers. My results highlight challenges that authors face and expose assumptions and inconsistencies in beliefs about the role of uncertainty in visualization. In particular, a clear contradiction arises between authors' acknowledgment of the value of depicting uncertainty and the norm of omitting direct depiction of uncertainty. To help explain this contradiction, I present a rhetorical model of uncertainty omission in visualization-based communication. I also adapt a formal statistical model of how viewers judge the strength of a signal in a visualization to visualization-based communication, to argue that uncertainty communication necessarily reduces degrees of freedom in viewers' statistical inferences. I conclude with recommendations for how visualization research on uncertainty communication could better serve practitioners' current needs and values while deepening understanding of assumptions that reinforce uncertainty omission.", "keywords": "Uncertainty visualization,graphical statistical inference,visualization rhetoric", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934287", "refList": ["10.1145/1520340.1520616", "10.1006/obhd.1997.2679", "10.1177/0011000006287390", "10.1145/3173574.3173718", "10.1007/s003710050111", "10.1198/106186004x11435", "10.1080/14639220110110324", "10.1371/journal.pone.0142444", "10.1057/ivs.2009.1", "10.1016/s0098-3004(01)00051-6", "10.3758/s13423-013-0572-3", "10.14714/cp13.1000", "10.1109/mcg.2003.1231171", "10.1098/rsta.2009.0120", "10.1257/jel.53.3.631", "10.1016/0749-5978(90)90002-q", "10.1111/j.1539-6924.1995.tb00308.x", "10.1002/(sici)1099-0771(199706)10:2", "10.1080/01621459.2013.808157", "10.1037/0096-1523.3.4.552", "10.1002/for.3980010203", "10.1073/pnas.1317504111", "10.1145/3025453.3025738", "10.1037/1082-989x.10.4.389", "10.1109/2945.537309", "10.1016/s0098-3004(97)00012-5", "10.1117/12.587254", "10.1109/tvcg.2014.2346298", "10.1109/tvcg.2010.161", "10.1109/tvcg.2018.2864889", "10.1023/a:1026351131038", "10.1016/s0098-3004(97)00005-8", "10.1109/tvcg.2011.255", "10.1145/2858036.2858558", "10.1111/rssa.12378"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3028984", "title": "Bayesian-Assisted Inference from Visualized Data", "year": "2020", "conferenceName": "InfoVis", "authors": "Yea-Seul Kim;Paula Kayongo;Madeleine Grunde-McLaughlin;Jessica Hullman", "citationCount": "0", "affiliation": "Kim, YS (Corresponding Author), Univ Washington, Seattle, WA 98195 USA. Kim, Yea-Seul, Univ Washington, Seattle, WA 98195 USA. Kayongo, Paula; Hullman, Jessica, Northwestern Univ, Evanston, IL 60208 USA. Grunde-McLaughlin, Madeleine, Univ Penn, Philadelphia, PA 19104 USA.", "countries": "USA", "abstract": "A Bayesian view of data interpretation suggests that a visualization user should update their existing beliefs about a parameter's value in accordance with the amount of information about the parameter value captured by the new observations. Extending recent work applying Bayesian models to understand and evaluate belief updating from visualizations, we show how the predictions of Bayesian inference can be used to guide more rational belief updating. We design a Bayesian inference-assisted uncertainty analogy that numerically relates uncertainty in observed data to the user's subjective uncertainty, and a posterior visualization that prescribes how a user should update their beliefs given their prior beliefs and the observed data. In a pre-registered experiment on 4,800 people, we find that when a newly observed data sample is relatively small (N=158), both techniques reliably improve people's Bayesian updating on average compared to the current best practice of visualizing uncertainty in the observed data. For large data samples (N=5208), where people's updated beliefs tend to deviate more strongly from the prescriptions of a Bayesian model, we find evidence that the effectiveness of the two forms of Bayesian assistance may depend on people's proclivity toward trusting the source of the data. We discuss how our results provide insight into individual processes of belief updating and subjective uncertainty, and how understanding these aspects of interpretation paves the way for more sophisticated interactive visualizations for analysis and communication.", "keywords": "Bayesian cognition,Belief updating,Uncertainty visualization,Adaptive visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028984", "refList": ["10.1080/19336896.2018.1471922", "10.3758/bf03196976", "10.1037/1089-2680.2.2.175", "10.1016/j.jclinepi.2009.06.003", "10.1109/tvcg.2014.2346979", "10.1109/tvcg.2018.2864909", "10.1145/3173574.3173718", "10.1006/cogp.1998.0702", "10.1086/209424", "10.1109/tvcg.2012.199", "10.7717/peerj-cs.55", "10.1145/2993901.2993919", "10.1371/journal.pone.0142444", "10.1080/13875868.2015.1137577", "10.1037/1076-898x.3.1.3", "10.1109/tvcg.2019.2934287", "10.1109/tvcg.2017.2743898", "10.1145/3025453.3025592", "10.1057/ivs.2008.13", "10.1214/ss/1015346320", "10.1016/0749-5978(92)90055-c", "10.1080/13546780542000005", "10.1109/tvcg.2015.2467671", "10.1109/tvcg.2016.2607204", "10.3758/s13423-016-1174-7", "10.1016/j.cag.2014.03.002", "10.1198/016214505000000105", "10.1109/tvcg.2012.279", "10.1111/1467-8624.00232", "10.1111/j.1467-9280.2006.01780.x", "10.2307/2682899", "10.1080/00335557743000053", "10.1109/tvcg.2010.177", "10.1057/ivs.2008.28", "10.1109/tvcg.2018.2864889", "10.1109/tvcg.2013.153", "10.1109/tvcg.2015.2467758", "10.1145/2858036.2858558", "10.1287/mnsc.46.8.1100.12023", "10.1016/j.tics.2003.08.012", "10.1111/j.1467-8659.2009.01694.x"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030435", "title": "Data Visceralization: Enabling Deeper Understanding of Data Using Virtual Reality", "year": "2020", "conferenceName": "InfoVis", "authors": "Benjamin Lee;Dave Brown;Bongshin Lee;Christophe Hurter;Steven Mark Drucker;Tim Dwyer", "citationCount": "1", "affiliation": "Lee, B (Corresponding Author), Monash Univ, Clayton, Vic, Australia. Lee, Benjamin; Dwyer, Tim, Monash Univ, Clayton, Vic, Australia. Brown, Dave; Lee, Bongshin; Drucker, Steven, Microsoft Res, Redmond, WA USA. Hurter, Christophe, French Civil Aviat Univ, ENAC, Toulouse, France.", "countries": "USA;France;Australia", "abstract": "A fundamental part of data visualization is transforming data to map abstract information onto visual attributes. While this abstraction is a powerful basis for data visualization, the connection between the representation and the original underlying data (i.e., what the quantities and measurements actually correspond with in reality) can be lost. On the other hand, virtual reality (VR) is being increasingly used to represent real and abstract models as natural experiences to users. In this work, we explore the potential of using VR to help restore the basic understanding of units and measures that are often abstracted away in data visualization in an approach we call data visceralization. By building VR prototypes as design probes, we identify key themes and factors for data visceralization. We do this first through a critical reflection by the authors, then by involving external participants. We find that data visceralization is an engaging way of understanding the qualitative aspects of physical measures and their real-life form, which complements analytical and quantitative understanding commonly gained from data visualization. However, data visceralization is most effective when there is a one-to-one mapping between data and representation, with transformations such as scaling affecting this understanding. We conclude with a discussion of future directions for data visceralization.", "keywords": "Data visceralization,virtual reality,exploratory study", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030435", "refList": ["10.1080/01973762.2013.761106", "10.1109/tvcg.2015.2467811", "10.1109/tvcg.2012.221", "10.1145/3284179.3284326", "10.1109/tvcg.2019.2934287", "10.1109/2945.841119", "10.1109/tvcg.2019.2934539", "10.1109/mcg.2013.101", "10.1109/tvcg.2011.175", "10.1109/tvcg.2018.2830759", "10.1109/3dvis.2014.7160096", "10.1109/mcg.2018.2878900", "10.1109/iv.2011.32", "10.1109/tvcg.2013.196", "10.1109/tvcg.2018.2865241", "10.1515/abitech-2017-0002", "10.1145/2468356.2468739", "10.16995/olh.280", "10.1080/15230406.2018.1513343", "10.1109/iv.2004.1320189", "10.1109/tvcg.2012.213", "10.1109/mcg.2006.120", "10.1109/icdar.2017.286", "10.1371/journal.pone.0146368", "10.1080/1472586x.2011.548488", "10.1109/tvcg.2014.2346574", "10.1080/0013838x.2017.1332021"], "wos": 1, "children": [], "len": 1}], "len": 5}, {"doi": "10.1109/tvcg.2020.3029412", "title": "A Bayesian cognition approach for belief updating of correlation judgement through uncertainty visualizations", "year": "2020", "conferenceName": "InfoVis", "authors": "Alireza Karduni;Douglas Markant;Ryan Wesslen;Wenwen Dou", "citationCount": "0", "affiliation": "Karduni, A (Corresponding Author), Univ North Carolina Charlotte, Charlotte, NC 28223 USA. Karduni, Alireza; Markant, Douglas; Wesslen, Ryan; Dou, Wenwen, Univ North Carolina Charlotte, Charlotte, NC 28223 USA.", "countries": "USA", "abstract": "Understanding correlation judgement is important to designing effective visualizations of bivariate data. Prior work on correlation perception has not considered how factors including prior beliefs and uncertainty representation impact such judgements. The present work focuses on the impact of uncertainty communication when judging bivariate visualizations. Specifically, we model how users update their beliefs about variable relationships after seeing a scatterplot with and without uncertainty representation. To model and evaluate the belief updating, we present three studies. Study 1 focuses on a proposed “Line + Cone” visual elicitation method for capturing users' beliefs in an accurate and intuitive fashion. The findings reveal that our proposed method of belief solicitation reduces complexity and accurately captures the users' uncertainty about a range of bivariate relationships. Study 2 leverages the “Line + Cone” elicitation method to measure belief updating on the relationship between different sets of variables when seeing correlation visualization with and without uncertainty representation. We compare changes in users beliefs to the predictions of Bayesian cognitive models which provide normative benchmarks for how users should update their prior beliefs about a relationship in light of observed data. The findings from Study 2 revealed that one of the visualization conditions with uncertainty communication led to users being slightly more confident about their judgement compared to visualization without uncertainty information. Study 3 builds on findings from Study 2 and explores differences in belief update when the bivariate visualization is congruent or incongruent with users' prior belief. Our results highlight the effects of incorporating uncertainty representation, and the potential of measuring belief updating on correlation judgement with Bayesian cognitive models.", "keywords": "Information visualization,Bayesian modeling,uncertainty visualizations,correlations,belief elicitation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3029412", "refList": ["10.1109/tvcg.2014.2346424", "10.1177/0539018417752089", "10.1145/2702613.2732501", "10.1007/978-3-319-91376-6\\_19", "10.1109/vlsicircuits18222.2020.9162811", "10.1145/2702123.2702431", "10.1371/journal.pbio.1000412", "10.1145/3290605.3300447", "10.1109/tvcg.2009.139", "10.1145/3161187", "10.1016/j.endeavour.2004.07.003", "10.1371/journal.pone.0133753", "10.1109/tfuzz.2019.2919484", "10.1111/j.1365-2362.2009.02234.x", "10.1145/2858036.2858387", "10.1017/s0269889713000082", "10.1109/tvcg.2017.2745941", "10.1080/21548455.2014.941040", "10.1073/pnas.1710351114", "10.1145/1323688.1323689", "10.1109/tvcg.2013.210", "10.1109/tvcg.2012.262", "10.1007/s11165-013-9358-x", "10.1109/mcg.2017.33", "10.3389/fpsyg.2013.00186", "10.1162/posc\\_a\\_00240", "10.1136/bmj.c332", "10.1001/jama.283.15.2008", "10.1145/3173574.3173612", "10.1145/2470654.2470724", "10.1016/j.jhevol.2010.04.005", "10.22323/2.17010401", "10.1002/0470870168", "10.1109/tvcg.2014.2346298", "10.1109/tvcg.2013.234", "10.1109/tvcg.2018.2864889", "10.1136/bmj.330.7485.256-a", "10.1109/tii.2019.2958106", "10.1007/978-3-319-26633-6\\_13", "10.1109/cicc48029.2020.9075900", "10.1016/s0140-6736(09)60329-9"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3028958", "title": "Auditing the Sensitivity of Graph-based Ranking with Visual Analytics", "year": "2020", "conferenceName": "VAST", "authors": "Tiankai Xie;Yuxin Ma;Hanghang Tong;My T. Thai;Ross Maciejewski", "citationCount": "0", "affiliation": "Xie, TK (Corresponding Author), Arizona State Univ, Tempe, AZ 85287 USA. Xie, Tiankai; Ma, Yuxin; Maciejewski, Ross, Arizona State Univ, Tempe, AZ 85287 USA. Tong, Hanghang, Univ Illinois, Urbana, IL USA. Thai, My T., Univ Florida, Gainesville, FL 32611 USA.", "countries": "USA", "abstract": "Graph mining plays a pivotal role across a number of disciplines, and a variety of algorithms have been developed to answer who/what type questions. For example, what items shall we recommend to a given user on an e-commerce platform? The answers to such questions are typically returned in the form of a ranked list, and graph-based ranking methods are widely used in industrial information retrieval settings. However, these ranking algorithms have a variety of sensitivities, and even small changes in rank can lead to vast reductions in product sales and page hits. As such, there is a need for tools and methods that can help model developers and analysts explore the sensitivities of graph ranking algorithms with respect to perturbations within the graph structure. In this paper, we present a visual analytics framework for explaining and exploring the sensitivity of any graph-based ranking algorithm by performing perturbation-based what-if analysis. We demonstrate our framework through three case studies inspecting the sensitivity of two classic graph-based ranking algorithms (PageRank and HITS) as applied to rankings in political news media and social networks.", "keywords": "Graph-based ranking,sensitivity analysis,visual analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028958", "refList": ["10.1109/wsc.2017.8247800", "10.1023/a:1022649401552", "10.1515/1559-0410.11416", "10.1109/tvcg.2016.2598919", "10.1177/1473871611416549", "10.1109/tvcg.2019.2934630", "10.1140/epjds29", "10.1109/tvcg.2019.2934670", "10.1016/j.eswa.2015.09.004", "10.1145/2702123.2702509", "10.1016/j.visinf.2018.12.001", "10.2307/3002000", "10.1109/tvcg.2019.2934399", "10.1007/s41060-016-0032-z", "10.1111/cgf.13198", "10.14778/2350229.2350254", "10.1145/2939672.2939764", "10.1016/j.visinf.2017.01.006", "10.1145/2858036.2858529", "10.1109/vast.2017.8585647", "10.1007/bf01187020", "10.1109/icdm.2015.26", "10.1145/2362383.2362387", "10.1177/0049124104268644", "10.1109/vast.2011.6102442", "10.1109/infvis.2003.1249025", "10.1109/tvcg.2018.2864475", "10.1109/tvcg.2007.70528", "10.1109/tvcg.2015.2467691", "10.1111/cgf.13210", "10.1214/aos/1176344136", "10.1109/tvcg.2015.2424872", "10.1016/j.visinf.2018.09.001", "10.1177/089443939100900106", "10.1109/tvcg.2015.2467931", "10.1162/neco.1997.9.8.1735", "10.1007/s11162-011-9241-4", "10.1111/cgf.13680", "10.1145/3065386", "10.1109/tvcg.2018.2864889", "10.1177/003804070808100402", "10.1109/icdm.2010.62", "10.1038/s41598-020-59669-x", "10.1162/153244303321897717", "10.1109/tvcg.2019.2934619", "10.1007/bf00356088", "10.1109/tvcg.2016.2598432", "10.1109/tvcg.2016.2598831"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3028984", "title": "Bayesian-Assisted Inference from Visualized Data", "year": "2020", "conferenceName": "InfoVis", "authors": "Yea-Seul Kim;Paula Kayongo;Madeleine Grunde-McLaughlin;Jessica Hullman", "citationCount": "0", "affiliation": "Kim, YS (Corresponding Author), Univ Washington, Seattle, WA 98195 USA. Kim, Yea-Seul, Univ Washington, Seattle, WA 98195 USA. Kayongo, Paula; Hullman, Jessica, Northwestern Univ, Evanston, IL 60208 USA. Grunde-McLaughlin, Madeleine, Univ Penn, Philadelphia, PA 19104 USA.", "countries": "USA", "abstract": "A Bayesian view of data interpretation suggests that a visualization user should update their existing beliefs about a parameter's value in accordance with the amount of information about the parameter value captured by the new observations. Extending recent work applying Bayesian models to understand and evaluate belief updating from visualizations, we show how the predictions of Bayesian inference can be used to guide more rational belief updating. We design a Bayesian inference-assisted uncertainty analogy that numerically relates uncertainty in observed data to the user's subjective uncertainty, and a posterior visualization that prescribes how a user should update their beliefs given their prior beliefs and the observed data. In a pre-registered experiment on 4,800 people, we find that when a newly observed data sample is relatively small (N=158), both techniques reliably improve people's Bayesian updating on average compared to the current best practice of visualizing uncertainty in the observed data. For large data samples (N=5208), where people's updated beliefs tend to deviate more strongly from the prescriptions of a Bayesian model, we find evidence that the effectiveness of the two forms of Bayesian assistance may depend on people's proclivity toward trusting the source of the data. We discuss how our results provide insight into individual processes of belief updating and subjective uncertainty, and how understanding these aspects of interpretation paves the way for more sophisticated interactive visualizations for analysis and communication.", "keywords": "Bayesian cognition,Belief updating,Uncertainty visualization,Adaptive visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028984", "refList": ["10.1080/19336896.2018.1471922", "10.3758/bf03196976", "10.1037/1089-2680.2.2.175", "10.1016/j.jclinepi.2009.06.003", "10.1109/tvcg.2014.2346979", "10.1109/tvcg.2018.2864909", "10.1145/3173574.3173718", "10.1006/cogp.1998.0702", "10.1086/209424", "10.1109/tvcg.2012.199", "10.7717/peerj-cs.55", "10.1145/2993901.2993919", "10.1371/journal.pone.0142444", "10.1080/13875868.2015.1137577", "10.1037/1076-898x.3.1.3", "10.1109/tvcg.2019.2934287", "10.1109/tvcg.2017.2743898", "10.1145/3025453.3025592", "10.1057/ivs.2008.13", "10.1214/ss/1015346320", "10.1016/0749-5978(92)90055-c", "10.1080/13546780542000005", "10.1109/tvcg.2015.2467671", "10.1109/tvcg.2016.2607204", "10.3758/s13423-016-1174-7", "10.1016/j.cag.2014.03.002", "10.1198/016214505000000105", "10.1109/tvcg.2012.279", "10.1111/1467-8624.00232", "10.1111/j.1467-9280.2006.01780.x", "10.2307/2682899", "10.1080/00335557743000053", "10.1109/tvcg.2010.177", "10.1057/ivs.2008.28", "10.1109/tvcg.2018.2864889", "10.1109/tvcg.2013.153", "10.1109/tvcg.2015.2467758", "10.1145/2858036.2858558", "10.1287/mnsc.46.8.1100.12023", "10.1016/j.tics.2003.08.012", "10.1111/j.1467-8659.2009.01694.x"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030433", "title": "Data Comics for Reporting Controlled User Studies in Human-Computer Interaction", "year": "2020", "conferenceName": "InfoVis", "authors": "Zezhong Wang;Jacob Ritchie;Jingtao Zhou;Fanny Chevalier;Benjamin Bach", "citationCount": "0", "affiliation": "Wang, ZZ (Corresponding Author), Univ Edinburgh, Edinburgh, Midlothian, Scotland. Wang, Zezhong; Zhou, Jingtao; Bach, Benjamin, Univ Edinburgh, Edinburgh, Midlothian, Scotland. Ritchie, Jacob, Stanford Univ, Stanford, CA 94305 USA. Zhou, Jingtao, Tianjin Univ, Tianjin, Peoples R China. Chevalier, Fanny, Univ Toronto, Toronto, ON, Canada.", "countries": "Scotland;Canada;China;USA", "abstract": "Inspired by data comics, this paper introduces a novel format for reporting controlled studies in the domain of human-computer interaction (HCI). While many studies in HCI follow similar steps in explaining hypotheses, laying out a study design, and reporting results, many of these decisions are buried in blocks of dense scientific text. We propose leveraging data comics as study reports to provide an open and glanceable view of studies by tightly integrating text and images, illustrating design decisions and key insights visually, resulting in visual narratives that can be compelling to non-scientists and researchers alike. Use cases of data comics study reports range from illustrations for non-scientific audiences to graphical abstracts, study summaries, technical talks, textbooks, teaching, blogs, supplementary submission material, and inclusion in scientific articles. This paper provides examples of data comics study reports alongside a graphical repertoire of examples, embedded in a framework of guidelines for creating comics reports which was iterated upon and evaluated through a series of collaborative design sessions.", "keywords": "Statistical communication,comics,scientific reports", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030433", "refList": ["10.1109/tvcg.2014.2346424", "10.1177/0539018417752089", "10.1145/2702123.2702431", "10.1371/journal.pbio.1000412", "10.1145/3290605.3300447", "10.1109/tvcg.2009.139", "10.1145/3161187", "10.18637/jss.v040.i01", "10.1016/j.endeavour.2004.07.003", "10.1145/989863.989865", "10.1111/j.1365-2362.2009.02234.x", "10.1145/2858036.2858387", "10.1109/tvcg.2017.2745941", "10.1080/21548455.2014.941040", "10.1073/pnas.1710351114", "10.1145/1323688.1323689", "10.1109/tvcg.2013.210", "10.1109/tvcg.2012.262", "10.1007/s00778-008-0098-x", "10.1007/s11165-013-9358-x", "10.1109/mcg.2017.33", "10.1162/posc\\_a\\_00240", "10.1001/jama.283.15.2008", "10.1145/3173574.3173612", "10.17349/jmc117309", "10.1016/j.jhevol.2010.04.005", "10.22323/2.17010401", "10.1002/0470870168", "10.1145/1378773.1378792", "10.1109/tvcg.2014.2346298", "10.1109/tvcg.2013.234", "10.1109/tvcg.2018.2864889", "10.1136/bmj.330.7485.256-a", "10.25165/j.ijabe.20201302.5353", "10.1007/978-3-319-26633-6\\_13", "10.1016/s0140-6736(09)60329-9", "10.1016/j.ces.2018.11.036"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.1014", "year": "2020", "title": "Uncertainty Visualisation: An Interactive Visual Survey", "conferenceName": "PacificVis", "authors": "Amit Jena;Ulrich Engelke;Tim Dwyer;Venkatesh Raiamanickam;C{\\'{e}}cile Paris", "citationCount": "0", "affiliation": "Jena, A (Corresponding Author), IITB Monash Res Acad, Mumbai, Maharashtra, India.\nJena, Amit, IITB Monash Res Acad, Mumbai, Maharashtra, India.\nEngelke, Ulrich, CSIRO Data61, Perth, WA, Australia.\nDwyer, Tim, Monash Univ, Melbourne, Vic, Australia.\nRajamanickam, Venkatesh, Indian Inst Technol, Mumbai, Maharashtra, India.\nParis, Cecile, CSIRO Data61, Sydney, NSW, Australia.", "countries": "India;Australia", "abstract": "There exists a gulf between the rhetoric in visualisation research about the significance of uncertainty and the inclusion of representations of uncertainty in visualisations used in practice. The graphical representation of uncertainty information has emerged as a problem of great importance in visualisation research. This contribution presents a survey of 286 uncertainty visualisation research publications. All publications are categorised with regard to publication type, publication venue, application domain, target user, and evaluation type. We present an interactive web-based browser that facilitates easy visual search and exploration of the publications included in the survey. We conclude that uncertainty visualisation is severely limited by the quality and scope of uncertainty data, by the limited confidence in the data, and by the perceptual and cognitive confusion that the graphical representation of the data can generate.", "keywords": "Human-centered computing; Visualization; Uncertainty Visualization; Human-centered computing; Visualization; Visualization application domains", "link": "https://doi.org/10.1109/PacificVis48177.2020.1014", "refList": ["10.1117/12.587254", "10.1007/978-1-4471-2804-5\\_6", "10.1109/tvcg.2018.2864889", "10.1177/0272989x07307270", "10.1177/0272989x10371830", "10.1016/0010-0277(82)90023-3", "10.1007/s003710050111", "10.1126/science.1191181", "10.1109/tvcg.2012.285", "10.2307/2683467", "10.1109/mcse.2007.27", "10.2307/2683729"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.7614", "year": "2020", "title": "Uncertainty Treemaps", "conferenceName": "PacificVis", "authors": "Max Sondag;Wouter Meulemans;Christoph Schulz;Kevin Verbeek;Daniel Weiskopf;Bettina Speckmann", "citationCount": "0", "affiliation": "Sondag, M (Corresponding Author), TU Eindhoven, Eindhoven, Netherlands.\nSondag, Max; Meulemans, Wouter; Verbeek, Kevin; Speckmann, Bettina, TU Eindhoven, Eindhoven, Netherlands.\nSchulz, Christoph; Weiskopf, Daniel, Univ Stuttgart, Stuttgart, Germany.", "countries": "Germany;Netherlands", "abstract": "Rectangular treemaps visualize hierarchical numerical data by recursively partitioning an input rectangle into smaller rectangles whose areas match the data. Numerical data often has uncertainty associated with it. To visualize uncertainty in a rectangular treemap, we identify two conflicting key requirements: (i) to assess the data value of a node in the hierarchy, the area of its rectangle should directly match its data value, and (ii) to facilitate comparison between data and uncertainty, uncertainty should be encoded using the same visual variable as the data, that is, area. We present Uncertainty Treemaps, which meet both requirements simultaneously by introducing the concept of hierarchical uncertainty masks. First, we define a new cost function that measures the quality of Uncertainty Treemaps. Then, we show how to adapt existing treemapping algorithms to support uncertainty masks. Finally, we demonstrate the usefulness and quality of our technique through an expert review and a computational experiment on real-world datasets.", "keywords": "Human-centered computing; Visualization; Visualization techniques; Treemaps", "link": "https://doi.org/10.1109/PacificVis48177.2020.7614", "refList": ["10.1109/tvcg.2013.180", "10.1109/tvcg.2015.2467591", "10.1111/cgf.12380", "10.1109/tvcg.2018.2864909", "10.1109/tvcg.2017.2743959", "10.1142/s0129183111016397", "10.1057/ivs.2009.4", "10.1080/15230406.2014.949868", "10.1007/978-1-4471-2804-5\\_6", "10.1145/1124772.1124851", "10.1109/tvcg.2017.2745140", "10.1145/22949.22950", "10.1109/tvcg.2010.79", "10.2307/1420573", "10.1109/tvcg.2010.186", "10.1037/h0046162", "10.1016/j.comgeo.2013.12.008", "10.1109/tvcg.2015.2424872", "10.1145/571647.571649", "10.1109/tvcg.2015.2467752", "10.2307/2288400", "10.1109/tvcg.2012.279", "10.1109/tvcg.2011.197", "10.1145/1056018.1056041", "10.1109/tvcg.2012.220", "10.1109/tvcg.2014.2346298", "10.1109/tvcg.2018.2864889", "10.1016/j.dam.2006.08.005", "10.1109/pacificvis.2018.00020", "10.1109/tvcg.2013.91"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13698", "year": "2019", "title": "Visual-Interactive Preprocessing of Multivariate Time Series Data", "conferenceName": "EuroVis", "authors": "J{\\\"{u}}rgen Bernard;Marco Hutter;Heiko Reinemuth;Hendrik Pfeifer;Christian Bors;J{\\\"{o}}rn Kohlhammer", "citationCount": "2", "affiliation": "Bernard, J (Corresponding Author), Tech Univ Darmstadt, Darmstadt, Germany.\nBernard, Juergen; Hutter, Marco; Reinemuth, Heiko; Pfeifer, Hendrik, Tech Univ Darmstadt, Darmstadt, Germany.\nBors, Christian, TU Wien, Vienna, Austria.\nKohlhammer, Joern, Fraunhofer IGD, Darmstadt, Germany.", "countries": "Germany;Austria", "abstract": "Pre-processing is a prerequisite to conduct effective and efficient downstream data analysis. Pre-processing pipelines often require multiple routines to address data quality challenges and to bring the data into a usable form. For both the construction and the refinement of pre-processing pipelines, human-in-the-loop approaches are highly beneficial. This particularly applies to multivariate time series, a complex data type with multiple values developing over time. Due to the high specificity of this domain, it has not been subject to in-depth research in visual analytics. We present a visual-interactive approach for preprocessing multivariate time series data with the following aspects. Our approach supports analysts to carry out six core analysis tasks related to pre-processing of multivariate time series. To support these tasks, we identify requirements to baseline toolkits that may help practitioners in their choice. We characterize the space of visualization designs for uncertainty-aware pre-processing and justify our decisions. Two usage scenarios demonstrate applicability of our approach, design choices, and uncertainty visualizations for the six analysis tasks. This work is one step towards strengthening the visual analytics support for data pre-processing in general and for uncertainty-aware pre-processing of multivariate time series in particular.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13698", "refList": ["10.1016/j.engappai.2010.09.007", "10.1109/tvcg.2015.2467591", "10.1111/cgf.13190", "10.1177/1473871611416549", "10.1007/3-7908-1701-5\\_9", "10.1109/icdmw.2009.55", "10.3758/s13423-012-0247-5", "10.1109/pacificvis.2010.5429596", "10.1177/1473871611415994", "10.1117/12.2080001", "10.1145/2379776.2379788", "10.1145/3105971.3105984", "10.1016/j.patcog.2005.01.025", "10.1594/pangaea.150017", "10.1109/tvcg.2013.178", "10.1109/tvcg.2018.2859973", "10.1109/tvcg.2011.195", "10.1145/1126004.1126005", "10.1145/1656274.1656278", "10.1594/pangaea.804156", "10.1594/pangaea.787726", "10.1109/tvcg.2018.2865077", "10.1007/978-1-4471-6497-5\\_1", "10.2312/eurova.20151104", "10.1109/tvcg.2012.285", "10.1023/a:1024988512476", "10.1109/tvcg.2010.225", "10.1109/vast.2015.7347672", "10.1007/s00799-014-0134-y", "10.1109/tvcg.2016.2598495", "10.1109/tvcg.2018.2864907", "10.1007/s40430-018-1079-7", "10.1007/978-3-642-32498-7\\_5", "10.1111/cgf.13237", "10.1109/vast.2009.5332611", "10.1109/tvcg.2015.2467752", "10.1016/j.cviu.2006.08.002", "10.1109/tvcg.2014.2346321", "10.1145/1014052.1014104", "10.1007/978-3-540-71949-6", "10.2312/sca/sca10/001-010", "10.1145/3025453.3025738", "10.2312/eurova.20181112", "10.1109/pacificvis.2018.00034", "10.1007/978-0-85729-079-3\\_8", "10.1109/tvcg.2017.2779501", "10.1109/tvcg.2008.166", "10.1007/s10618-012-0285-7", "10.1109/tvcg.2013.222", "10.1109/tvcg.2018.2864889", "10.1109/tvcg.2016.2598592", "10.1109/vast.2010.5652530", "10.1145/2723372.2731081", "10.1109/tvcg.2018.2864914", "10.1109/infvis.2000.885098", "10.1016/j.neucom.2017.01.105", "10.2352/issn.2470-1173.2017.1.vda-387", "10.1109/tvcg.2015.2467851", "10.1109/tvcg.2016.2598468", "10.1109/tvcg.2016.2603178"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030364", "title": "Supporting the Problem-Solving Loop: Designing Highly Interactive Optimisation Systems", "year": "2020", "conferenceName": "VAST", "authors": "Jie Liu;Tim Dwyer;Guido Tack;Samuel Gratzl;Kim Marriott", "citationCount": "0", "affiliation": "Liu, J (Corresponding Author), Monash Univ, Clayton, Vic, Australia. Liu, Jie; Dwyer, Tim; Tack, Guido; Gratzl, Samuel; Marriott, Kim, Monash Univ, Clayton, Vic, Australia.", "countries": "Australia", "abstract": "Efficient optimisation algorithms have become important tools for finding high-quality solutions to hard, real-world problems such as production scheduling, timetabling, or vehicle routing. These algorithms are typically “black boxes” that work on mathematical models of the problem to solve. However, many problems are difficult to fully specify, and require a “human in the loop” who collaborates with the algorithm by refining the model and guiding the search to produce acceptable solutions. Recently, the Problem-Solving Loop was introduced as a high-level model of such interactive optimisation. Here, we present and evaluate nine recommendations for the design of interactive visualisation tools supporting the Problem-Solving Loop. They range from the choice of visual representation for solutions and constraints to the use of a solution gallery to support exploration of alternate solutions. We first examined the applicability of the recommendations by investigating how well they had been supported in previous interactive optimisation tools. We then evaluated the recommendations in the context of the vehicle routing problem with time windows (VRPTW). To do so we built a sophisticated interactive visual system for solving VRPTW that was informed by the recommendations. Ten participants then used this system to solve a variety of routing problems. We report on participant comments and interaction patterns with the tool. These showed the tool was regarded as highly usable and the results generally supported the usefulness of the underlying recommendations.", "keywords": "Interactive optimisation,Interface design,Usability,Interactive systems and tools,Vehicle routing", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030364", "refList": ["10.1176/appi.ajp.2018.18070881", "10.1006/obhd.1997.2679", "10.1109/vlhcc.2018.8506576", "10.1177/0956797611417632", "10.1177/0956797619830649", "10.1177/0049124115610347", "10.1177/1948550618775108", "10.1145/3313831.3376533", "10.1511/2014.111.460", "10.1145/2858036.2858465", "10.1145/3173574.3173606", "10.1177/1745691616658637", "10.1038/483531a", "10.1145/3173574.3174053", "10.1037/pspp0000186", "10.1016/j.jclinepi.2015.05.029", "10.1126/science.aac4716", "10.1145/985692.985782", "10.1080/02699931.2018.1524747", "10.1073/pnas.1402786111", "10.1145/3290605.3300295", "10.1111/cgf.13698", "10.1145/3290605.3300709", "10.2307/2686111", "10.1214/17-ba1091", "10.1145/1449715.1449732", "10.2139/ssrn.2694998", "10.1145/3313831.3376777", "10.1177/2515245917747646", "10.1145/3290605.3300754", "10.1145/3025453.3025626", "10.1109/tvcg.2014.2346321", "10.1037/gpr0000123", "10.2139/ssrn.2535453", "10.1145/3025453.3025738", "10.1038/533452a", "10.1177/1948550617714584", "10.1007/s11222-013-9416-2", "10.3389/fpsyg.2016.01832", "10.1038/s41562-018-0506-1", "10.1007/s11222-016-9696-4", "10.1177/1367006918763132", "10.1109/tsmc.1981.4308636", "10.1038/nrd3439-c1", "10.1177/0956797617723726", "10.1111/j.1467-8659.2012.03116.x", "10.1146/annurev-psych-122216-011836", "10.1145/3290605.3300432"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 23}, "index": 784, "embedding": [4.352429389953613, 3.6759555339813232, 0.1567920744419098, 4.8089375495910645, -0.6495316028594971, 0.16650904715061188, -0.7182635068893433, 4.32920503616333, -0.4013857841491699, -0.8018340468406677, 2.7069215774536133, 3.3715155124664307, -0.1336275339126587, 6.635033130645752, 4.293190002441406, 5.70308256149292, 2.6411495208740234, 0.07991757988929749, -0.659038782119751, 5.573535919189453, -0.06630208343267441, 3.334947109222412, 3.492185115814209, 2.3429343700408936, 0.8806031346321106, 0.09441477060317993, -0.5399249196052551, 2.9833364486694336, 4.6971635818481445, 4.313088417053223, 4.324016571044922, 5.432241439819336], "projection": [-3.348177909851074, 8.116569519042969], "size": 12, "height": 3, "width": 8}