{"data": {"doi": "10.1109/tvcg.2018.2864903", "title": "What Do We Talk About When We Talk About Dashboards?", "year": "2018", "conferenceName": "InfoVis", "authors": "Alper Sarikaya;Michael Correll;Lyn Bartram;Melanie Tory;Danyel Fisher", "citationCount": "13", "affiliation": "Sarikaya, A (Corresponding Author), Microsoft Corp, Redmond, WA 98052 USA. Sarikaya, Alper, Microsoft Corp, Redmond, WA 98052 USA. Correll, Michael; Tory, Melanie, Tableau Res, Seattle, WA USA. Bartram, Lyn, Simon Fraser Univ, Burnaby, BC, Canada. Fisher, Danyel, Honeycomb Io, San Francisco, CA USA.", "countries": "Canada;USA", "abstract": "Dashboards are one of the most common use cases for data visualization, and their design and contexts of use are considerably different from exploratory visualization tools. In this paper, we look at the broad scope of how dashboards are used in practice through an analysis of dashboard examples and documentation about their use. We systematically review the literature surrounding dashboard use, construct a design space for dashboards, and identify major dashboard types. We characterize dashboards by their design goals, levels of interaction, and the practices around them. Our framework and literature review suggest a number of fruitful research directions to better support dashboard design, implementation and use.", "keywords": "Dashboards,literature review,survey,design space,open coding", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864903", "refList": ["10.4087/foundationreview-d-13-00009.1", "10.1145/2207676.2208288", "10.1177/0956797615623770", "10.1145/2717318", "10.1177/0002764213479363", "10.1111/1748-8583.12090", "10.1093/cjres/rsu027", "10.1097/cin.0000000000000106", "10.1007/s00779-013-0751-2", "10.5194/isprs-annals-iv-4-w1-19-2016", "10.2148/benv.42.3.498", "10.1177/0272989x10373805", "10.1109/healthcom.2015.7454540", "10.1002/pra2.2017.14505401145", "10.1109/tvcg.2017.2744198", "10.1136/amiajnl-2014-002963", "10.14236/ewic/hci2014.16", "10.1093/jhuman/huw011", "10.1109/educon.2017.7942988", "10.1109/tvcg.2013.124", "10.1007/s10758-017-9316-1", "10.1007/978-3-662-44659-1\\_10", "10.3390/info8020047", "10.1016/j.geoforum.2016.10.006", "10.1016/j.landusepol.2017.10.019", "10.1177/1098611117709785", "10.1145/3154862.3154881", "10.17705/1jais.00423", "10.1007/s10488-007-0151-x", "10.1080/13658816.2014.977905", "10.1007/978-3-642-37157-8\\_8", "10.1080/1369118x.2016.1153126", "10.17605/osf.io/k2epn", "10.1007/978-3-642-39215-3\\_14", "10.1109/tvcg.2013.120", "10.1016/j.accinf.2011.08.002", "10.1109/tvcg.2014.2359887"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3028956", "title": "A Visual Analytics Approach for Ecosystem Dynamics based on Empirical Dynamic Modeling", "year": "2020", "conferenceName": "VAST", "authors": "Hiroaki Natsukawa;Ethan R. Deyle;Gerald M. Pao;Koji Koyamada;George Sugihara", "citationCount": "0", "affiliation": "Natsukawa, H (Corresponding Author), Kyoto Univ, Kyoto, Japan. Natsukawa, Hiroaki; Koyamada, Koji, Kyoto Univ, Kyoto, Japan. Deyle, Ethan R., Boston Univ, Boston, MA 02215 USA. Deyle, Ethan R.; Sugihara, George, Univ Calif San Diego, Scripps Inst Oceanog, San Diego, CA 92103 USA. Pao, Gerald M., Salk Inst Biol Sci, San Diego, CA USA.", "countries": "Japan;USA", "abstract": "An important approach for scientific inquiry across many disciplines involves using observational time series data to understand the relationships between key variables to gain mechanistic insights into the underlying rules that govern the given system. In real systems, such as those found in ecology, the relationships between time series variables are generally not static; instead, these relationships are dynamical and change in a nonlinear or state-dependent manner. To further understand such systems, we investigate integrating methods that appropriately characterize these dynamics (i.e., methods that measure interactions as they change with time-varying system states) with visualization techniques that can help analyze the behavior of the system. Here, we focus on empirical dynamic modeling (EDM) as a state-of-the-art method that specifically identifies causal variables and measures changing state-dependent relationships between time series variables. Instead of using approaches centered on parametric equations, EDM is an equation-free approach that studies systems based on their dynamic attractors. We propose a visual analytics system to support the identification and mechanistic interpretation of system states using an EDM-constructed dynamic graph. This work, as detailed in four analysis tasks and demonstrated with a GUI, provides a novel synthesis of EDM and visualization techniques such as brush-link visualization and visual summarization to interpret dynamic graphs representing ecosystem dynamics. We applied our proposed system to ecological simulation data and real data from a marine mesocosm study as two key use cases. Our case studies show that our visual analytics tools support the identification and interpretation of the system state by the user, and enable us to discover both confirmatory and new findings in ecosystem dynamics. Overall, we demonstrated that our system can facilitate an understanding of how systems function beyond the intuitive analysis of high-dimensional information based on specific domain knowledge.", "keywords": "Visual analytics,empirical dynamic modeling,dynamic network,exploratory data analysis", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028956", "refList": ["10.1145/1835449.1835643", "10.1145/642611.642616.{[}cr0ssref", "10.1145/2890510", "10.1162/tacl\\_a\\_00051", "10.3233/ida-163209", "10.1109/tvcg.2018.2864903", "10.2200/s00174ed1v01y200901icr003", "10.5555/2999792.2999959", "10.1109/tvcg.2015.2467757", "10.1145/3240323.3240351", "10.1145/1864708.1864761", "10.1145/1125451.1125659", "10.2307/2529310", "10.1109/tvcg.2007.70594", "10.1007/s13740-016-0060-9", "10.1109/mcg.2019.2924636", "10.1007/978-3-540-78582-8\\_18", "10.1016/j.eswa.2016.02.013", "10.1109/vl.1996.545307", "10.1007/978-0-387-85820-3\\_3", "10.1007/s11042-015-3206-0", "10.1145/1352793.1352837", "10.1007/s11257-011-9118-4", "10.1145/3190616", "10.1145/2882903.2899389", "10.1109/vast.2014.7042511", "10.1145/1282280.1282359", "10.1145/642611.642616", "10.1109/tvcg.2018.2865240", "10.1177/001316446002000104", "10.1002/(sici)1097-4571(199009)41:6", "10.1037/h0031619", "10.1007/978-981-10-2857-1\\_20", "10.1109/tvcg.2007.70577", "10.1145/3092931.3092937", "10.1109/tvcg.2014.2346978", "10.1007/s11257-018-9206-9", "10.1109/18.61115", "10.1162/jmlr.2003.3.4-5.993", "10.1145/3298689.3347047", "10.1073/pnas.0307750100", "10.3115/v1/d14-1162", "10.1108/00220410410560582", "10.1016/j.fss.2008.03.017", "10.1007/978-0-387-85820-3\\_8", "10.1109/tvcg.2014.2346325", "10.1007/s11257-011-9112-x", "10.1109/sequen.1997.666900", "10.1145/642611.642681", "10.1007/s11257-018-9215-8", "10.1145/3290605.3300358", "10.1111/cgf.12387", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030338", "title": "Composition and Configuration Patterns in Multiple-View Visualizations", "year": "2020", "conferenceName": "InfoVis", "authors": "Xi Chen;Wei Zeng 0004;Yanna Lin;Hayder Al-Maneea;Jonathan Roberts 0002;Remco Chang", "citationCount": "0", "affiliation": "Zeng, W (Corresponding Author), Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. Chen, Xi; Zeng, Wei; Lin, Yanna, Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. AI-maneea, Hayder Mahdi; Roberts, Jonathan, Bangor Univ, Bangor, Gwynedd, Wales. Chang, Remco, Tufts Univ, Medford, MA 02155 USA.", "countries": "USA;Wales;China", "abstract": "Multiple-view visualization (MV) is a layout design technique often employed to help users see a large number of data attributes and values in a single cohesive representation. Because of its generalizability, the MV design has been widely adopted by the visualization community to help users examine and interact with large, complex, and high-dimensional data. However, although ubiquitous, there has been little work to categorize and analyze MVs in order to better understand its design space. As a result, there has been little to no guideline in how to use the MV design effectively. In this paper, we present an in-depth study of how MVs are designed in practice. We focus on two fundamental measures of multiple-view patterns: composition, which quantifies what view types and how many are there; and configuration, which characterizes spatial arrangement of view layouts in the display space. We build a new dataset containing 360 images of MVs collected from IEEE VIS, EuroVis, and PacificVis publications 2011 to 2019, and make fine-grained annotations of view types and layouts for these visualization images. From this data we conduct composition and configuration analyses using quantitative metrics of term frequency and layout topology. We identify common practices around MVs, including relationship of view types, popular view layouts, and correlation between view types and layouts. We combine the findings into a MV recommendation system, providing interactive tools to explore the design space, and support example-based design.", "keywords": "Multiple views,design pattern,quantitative analysis,example-based design", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030338", "refList": ["10.1109/tvcg.2018.2865235", "10.1109/tvcg.2016.2615308", "10.1145/2642918.2647398", "10.1177/1473871611416549", "10.1109/tvcg.2019.2934810", "10.1109/tvcg.2014.48", "10.1109/tvcg.2018.2864903", "10.1145/345513.345271", "10.1109/iv.1998.694193", "10.1109/tvcg.2007.70594", "10.1109/tvcg.2017.2744019", "10.1109/tvcg.2011.185", "10.1109/tvcg.2015.2467194", "10.1109/visual.1991.175815", "10.14778/2831360.2831371", "10.1109/mcg.2019.2924636", "10.1111/cgf.13673", "10.1111/cgf.12131", "10.1109/tvcg.2017.2744198", "10.1145/108360.108361", "10.1109/vl.1996.545307", "10.1109/tvcg.2017.2745140", "10.1109/cmv.2007.20", "10.1145/198366.198376", "10.1145/2508363.2508405", "10.1111/cgf.12114", "10.1109/icde.2018.00019", "10.1109/tvcg.2017.2787113", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13380", "10.1111/cgf.12902", "10.1109/vast.2015.7347628", "10.2307/2288400", "10.1109/infvis.2004.12", "10.1145/102377.115768", "10.1109/tvcg.2009.179", "10.1109/2945.981851", "10.1109/tvcg.2007.70521", "10.1109/pacificvis.2012.6183556", "10.1145/2213836", "10.1109/tvcg.2013.234", "10.1109/iv.2008.87"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030388", "title": "Visualization of Human Spine Biomechanics for Spinal Surgery", "year": "2020", "conferenceName": "SciVis", "authors": "Pepe Eulzer;Sabine Bauer;Francis Kilian;Kai Lawonn", "citationCount": "0", "affiliation": "Eulzer, P (Corresponding Author), Univ Jena, Jena, Germany. Eulzer, Pepe; Lawonn, Kai, Univ Jena, Jena, Germany. Bauer, Sabine, Univ Koblenz Landau, Koblenz, Germany. Kilian, Francis, Cath Clin Koblenz Montabaur, Dept Spine Surg, Koblenz, Germany.", "countries": "Germany", "abstract": "We propose a visualization application, designed for the exploration of human spine simulation data. Our goal is to support research in biomechanical spine simulation and advance efforts to implement simulation-backed analysis in surgical applications. Biomechanical simulation is a state-of-the-art technique for analyzing load distributions of spinal structures. Through the inclusion of patient-specific data, such simulations may facilitate personalized treatment and customized surgical interventions. Difficulties in spine modelling and simulation can be partly attributed to poor result representation, which may also be a hindrance when introducing such techniques into a clinical environment. Comparisons of measurements across multiple similar anatomical structures and the integration of temporal data make commonly available diagrams and charts insufficient for an intuitive and systematic display of results. Therefore, we facilitate methods such as multiple coordinated views, abstraction and focus and context to display simulation outcomes in a dedicated tool. $\\mathrm{By}$ linking the result data with patient-specific anatomy, we make relevant parameters tangible for clinicians. Furthermore, we introduce new concepts to show the directions of impact force vectors, which were not accessible before. We integrated our toolset into a spine segmentation and simulation pipeline and evaluated our methods with both surgeons and biomechanical researchers. When comparing our methods against standard representations that are currently in use, we found increases in accuracy and speed in data exploration tasks. $\\mathrm{in}$ a qualitative review, domain experts deemed the tool highly useful when dealing with simulation result data, which typically combines time-dependent patient movement and the resulting force distributions on spinal structures.", "keywords": "Medical visualization,bioinformatics,coordinated views,focus and context,biomechanical simulation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030388", "refList": ["10.1109/tvcg.2018.2864903", "10.1177/1473871613510429", "10.1093/ehjqcco/qcz052", "10.1109/tvcg.2007.70594", "10.1109/tvcg.2018.2865076", "10.1055/s-0039-1687862", "10.1109/visual.1990.146375", "10.1109/tvcg.2017.2744198", "10.1016/j.ijmedinf.2014.10.001", "10.1109/tvcg.2013.124", "10.1016/j.jacc", "10.1111/cgf.13167", "10.17705/1thci.00055", "10.1136/bmjqs.2009.037895", "10.1109/tvcg.2013.238", "10.1109/tvcg.2018.2865240", "10.1186/1471-2261-6-34", "10.1109/tvcg.2019.2934264", "10.1109/tvcg.2013.200", "10.1109/tvcg.2011.209", "10.1109/tvcg.2014.2346682", "10.1109/tvcg.2015.2467091", "10.1136/bmjopen-2019-033208", "10.1109/beliv.2018.8634027", "10.1109/tvcg.2012.213", "10.1109/tvcg.2015.2467191", "10.1109/tvcg.2015.2467325", "10.1145/2133806.2133821", "10.1145/1806799.1806866", "10.1108/02635570610688869", "10.1002/hbm.20701", "10.1561/1100000039", "10.1145/3025453.3025645", "10.1109/tvcg.2009.111", "10.1109/tvcg.2013.120", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030396", "title": "What Makes a Data-GIF Understandable?", "year": "2020", "conferenceName": "InfoVis", "authors": "Xinhuan Shu;Aoyu Wu;Junxiu Tang;Benjamin Bach;Yingcai Wu;Huamin Qu", "citationCount": "1", "affiliation": "Wu, YC (Corresponding Author), Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Peoples R China. Shu, Xinhuan; Tang, Junxiu; Wu, Yingcai, Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Peoples R China. Shu, Xinhuan; Wu, Aoyu; Qu, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Shu, Xinhuan, Zhejiang Univ, Hangzhou, Peoples R China. Bach, Benjamin, Univ Edinburgh, Edinburgh, Midlothian, Scotland.", "countries": "Scotland;China", "abstract": "GIFs are enjoying increasing popularity on social media as a format for data-driven storytelling with visualization; simple visual messages are embedded in short animations that usually last less than 15 seconds and are played in automatic repetition. In this paper, we ask the question, “What makes a data-GIF understandable?” While other storytelling formats such as data videos, infographics, or data comics are relatively well studied, we have little knowledge about the design factors and principles for “data-GIFs”. To close this gap, we provide results from semi-structured interviews and an online study with a total of 118 participants investigating the impact of design decisions on the understandability of data-GIFs. The study and our consequent analysis are informed by a systematic review and structured design space of 108 data-GIFs that we found online. Our results show the impact of design dimensions from our design space such as animation encoding, context preservation, or repetition on viewers understanding of the GIF's core message. The paper concludes with a list of suggestions for creating more effective Data-GIFs.", "keywords": "Data-GIFs,Data-driven Storytelling,Evaluation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030396", "refList": ["10.1109/tvcg.2016.2598647", "10.1016/j.visinf.2020.07.001", "10.1177/1473871615594652", "10.1109/tvcg.2014.2346424", "10.1111/cgf.13195", "10.1109/vlsicircuits18222.2020.9162811", "10.1109/tvcg.2018.2864909", "10.1109/tvcg.2018.2864903", "10.1145/2702123.2702431", "10.1016/j.visinf.2019.12.002", "10.1145/3274349", "10.1111/cgf.13444", "10.1145/3206505.3206552", "10.1145/3290605.3300280", "10.1109/jstqe.2020.3021589", "10.1145/2647868.2656408", "10.1006/ijhc.1017", "10.1145/3290605.3300335", "10.1007/s12650-020-00689-0", "10.1145/2818048.2819936", "10.1111/cgf.13325", "10.1145/2858036.2858387", "10.1145/3027063.3053139", "10.1145/3290605.3300474", "10.1109/tvcg.2016.2598920", "10.1109/tvcg.2018.2864899", "10.1145/3290605.3300483", "10.1145/3173574.3173612", "10.1145/2909132.2909255", "10.1109/tvcg.2016.2598620", "10.1016/j.learninstruc.2007.09.013", "10.1109/tvcg.2007.70539", "10.1109/tvcg.2008.125", "10.1145/3173574.3173909", "10.1109/tvcg.2019.2934397", "10.1111/cgf.13709", "10.1109/tvcg.2013.234", "10.1109/tvcg.2019.2934401", "10.1145/2858036.2858532", "10.1016/j.visinf.2020.08.001", "10.1109/tvcg.2010.179", "10.1109/cicc48029.2020.9075900"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13705", "year": "2019", "title": "IGM-Vis: Analyzing Intergalactic and Circumgalactic Medium Absorption Using Quasar Sightlines in a Cosmic Web Context", "conferenceName": "EuroVis", "authors": "Joseph N. Burchett;David Abramov;Jasmine Otto;Cassia Artanegara;J. Xavier Prochaska;Angus G. Forbes", "citationCount": "2", "affiliation": "Burchett, JN (Corresponding Author), Univ Calif Santa Cruz, Dept Astron \\& Astrophys, Santa Cruz, CA 95064 USA.\nBurchett, J. N.; Prochaska, J. X., Univ Calif Santa Cruz, Dept Astron \\& Astrophys, Santa Cruz, CA 95064 USA.\nAbramov, D.; Otto, J.; Artanegara, C.; Forbes, A. G., Univ Calif Santa Cruz, Dept Computat Media, Santa Cruz, CA 95064 USA.", "countries": "USA", "abstract": "We introduce IGM-Vis, a novel astrophysics visualization and data analysis application for investigating galaxies and the gas that surrounds them in context with their larger scale environment, the Cosmic Web. Environment is an important factor in the evolution of galaxies from actively forming stars to quiescent states with little, if any, discernible star formation activity. The gaseous halos of galaxies (the circumgalactic medium, or CGM) play a critical role in their evolution, because the gas necessary to fuel star formation and any gas expelled from widely observed galactic winds must encounter this interface region between galaxies and the intergalactic medium (IGM). We present a taxonomy of tasks typically employed in IGM/CGM studies informed by a survey of astrophysicists at various career levels, and demonstrate how these tasks are facilitated via the use of our visualization software. Finally, we evaluate the effectiveness of IGM-Vis through two in-depth use cases that depict real-world analysis sessions that use IGM/CGM data.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13705", "refList": ["10.1093/mnras/stv553", "10.1088/0004-637x/788/2/119", "10.1093/mnras/stw484", "10.1109/pacificvis.2017.8031603", "10.1109/tvcg.2014.2312008", "10.1002/cpe.994", "10.3847/1538-4365/aa9e8a", "10.1086/301513", "10.1088/0067-0049/195/1/11", "10.1086/306397", "10.1086/511749", "10.1146/annurev-astro-091916-055240", "10.1086/148627", "10.1088/1538-3873/aa5456", "10.2352/j.imagingsci.technol.2016.60.1.010405", "10.3847/1538-4365/aab776", "10.1109/tvcg.2018.2864508", "10.1146/annurev.astro.36.1.267", "10.1086/341326", "10.1073/pnas.15.3.168", "10.1088/0004-637x/815/2/91", "10.3847/1538-4357/834/2/191", "10.1016/j.future.2008.06.013", "10.1086/157917", "10.1109/tvcg.2017.2745280", "10.1145/581571.581572", "10.1111/j.1365-2966.2012.21448.x", "10.1051/aas:2000331", "10.1016/b978-012387582-2/50038-1", "10.1086/312644", "10.1086/180350", "10.1109/pacificvis.2012.6183573", "10.1088/2041-8205/758/2/l41", "10.1088/0004-637x/787/2/147", "10.1086/153099", "10.1086/306949", "10.1007/s10509-010-0458-z", "10.1093/mnras/stx3170", "10.1109/pacificvis.2016.7465250", "10.1086/324761", "10.1086/380092", "10.1109/bdva.2015.7314290", "10.1146/annurev.astro.43.072103.150610", "10.1086/498646", "10.1016/j.ascom.2015.05.004", "10.3847/0004-637x/826/1/50", "10.1038/nature25436", "10.1146/annurev-astro-081811-125610", "10.1088/0004-637x/777/1/59", "10.1088/0004-637x/813/1/46", "10.1109/mcg.2017.20", "10.1109/tvcg.2004.1260759", "10.1109/tvcg.2007.2", "10.1086/191114", "10.3847/0004-637x/832/2/124", "10.1088/1538-3873/129/972/028002", "10.1109/ldav.2016.7874310", "10.1109/tvcg.2013.124", "10.1088/1538-3873/aa5b73", "10.1088/0004-637x/744/1/60", "10.1109/tvcg.2011.279", "10.1088/2041-8205/772/2/l29", "10.1088/0004-637x/814/1/40", "10.1109/tvcg.2009.142", "10.1371/journal.pbio.1002195", "10.3847/1538-4357/aa697b", "10.3847/1538-4357/833/2/135", "10.1126/science.246.4932.897", "10.1086/180337", "10.1109/tvcg.2018.2864903", "10.1088/0004-637x/740/2/91", "10.1088/0004-637x/746/2/173", "10.1088/0004-637x/763/2/148", "10.1088/0067-0049/204/2/17", "10.1088/0004-6256/150/4/111", "10.1088/1742-6596/1036/1/012011", "10.1093/mnras/stv2376", "10.3847/1538-4365/aace58", "10.3847/1538-4357/aa7743"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030458", "title": "Towards Better Bus Networks: A Visual Analytics Approach", "year": "2020", "conferenceName": "VAST", "authors": "Di Weng;Chengbo Zheng;Zikun Deng;Mingze Ma;Jie Bao 0003;Yu Zheng 0004;Mingliang Xu;Yingcai Wu", "citationCount": "1", "affiliation": "Wu, YC (Corresponding Author), Zhejiang Univ, State Key Lab CAD \\& CG, Hangzhou, Peoples R China. Wu, YC (Corresponding Author), Zhejiang Lab, Hangzhou, Peoples R China. Weng, Di; Deng, Zikun; Wu, Yingcai, Zhejiang Univ, State Key Lab CAD \\& CG, Hangzhou, Peoples R China. Weng, Di; Zheng, Chengbo; Deng, Zikun; Ma, Mingze; Wu, Yingcai, Zhejiang Lab, Hangzhou, Peoples R China. Bao, Jie; Zheng, Yu, JD Intelligent Cities Res, Beijing, Peoples R China. Bao, Jie; Zheng, Yu, JD Digits, JD Intelligent Cities Business Unit, Beijing, Peoples R China. Xu, Mingliang, Zhengzhou Univ, Sch Informat Engn, Zhengzhou, Peoples R China. Xu, Mingliang, Zhengzhou Univ, Henan Inst Adv Technol, Zhengzhou, Peoples R China.", "countries": "China", "abstract": "Bus routes are typically updated every 3–5 years to meet constantly changing travel demands. However, identifying deficient bus routes and finding their optimal replacements remain challenging due to the difficulties in analyzing a complex bus network and the large solution space comprising alternative routes. Most of the automated approaches cannot produce satisfactory results in real-world settings without laborious inspection and evaluation of the candidates. The limitations observed in these approaches motivate us to collaborate with domain experts and propose a visual analytics solution for the performance analysis and incremental planning of bus routes based on an existing bus network. Developing such a solution involves three major challenges, namely, a) the in-depth analysis of complex bus route networks, b) the interactive generation of improved route candidates, and c) the effective evaluation of alternative bus routes. For challenge a, we employ an overview-to-detail approach by dividing the analysis of a complex bus network into three levels to facilitate the efficient identification of deficient routes. For challenge b, we improve a route generation model and interpret the performance of the generation with tailored visualizations. For challenge c, we incorporate a conflict resolution strategy in the progressive decision-making process to assist users in evaluating the alternative routes and finding the most optimal one. The proposed system is evaluated with two usage scenarios based on real-world data and received positive feedback from the experts. Index Terms-Bus route planning, spatial decision-making, urban data visual analytics", "keywords": "Bus route planning,spatial decision-making,urban data visual analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030458", "refList": ["10.1016/s0301-4622(01)00179-x", "10.1126/science.246.4932.897", "10.1111/j.1365-2966.2012.21402.x", "10.1103/revmodphys.38.256", "10.1007/978-3-319-16823-4", "10.1088/0004-637x/723/1/364", "10.1093/mnras/sty1690", "10.1038/s41586-020-2300-2", "10.1109/mcg.2017.20", "10.1007/s11047-013-9401-x", "10.1109/tvcg.2007.2", "10.1086/320977", "10.1145/37402.37406", "10.1109/tvcg.2019.2934259", "10.1088/0067-0049/195/1/11", "10.1038/380603a0", "10.1038/35035159", "10.1093/mnras/stz261", "10.1126/science.1177894", "10.1051/aas:2000331", "10.1109/access.2019.2927815", "10.1088/1748-3182/9/3/036016", "10.1111/cgf.12605", "10.1093/mnras/stw248", "10.1088/2041-8205/780/2/l33", "10.1088/1538-3873/aa5b73", "10.1086/187670", "10.1109/pacificvis.2012.6183573", "10.1016/j.newast.2015.06.003", "10.1080/03081079.2014.997527", "10.1093/mnras/stu2058", "10.1038/nature03597", "10.1093/mnras/stw1554", "10.1111/cgf.13705", "10.1146/annurev-astro-091916-055240", "10.1186/1475-2891-13-100", "10.1038/srep19948", "10.1109/29.17539", "10.1016/0012-1606(61)90034-3", "10.1162/artl.2010.16.2.16202", "10.1086/306949", "10.1088/0004-637x/814/1/40", "10.1093/mnras/stx1976", "10.1109/scivis47405.2019.8968943", "10.1109/scivis47405.2019.8968917", "10.1109/scivis47405.2019.8968854", "10.1146/annurev.astro.36.1.267", "10.1086/306025", "10.3847/2041-8213/ab700c", "10.1086/127416", "10.1126/science.aad9029", "10.1038/srep07643", "10.1016/j.ascom.2015.05.004", "10.1088/0067-0049/192/1/9", "10.1088/0004-637x/762/2/109", "10.1109/scivis47405.2019.8968855", "10.1088/1367-2630/10/12/125008", "10.1109/tac.2005.864190", "10.1086/340187"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.13673", "year": "2019", "title": "Multiple Views: different meanings and collocated words", "conferenceName": "EuroVis", "authors": "Jonathan C. Roberts;Hayder Al{-}Maneea;Peter W. S. Butcher;Robert Lew;Geraint Rees;Nirwan Sharma;Ana Frankenberg{-}Garcia", "citationCount": "1", "affiliation": "Roberts, JC (Corresponding Author), Bangor Univ, Bangor, Gwynedd, Wales.\nRoberts, J. C.; Al-maneea, H.; Butcher, P. W. S.; Sharma, N., Bangor Univ, Bangor, Gwynedd, Wales.\nAl-maneea, H., Basrah Univ, Basrah, Iraq.\nLew, R.; Rees, G., Adam Mickiewicz Univ, Poznan, Poland.\nFrankenberg-Garcia, A., Univ Surrey, Guildford, Surrey, England.", "countries": "Poland;Wales;England;Iraq", "abstract": "We report on an in-depth corpus linguistic study on multiple views' terminology and word collocation. We take a broad interpretation of these terms, and explore the meaning and diversity of their use in visualisation literature. First we explore senses of the term multiple views' (e.g., multiple views' can mean juxtaposition, many viewport projections or several alternative opinions). Second, we investigate term popularity and frequency of occurrences, investigating usage of multiple' and view' (e.g., multiple views, multiple visualisations, multiple sets). Third, we investigate word collocations and terms that have a similar sense (e.g., multiple views, side-by-side, small multiples). We built and used several corpora, including a 6-million-word corpus of all IEEE Visualisation conference articles published in IEEE Transactions on Visualisation and Computer Graphics 2012 to 2017. We draw on our substantial experience from early work in coordinated and multiple views, and with collocation analysis develop several lists of terms. This research provides insight into term use, a reference for novice and expert authors in visualisation, and contributes a taxonomy of multiple view' terms.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13673", "refList": ["10.1109/tvcg.2017.2744359", "10.1109/38.31462", "10.1109/cmv.2003.1215002", "10.2307/2289444", "10.1016/j.ijhcs.2011.02.007", "10.1017/s0022112091210654", "10.1016/b978-008044531-1/50426-7", "10.1109/cmv.2003.1215001", "10.1109/tvcg.2013.134", "10.1117/12.378894", "10.1037/0096-1523.21.6.1494", "10.1057/palgrave.ivs.9500086", "10.1109/iv.2011.42", "10.1109/tvcg.2017.2744199", "10.4324/9780203810088", "10.1145/1321440.1321580", "10.1109/tvcg.2015.2467271", "10.1016/j.learninstruc.2006.03.001", "10.1145/345513.345282", "10.1007/s40607-014-0009-9", "10.1109/tvcg.2017.2743859", "10.1109/infvis.1997.636761", "10.1109/tvcg.2013.219", "10.1007/978-3-319-55627-7", "10.1109/tvcg.2009.111", "10.1109/iv.2008.21", "10.1109/infvis.2002.1173157", "10.1109/mcg.2014.82", "10.1145/3143699.3143717", "10.1109/tvcg.2012.226", "10.1145/345513.345271", "10.2478/jazcas-2018-0006", "10.1145/2556288.2556969", "10.1109/visual.1998.745282", "10.1145/1276377.1276427", "10.1109/infvis.2001.963283", "10.1007/978-1-4471-6497-5\\_1", "10.1109/visual.1994.346302", "10.1057/palgrave.ivs.9500068", "10.1109/tvcg.2006.160", "10.1109/visual.1990.146374", "10.1109/tvcg.2016.2614803", "10.1177/1473871611416549", "10.1109/tvcg.2017.2745878", "10.1109/tvcg.2006.69", "10.1109/tpami.1983.4767367", "10.1109/visual.1991.175794", "10.1109/tvcg.2017.2744159", "10.1109/tvcg.2017.2744198", "10.1109/32.328995", "10.1016/j.jeap.2018.07.003", "10.1016/j.geomorph.2012.08.021", "10.1109/tvcg.2014.2346920", "10.1109/2.917550", "10.1017/s0958344018000150", "10.1109/tvcg.2009.94", "10.1179/2051819613z.0000000003", "10.1109/vast.2008.4677370", "10.1117/12.309533", "10.1109/tvcg.2014.2346747", "10.1075/ijcl.13.4.06ray", "10.1007/s12650-015-0323-9", "10.1109/tvcg.2006.178", "10.1109/tvcg.2016.2615308", "10.2307/1269768", "10.2307/4132312", "10.1109/tvcg.2018.2864903", "10.1109/mis.2006.100", "10.1109/iv.1998.694193", "10.1007/s11192-015-1830-0", "10.1109/tvcg.2017.2744080", "10.1111/j.1467-9280.1997.tb00442.x", "10.1109/cmv.2007.20", "10.1109/infvis.2003.1249006", "10.1109/tvcg.2017.2745941", "10.1016/s1364-6613(99)01332-7", "10.1145/989863.989893", "10.1109/tse.1985.232211", "10.1109/tvcg.2017.2744184", "10.1109/infvis.2004.12", "10.1075/ijcl.17.3.04har", "10.1109/tvcg.2010.179", "10.1016/j.jss.2006.05.024", "10.1109/cmv.2003.1215005", "10.1109/tvcg.2017.2744358", "10.1145/2992154.2996365", "10.1109/tvcg.2016.2598827"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030338", "title": "Composition and Configuration Patterns in Multiple-View Visualizations", "year": "2020", "conferenceName": "InfoVis", "authors": "Xi Chen;Wei Zeng 0004;Yanna Lin;Hayder Al-Maneea;Jonathan Roberts 0002;Remco Chang", "citationCount": "0", "affiliation": "Zeng, W (Corresponding Author), Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. Chen, Xi; Zeng, Wei; Lin, Yanna, Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. AI-maneea, Hayder Mahdi; Roberts, Jonathan, Bangor Univ, Bangor, Gwynedd, Wales. Chang, Remco, Tufts Univ, Medford, MA 02155 USA.", "countries": "USA;Wales;China", "abstract": "Multiple-view visualization (MV) is a layout design technique often employed to help users see a large number of data attributes and values in a single cohesive representation. Because of its generalizability, the MV design has been widely adopted by the visualization community to help users examine and interact with large, complex, and high-dimensional data. However, although ubiquitous, there has been little work to categorize and analyze MVs in order to better understand its design space. As a result, there has been little to no guideline in how to use the MV design effectively. In this paper, we present an in-depth study of how MVs are designed in practice. We focus on two fundamental measures of multiple-view patterns: composition, which quantifies what view types and how many are there; and configuration, which characterizes spatial arrangement of view layouts in the display space. We build a new dataset containing 360 images of MVs collected from IEEE VIS, EuroVis, and PacificVis publications 2011 to 2019, and make fine-grained annotations of view types and layouts for these visualization images. From this data we conduct composition and configuration analyses using quantitative metrics of term frequency and layout topology. We identify common practices around MVs, including relationship of view types, popular view layouts, and correlation between view types and layouts. We combine the findings into a MV recommendation system, providing interactive tools to explore the design space, and support example-based design.", "keywords": "Multiple views,design pattern,quantitative analysis,example-based design", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030338", "refList": ["10.1109/tvcg.2018.2865235", "10.1109/tvcg.2016.2615308", "10.1145/2642918.2647398", "10.1177/1473871611416549", "10.1109/tvcg.2019.2934810", "10.1109/tvcg.2014.48", "10.1109/tvcg.2018.2864903", "10.1145/345513.345271", "10.1109/iv.1998.694193", "10.1109/tvcg.2007.70594", "10.1109/tvcg.2017.2744019", "10.1109/tvcg.2011.185", "10.1109/tvcg.2015.2467194", "10.1109/visual.1991.175815", "10.14778/2831360.2831371", "10.1109/mcg.2019.2924636", "10.1111/cgf.13673", "10.1111/cgf.12131", "10.1109/tvcg.2017.2744198", "10.1145/108360.108361", "10.1109/vl.1996.545307", "10.1109/tvcg.2017.2745140", "10.1109/cmv.2007.20", "10.1145/198366.198376", "10.1145/2508363.2508405", "10.1111/cgf.12114", "10.1109/icde.2018.00019", "10.1109/tvcg.2017.2787113", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13380", "10.1111/cgf.12902", "10.1109/vast.2015.7347628", "10.2307/2288400", "10.1109/infvis.2004.12", "10.1145/102377.115768", "10.1109/tvcg.2009.179", "10.1109/2945.981851", "10.1109/tvcg.2007.70521", "10.1109/pacificvis.2012.6183556", "10.1145/2213836", "10.1109/tvcg.2013.234", "10.1109/iv.2008.87"], "wos": 1, "children": [], "len": 1}], "len": 3}], "len": 17}, "index": 787, "embedding": [3.8603949546813965, 2.3954269886016846, 3.7781267166137695, 1.8843742609024048, -0.6602144837379456, 0.16650904715061188, -0.706787109375, -0.9610782265663147, -0.43060755729675293, -0.8515991568565369, 0.18917465209960938, 3.4105312824249268, -0.13366082310676575, 6.505318641662598, 4.9827985763549805, 2.271372079849243, 3.8297536373138428, 0.06482167541980743, -0.10810806602239609, -0.534444272518158, -0.06630208343267441, -0.6113291382789612, 3.3214991092681885, 0.028359483927488327, 3.2532122135162354, 0.08472851663827896, -0.5077023506164551, 2.611442804336548, 2.089101791381836, 2.7315728664398193, 3.789501905441284, 4.142601490020752], "projection": [-3.7070369720458984, 7.993056774139404], "size": 9, "height": 3, "width": 6}