{"data": {"doi": "10.1109/tvcg.2018.2864909", "title": "Hypothetical Outcome Plots Help Untrained Observers Judge Trends in Ambiguous Data", "year": "2018", "conferenceName": "InfoVis", "authors": "Alex Kale;Francis Nguyen;Matthew Kay;Jessica Hullman", "citationCount": "10", "affiliation": "Kale, A (Corresponding Author), Univ Washington, Seattle, WA 98195 USA. Kale, Alex; Nguyen, Francis, Univ Washington, Seattle, WA 98195 USA. Kay, Matthew, Univ Michigan, Ann Arbor, MI 48109 USA. Hullman, Jessica, Northwestern Univ, Evanston, IL 60208 USA.", "countries": "USA", "abstract": "Animated representations of outcomes drawn from distributions (hypothetical outcome plots, or HOPs) are used in the media and other public venues to communicate uncertainty. HOPs greatly improve multivariate probability estimation over conventional static uncertainty visualizations and leverage the ability of the visual system to quickly, accurately, and automatically process the summary statistical properties of ensembles. However, it is unclear how well HOPs support applied tasks resembling real world judgments posed in uncertainty communication. We identify and motivate an appropriate task to investigate realistic judgments of uncertainty in the public domain through a qualitative analysis of uncertainty visualizations in the news. We contribute two crowdsourced experiments comparing the effectiveness of HOPs, error bars, and line ensembles for supporting perceptual decision-making from visualized uncertainty. Participants infer which of two possible underlying trends is more likely to have produced a sample of time series data by referencing uncertainty visualizations which depict the two trends with variability due to sampling error. By modeling each participant's accuracy as a function of the level of evidence presented over many repeated judgments, we find that observers are able to correctly infer the underlying trend in samples conveying a lower level of evidence when using HOPs rather than static aggregate uncertainty visualizations as a decision aid. Modeling approaches like ours contribute theoretically grounded and richly descriptive accounts of user perceptions to visualization evaluation.", "keywords": "uncertainty visualization,hypothetical outcome plots,psychometric functions", "link": "http://dx.doi.org/10.1109/TVCG.2018.2864909", "refList": ["10.1006/obhd.1997.2679", "10.1109/tvcg.2017.2744359", "10.1186/s41235-017-0076-1", "10.1126/science.216.4550.1138", "10.1097/00001888-199805000-00024", "10.1371/journal.pmed.0020124", "10.1037/0003-066x.39.12.1372", "10.3758/s13423-012-0247-5", "10.1111/j.0956-7976.2004.00715.x", "10.1371/journal.pone.0142444", "10.1006/ijhc.2002.1017", "10.1037/xap0000037", "10.1111/j.1467-9280.2008.02098.x", "10.1016/s0042-6989(97)00340-4", "10.1037/a0025185", "10.1006/ijhc.1017", "10.1111/risa.12462", "10.1016/s0098-3004(97)00011-3", "10.1177/0956797610363543", "10.3758/s13423-013-0572-3", "10.1109/tvcg.2011.175", "10.3138/3645-4v22-0m23-3t52", "10.3758/bf03194544", "10.1016/s0959-4752(98)00051-6", "10.1121/1.4733540", "10.1109/tvcg.2007.70518", "10.1016/j.ijforecast.2012.02.006", "10.1167/15.4.5", "10.1037/1082-989x.10.4.389", "10.1016/s0364-0213(87)80026-5", "10.2307/1419876", "10.1016/j.tics.2011.01.003", "10.1037/0033-295x.102.4.684", "10.1109/tvcg.2014.2346298", "10.1016/j.neuron.2016.03.025", "10.1016/s0098-3004(97)00005-8", "10.1016/j.obhdp.2011.07.002", "10.1016/j.proeps.2009.09.160", "10.1037/h0031322"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934399", "title": "Illusion of Causality in Visualized Data", "year": "2019", "conferenceName": "InfoVis", "authors": "Cindy Xiong;Joel Shapiro;Jessica Hullman;Steven Franconeri", "citationCount": "4", "affiliation": "Xiong, C (Corresponding Author), Northwestern Univ, Evanston, IL 60208 USA. Xiong, Cindy; Hullman, Jessica; Franconeri, Steven, Northwestern Univ, Evanston, IL 60208 USA. Shapiro, Joel, Northwestern Univ, Kellogg Sch Management, Evanston, IL 60208 USA.", "countries": "USA", "abstract": "Students who eat breakfast more frequently tend to have a higher grade point average. From this data, many people might confidently state that a before-school breakfast program would lead to higher grades. This is a reasoning error, because correlation does not necessarily indicate causation – X and Y can be correlated without one directly causing the other. While this error is pervasive, its prevalence might be amplified or mitigated by the way that the data is presented to a viewer. Across three crowdsourced experiments, we examined whether how simple data relations are presented would mitigate this reasoning error. The first experiment tested examples similar to the breakfast-GPA relation, varying in the plausibility of the causal link. We asked participants to rate their level of agreement that the relation was correlated, which they rated appropriately as high. However, participants also expressed high agreement with a causal interpretation of the data. Levels of support for the causal interpretation were not equally strong across visualization types: causality ratings were highest for text descriptions and bar graphs, but weaker for scatter plots. But is this effect driven by bar graphs aggregating data into two groups or by the visual encoding type? We isolated data aggregation versus visual encoding type and examined their individual effect on perceived causality. Overall, different visualization designs afford different cognitive reasoning affordances across the same data. High levels of data aggregation by graphs tend to be associated with higher perceived causality in data. Participants perceived line and dot visual encodings as more causal than bar encodings. Our results demonstrate how some visualization designs trigger stronger causal links while choosing others can help mitigate unwarranted perceptions of causality.", "keywords": "Information Visualization,Correlation and Causation,Visualization Design,Reasoning Affordance", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934399", "refList": ["10.1109/tvcg.2014.2346979", "10.1109/tvcg.2018.2864909", "10.2307/2277140", "10.2307/2276829", "10.3389/fpsyg.2015.00888", "10.3758/s13423-012-0247-5", "10.1177/1075547012458290", "10.1109/tvcg.2014.2346419", "10.1207/s15516709cog0000\\_70", "10.1037/0003-066x.53.4.449", "10.1109/tvcg.2017.2743898", "10.1109/vast.2017.8585665", "10.1159/000323281", "10.1016/j.crm.2015.06.007", "10.1002/9781119055259", "10.1002/acp.2350050106", "10.1136/bmj.g7015", "10.3758/bf03201236", "10.1073/pnas.1608845113", "10.1109/tvcg.2013.173", "10.1109/beliv.2018.8634267", "10.1145/3025453.3025512", "10.1109/tvcg.2016.2598594", "10.2307/2288400", "10.1080/00461520.2014.921572", "10.1002/jhbs.20078", "10.1016/s0010-0277(00)00060-3", "10.1016/0885-2014(88)90027-5", "10.1016/bs.plm.2016.11.006", "10.1016/j.cognition.2012.04.005", "10.1109/tvcg.2014.2346298", "10.1257/aer.100.2.573", "10.1145/2858036.2858558"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3028958", "title": "Auditing the Sensitivity of Graph-based Ranking with Visual Analytics", "year": "2020", "conferenceName": "VAST", "authors": "Tiankai Xie;Yuxin Ma;Hanghang Tong;My T. Thai;Ross Maciejewski", "citationCount": "0", "affiliation": "Xie, TK (Corresponding Author), Arizona State Univ, Tempe, AZ 85287 USA. Xie, Tiankai; Ma, Yuxin; Maciejewski, Ross, Arizona State Univ, Tempe, AZ 85287 USA. Tong, Hanghang, Univ Illinois, Urbana, IL USA. Thai, My T., Univ Florida, Gainesville, FL 32611 USA.", "countries": "USA", "abstract": "Graph mining plays a pivotal role across a number of disciplines, and a variety of algorithms have been developed to answer who/what type questions. For example, what items shall we recommend to a given user on an e-commerce platform? The answers to such questions are typically returned in the form of a ranked list, and graph-based ranking methods are widely used in industrial information retrieval settings. However, these ranking algorithms have a variety of sensitivities, and even small changes in rank can lead to vast reductions in product sales and page hits. As such, there is a need for tools and methods that can help model developers and analysts explore the sensitivities of graph ranking algorithms with respect to perturbations within the graph structure. In this paper, we present a visual analytics framework for explaining and exploring the sensitivity of any graph-based ranking algorithm by performing perturbation-based what-if analysis. We demonstrate our framework through three case studies inspecting the sensitivity of two classic graph-based ranking algorithms (PageRank and HITS) as applied to rankings in political news media and social networks.", "keywords": "Graph-based ranking,sensitivity analysis,visual analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028958", "refList": ["10.1109/wsc.2017.8247800", "10.1023/a:1022649401552", "10.1515/1559-0410.11416", "10.1109/tvcg.2016.2598919", "10.1177/1473871611416549", "10.1109/tvcg.2019.2934630", "10.1140/epjds29", "10.1109/tvcg.2019.2934670", "10.1016/j.eswa.2015.09.004", "10.1145/2702123.2702509", "10.1016/j.visinf.2018.12.001", "10.2307/3002000", "10.1109/tvcg.2019.2934399", "10.1007/s41060-016-0032-z", "10.1111/cgf.13198", "10.14778/2350229.2350254", "10.1145/2939672.2939764", "10.1016/j.visinf.2017.01.006", "10.1145/2858036.2858529", "10.1109/vast.2017.8585647", "10.1007/bf01187020", "10.1109/icdm.2015.26", "10.1145/2362383.2362387", "10.1177/0049124104268644", "10.1109/vast.2011.6102442", "10.1109/infvis.2003.1249025", "10.1109/tvcg.2018.2864475", "10.1109/tvcg.2007.70528", "10.1109/tvcg.2015.2467691", "10.1111/cgf.13210", "10.1214/aos/1176344136", "10.1109/tvcg.2015.2424872", "10.1016/j.visinf.2018.09.001", "10.1177/089443939100900106", "10.1109/tvcg.2015.2467931", "10.1162/neco.1997.9.8.1735", "10.1007/s11162-011-9241-4", "10.1111/cgf.13680", "10.1145/3065386", "10.1109/tvcg.2018.2864889", "10.1177/003804070808100402", "10.1109/icdm.2010.62", "10.1038/s41598-020-59669-x", "10.1162/153244303321897717", "10.1109/tvcg.2019.2934619", "10.1007/bf00356088", "10.1109/tvcg.2016.2598432", "10.1109/tvcg.2016.2598831"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030465", "title": "Visual Causality Analysis of Event Sequence Data", "year": "2020", "conferenceName": "VAST", "authors": "Zhuochen Jin;Shunan Guo;Nan Chen;Daniel Weiskopf;David Gotz;Nan Cao", "citationCount": "0", "affiliation": "Cao, N (Corresponding Author), Tongji Univ, IDVx Lab, Shanghai, Peoples R China. Jin, Zhuochen; Guo, Shunan; Chen, Nan; Cao, Nan, Tongji Univ, IDVx Lab, Shanghai, Peoples R China. Weiskopf, Daniel, Univ Stuttgart, Stuttgart, Germany. Gotz, David, Univ N Carolina, Chapel Hill, NC 27515 USA.", "countries": "USA;Germany;China", "abstract": "Causality is crucial to understanding the mechanisms behind complex systems and making decisions that lead to intended outcomes. Event sequence data is widely collected from many real-world processes, such as electronic health records, web clickstreams, and financial transactions, which transmit a great deal of information reflecting the causal relations among event types. Unfortunately, recovering causalities from observational event sequences is challenging, as the heterogeneous and high-dimensional event variables are often connected to rather complex underlying event excitation mechanisms that are hard to infer from limited observations. Many existing automated causal analysis techniques suffer from poor explainability and fail to include an adequate amount of human knowledge. In this paper, we introduce a visual analytics method for recovering causalities in event sequence data. We extend the Granger causality analysis algorithm on Hawkes processes to incorporate user feedback into causal model refinement. The visualization system includes an interactive causal analysis framework that supports bottom-up causal exploration, iterative causal verification and refinement, and causal comparison through a set of novel visualizations and interactions. We report two forms of evaluation: a quantitative evaluation of the model improvements resulting from the user-feedback mechanism, and a qualitative evaluation through case studies in different application domains to demonstrate the usefulness of the system.", "keywords": "Event sequence data,causality analysis,visual analytics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030465", "refList": ["10.5555/1642718", "10.1109/tvcg.2018.2865022", "10.5555/2074094.2074151", "10.1109/tvcg.2016.2618797", "10.1073/pnas.1320645111", "10.1109/tvcg.2017.2744843", "10.1109/iv.2017.69", "10.1109/tvcg.2019.2934399", "10.1145/3172944.3173007", "10.5555/1795555", "10.1109/mcg.2005.102", "10.1145/381641.381653", "10.1162/153244301753344614", "10.1111/cgf.14034", "10.1111/cgf.13198", "10.1017/cbo9780511519857", "10.1007/s10462-016-9475-9", "10.1075/ssol.2.2.07bor", "10.1007/978-1-4614-3223-4\\_3", "10.1109/infvis.2003.1249025", "10.1007/978-94-007-6094-313", "10.1145/2858036.2858387", "10.1109/tvcg.2007.70528", "10.1109/tvcg.2017.2674958", "10.1147/sj.454.0801", "10.1109/tvcg.2013.119", "10.1145/3173574.3173711", "10.1016/j.erss.2017.06.034", "10.1109/visual.2019.8933695", "10.1007/s11665-016-2173-6", "10.1016/0377-0427(87)90125-7", "10.2307/3601125", "10.1016/b978-0-444-88738-2.50018-x", "10.1109/mcg.2006.70", "10.1109/tvcg.2018.2865145", "10.1017/s1351324997001502", "10.1109/tvcg.2010.179", "10.1214/aos/1176344552", "10.1109/mcg.2009.22", "10.1007/978-3-319-26633-6\\_13", "10.1080/10447318.2014.905422", "10.1016/j.visinf.2019.03.004", "10.1057/palgrave.ivs.9500074", "10.1007/978-1-4614-3223-4"], "wos": 1, "children": [], "len": 1}], "len": 5}, {"doi": "10.1109/tvcg.2020.3028891", "title": "A Structured Review of Data Management Technology for Interactive Visualization and Analysis", "year": "2020", "conferenceName": "InfoVis", "authors": "Leilani Battle;Carlos Scheidegger", "citationCount": "0", "affiliation": "Battle, L (Corresponding Author), Univ Maryland, Dept Comp Sci, College Pk, MD 20742 USA. Battle, Leilani, Univ Maryland, Dept Comp Sci, College Pk, MD 20742 USA. Scheidegger, Carlos, Univ Arizona, Dept Comp Sci, HDC Lab, Tucson, AZ 85721 USA.", "countries": "USA", "abstract": "In the last two decades, interactive visualization and analysis have become a central tool in data-driven decision making. Concurrently to the contributions in data visualization, research in data management has produced technology that directly benefits interactive analysis. Here, we contribute a systematic review of 30 years of work in this adjacent field, and highlight techniques and principles we believe to be underappreciated in visualization work. We structure our review along two axes. First, we use task taxonomies from the visualization literature to structure the space of interactions in usual systems. Second, we created a categorization of data management work that strikes a balance between specificity and generality. Concretely, we contribute a characterization of 131 research papers along these two axes. We find that five notions in data management venues fit interactive visualization systems well: materialized views, approximate query processing, user modeling and query prediction, muiti-query optimization, lineage techniques, and indexing techniques. In addition, we find a preponderance of work in materialized views and approximate query processing, most targeting a limited subset of the interaction tasks in the taxonomy we used. This suggests natural avenues of future research both in visualization and data management. Our categorization both changes how we visualization researchers design and build our systems, and highlights where future work is necessary.", "keywords": "", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028891", "refList": ["10.1109/tvcg.2012.233", "10.1016/s0022-5371(74)80015-0", "10.1109/tvcg.2017.2744359", "10.1037/0096-3445.136.4.623", "10.1109/tvcg.2015.2467732", "10.1109/tvcg.2012.196", "10.1037/a0029856", "10.1109/tvcg.2014.2346979", "10.1037/h0030300", "10.1109/tvcg.2016.2598918", "10.1109/beliv.2018.8634420", "10.1109/tvcg.2018.2864909", "10.1111/cgf.13079", "10.3389/fpsyg.2012.00355", "10.1145/2858036.2858465", "10.1080/01621459.1989.10478821", "10.1037/0278-7393.24.3.732", "10.1109/tvcg.2011.127", "10.1145/2858036.2858063", "10.4249/scholarpedia.3325", "10.4324/9781410611949", "10.1111/cgf.13444", "10.1145/2993901.2993909", "10.1037/0033-295x.96.2.267", "10.1006/ijhc.1017", "10.1086/405615", "10.1109/tvcg.2019.2934801", "10.1038/17953", "10.1037/xhp0000314", "10.1109/tvcg.2019.2934400", "10.1145/2470654.2470723", "10.1037/0096-1523.16.2.332", "10.1167/16.5.11", "10.3758/s13423-016-1174-7", "10.3758/bf03207704", "10.1146/annurev.psych.55.090902.141415", "10.2307/2288400", "10.3758/bf03204258", "10.1109/tvcg.2011.279", "10.1109/vissoft.2014.36", "10.3758/s13423-011-0055-3", "10.1145/3025453.3025922", "10.1109/tvcg.2019.2934284", "10.3758/bf03210498", "10.3758/bf03200774", "10.2307/1419876", "10.1038/s41562-017-0058", "10.1109/tvcg.2010.237", "10.1109/pacificvis.2012.6183556", "10.1109/infvis.1997.636792", "10.1093/acprof:oso/9780198523192.003.0005", "10.1073/pnas.1117465109", "10.1109/tvcg.2013.234", "10.1038/nn.3655", "10.1111/cgf.12379", "10.1146/annurev-psych-010416-044232", "10.1111/cgf.13695", "10.1037/0033-295x.107.3.500", "10.1109/tvcg.2013.183", "10.1146/annurev.psych.53.100901.135125", "10.1037//0022-3514.79.6.995", "10.1559/152304003100010929", "10.1109/tvcg.2018.2865147", "10.1037/0096-1523.18.3.849", "10.1111/j.1467-8659.2009.01694.x", "10.1145/3290605.3300771"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3028984", "title": "Bayesian-Assisted Inference from Visualized Data", "year": "2020", "conferenceName": "InfoVis", "authors": "Yea-Seul Kim;Paula Kayongo;Madeleine Grunde-McLaughlin;Jessica Hullman", "citationCount": "0", "affiliation": "Kim, YS (Corresponding Author), Univ Washington, Seattle, WA 98195 USA. Kim, Yea-Seul, Univ Washington, Seattle, WA 98195 USA. Kayongo, Paula; Hullman, Jessica, Northwestern Univ, Evanston, IL 60208 USA. Grunde-McLaughlin, Madeleine, Univ Penn, Philadelphia, PA 19104 USA.", "countries": "USA", "abstract": "A Bayesian view of data interpretation suggests that a visualization user should update their existing beliefs about a parameter's value in accordance with the amount of information about the parameter value captured by the new observations. Extending recent work applying Bayesian models to understand and evaluate belief updating from visualizations, we show how the predictions of Bayesian inference can be used to guide more rational belief updating. We design a Bayesian inference-assisted uncertainty analogy that numerically relates uncertainty in observed data to the user's subjective uncertainty, and a posterior visualization that prescribes how a user should update their beliefs given their prior beliefs and the observed data. In a pre-registered experiment on 4,800 people, we find that when a newly observed data sample is relatively small (N=158), both techniques reliably improve people's Bayesian updating on average compared to the current best practice of visualizing uncertainty in the observed data. For large data samples (N=5208), where people's updated beliefs tend to deviate more strongly from the prescriptions of a Bayesian model, we find evidence that the effectiveness of the two forms of Bayesian assistance may depend on people's proclivity toward trusting the source of the data. We discuss how our results provide insight into individual processes of belief updating and subjective uncertainty, and how understanding these aspects of interpretation paves the way for more sophisticated interactive visualizations for analysis and communication.", "keywords": "Bayesian cognition,Belief updating,Uncertainty visualization,Adaptive visualization", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028984", "refList": ["10.1080/19336896.2018.1471922", "10.3758/bf03196976", "10.1037/1089-2680.2.2.175", "10.1016/j.jclinepi.2009.06.003", "10.1109/tvcg.2014.2346979", "10.1109/tvcg.2018.2864909", "10.1145/3173574.3173718", "10.1006/cogp.1998.0702", "10.1086/209424", "10.1109/tvcg.2012.199", "10.7717/peerj-cs.55", "10.1145/2993901.2993919", "10.1371/journal.pone.0142444", "10.1080/13875868.2015.1137577", "10.1037/1076-898x.3.1.3", "10.1109/tvcg.2019.2934287", "10.1109/tvcg.2017.2743898", "10.1145/3025453.3025592", "10.1057/ivs.2008.13", "10.1214/ss/1015346320", "10.1016/0749-5978(92)90055-c", "10.1080/13546780542000005", "10.1109/tvcg.2015.2467671", "10.1109/tvcg.2016.2607204", "10.3758/s13423-016-1174-7", "10.1016/j.cag.2014.03.002", "10.1198/016214505000000105", "10.1109/tvcg.2012.279", "10.1111/1467-8624.00232", "10.1111/j.1467-9280.2006.01780.x", "10.2307/2682899", "10.1080/00335557743000053", "10.1109/tvcg.2010.177", "10.1057/ivs.2008.28", "10.1109/tvcg.2018.2864889", "10.1109/tvcg.2013.153", "10.1109/tvcg.2015.2467758", "10.1145/2858036.2858558", "10.1287/mnsc.46.8.1100.12023", "10.1016/j.tics.2003.08.012", "10.1111/j.1467-8659.2009.01694.x"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030426", "title": "Introducing Layers of Meaning (LoM): A Framework to Reduce Semantic Distance of Visualization In Humanistic Research", "year": "2020", "conferenceName": "InfoVis", "authors": "Houda Lamqaddam;Andrew Vande Moere;Vero Vanden Abeele;Koenraad Brosens;Katrien Verbert", "citationCount": "0", "affiliation": "Lamqaddam, H (Corresponding Author), Katholieke Univ Leuven, Leuven, Belgium. Lamqaddam, Houda; Vande Moere, Andrew; Vanden Abeele, Vero; Brosens, Koenraad; Verbert, Katrien, Katholieke Univ Leuven, Leuven, Belgium.", "countries": "Belgium", "abstract": "Information visualization (infovis) is a powerful tool for exploring rich datasets. Within humanistic research, rich qualitative data and domain culture make traditional infovis approaches appear reductive and disconnected, leading to low adoption. In this paper, we use a multi-step approach to scrutinize the relationship between infovis and the humanities and suggest new directions for it. We first look into infovis from the humanistic perspective by exploring the humanistic literature around infovis. We validate and expand those findings though a co-design workshop with humanist and infovis experts. Then, we translate our findings into guidelines for designers and conduct a design critique exercise to explore their effect on the perception of humanist researchers. Based on these steps, we introduce Layers of Meaning, a framework to reduce the semantic distance between humanist researchers and visualizations of their research material, by grounding infovis tools in time and space, physicality, terminology, nuance, and provenance.", "keywords": "Infovis,Humanities,Digital Humanities", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030426", "refList": ["10.1177/1473871611416549", "10.1109/tvcg.2014.2346979", "10.1016/j.jesp.2013.03.013", "10.1109/tvcg.2018.2864909", "10.1145/2858036.2858465", "10.1145/1553374.1553527", "10.1037/1076-898x.14.1.36", "10.1109/tvcg.2011.185", "10.2200/s00371ed1v01y201107aim013", "10.1145/3025453.3025912", "10.3758/s13423-018-1525-7", "10.1109/tvcg.2017.2743898", "10.1037/a0029146", "10.1109/infvis.2005.1532136", "10.1109/tvcg.2015.2467671", "10.1109/tvcg.2018.2864907", "10.3758/s13423-016-1174-7", "10.1136/bmj.312.7047.1654", "10.2307/2288400", "10.1085/jgp.7.2.235", "10.3758/s13423-017-1323-7", "10.1109/tvcg.2018.2810918", "10.1080/13803390500205718", "10.1016/s0364-0213(87)80026-5", "10.1109/tvcg.2018.2864884", "10.2307/1419876", "10.1109/tvcg.2010.161", "10.5281/zenodo", "10.1109/tvcg.2005.63", "10.1177/001872089203400503", "10.1126/science.220.4598.671", "10.2307/2289447", "10.1006/jesp.1996.0009", "10.1007/s10898-012-9951-y", "10.3758/s13423-017-1343-3", "10.1109/tvcg.2007.70515", "10.21105/joss.01686", "10.18637/jss.v080.i01", "10.1111/j.1467-8659.2009.01694.x", "10.1145/2702123.2702608"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030396", "title": "What Makes a Data-GIF Understandable?", "year": "2020", "conferenceName": "InfoVis", "authors": "Xinhuan Shu;Aoyu Wu;Junxiu Tang;Benjamin Bach;Yingcai Wu;Huamin Qu", "citationCount": "1", "affiliation": "Wu, YC (Corresponding Author), Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Peoples R China. Shu, Xinhuan; Tang, Junxiu; Wu, Yingcai, Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Peoples R China. Shu, Xinhuan; Wu, Aoyu; Qu, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Shu, Xinhuan, Zhejiang Univ, Hangzhou, Peoples R China. Bach, Benjamin, Univ Edinburgh, Edinburgh, Midlothian, Scotland.", "countries": "Scotland;China", "abstract": "GIFs are enjoying increasing popularity on social media as a format for data-driven storytelling with visualization; simple visual messages are embedded in short animations that usually last less than 15 seconds and are played in automatic repetition. In this paper, we ask the question, “What makes a data-GIF understandable?” While other storytelling formats such as data videos, infographics, or data comics are relatively well studied, we have little knowledge about the design factors and principles for “data-GIFs”. To close this gap, we provide results from semi-structured interviews and an online study with a total of 118 participants investigating the impact of design decisions on the understandability of data-GIFs. The study and our consequent analysis are informed by a systematic review and structured design space of 108 data-GIFs that we found online. Our results show the impact of design dimensions from our design space such as animation encoding, context preservation, or repetition on viewers understanding of the GIF's core message. The paper concludes with a list of suggestions for creating more effective Data-GIFs.", "keywords": "Data-GIFs,Data-driven Storytelling,Evaluation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030396", "refList": ["10.1109/tvcg.2016.2598647", "10.1016/j.visinf.2020.07.001", "10.1177/1473871615594652", "10.1109/tvcg.2014.2346424", "10.1111/cgf.13195", "10.1109/vlsicircuits18222.2020.9162811", "10.1109/tvcg.2018.2864909", "10.1109/tvcg.2018.2864903", "10.1145/2702123.2702431", "10.1016/j.visinf.2019.12.002", "10.1145/3274349", "10.1111/cgf.13444", "10.1145/3206505.3206552", "10.1145/3290605.3300280", "10.1109/jstqe.2020.3021589", "10.1145/2647868.2656408", "10.1006/ijhc.1017", "10.1145/3290605.3300335", "10.1007/s12650-020-00689-0", "10.1145/2818048.2819936", "10.1111/cgf.13325", "10.1145/2858036.2858387", "10.1145/3027063.3053139", "10.1145/3290605.3300474", "10.1109/tvcg.2016.2598920", "10.1109/tvcg.2018.2864899", "10.1145/3290605.3300483", "10.1145/3173574.3173612", "10.1145/2909132.2909255", "10.1109/tvcg.2016.2598620", "10.1016/j.learninstruc.2007.09.013", "10.1109/tvcg.2007.70539", "10.1109/tvcg.2008.125", "10.1145/3173574.3173909", "10.1109/tvcg.2019.2934397", "10.1111/cgf.13709", "10.1109/tvcg.2013.234", "10.1109/tvcg.2019.2934401", "10.1145/2858036.2858532", "10.1016/j.visinf.2020.08.001", "10.1109/tvcg.2010.179", "10.1109/cicc48029.2020.9075900"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/pacificvis48177.2020.7614", "year": "2020", "title": "Uncertainty Treemaps", "conferenceName": "PacificVis", "authors": "Max Sondag;Wouter Meulemans;Christoph Schulz;Kevin Verbeek;Daniel Weiskopf;Bettina Speckmann", "citationCount": "0", "affiliation": "Sondag, M (Corresponding Author), TU Eindhoven, Eindhoven, Netherlands.\nSondag, Max; Meulemans, Wouter; Verbeek, Kevin; Speckmann, Bettina, TU Eindhoven, Eindhoven, Netherlands.\nSchulz, Christoph; Weiskopf, Daniel, Univ Stuttgart, Stuttgart, Germany.", "countries": "Germany;Netherlands", "abstract": "Rectangular treemaps visualize hierarchical numerical data by recursively partitioning an input rectangle into smaller rectangles whose areas match the data. Numerical data often has uncertainty associated with it. To visualize uncertainty in a rectangular treemap, we identify two conflicting key requirements: (i) to assess the data value of a node in the hierarchy, the area of its rectangle should directly match its data value, and (ii) to facilitate comparison between data and uncertainty, uncertainty should be encoded using the same visual variable as the data, that is, area. We present Uncertainty Treemaps, which meet both requirements simultaneously by introducing the concept of hierarchical uncertainty masks. First, we define a new cost function that measures the quality of Uncertainty Treemaps. Then, we show how to adapt existing treemapping algorithms to support uncertainty masks. Finally, we demonstrate the usefulness and quality of our technique through an expert review and a computational experiment on real-world datasets.", "keywords": "Human-centered computing; Visualization; Visualization techniques; Treemaps", "link": "https://doi.org/10.1109/PacificVis48177.2020.7614", "refList": ["10.1109/tvcg.2013.180", "10.1109/tvcg.2015.2467591", "10.1111/cgf.12380", "10.1109/tvcg.2018.2864909", "10.1109/tvcg.2017.2743959", "10.1142/s0129183111016397", "10.1057/ivs.2009.4", "10.1080/15230406.2014.949868", "10.1007/978-1-4471-2804-5\\_6", "10.1145/1124772.1124851", "10.1109/tvcg.2017.2745140", "10.1145/22949.22950", "10.1109/tvcg.2010.79", "10.2307/1420573", "10.1109/tvcg.2010.186", "10.1037/h0046162", "10.1016/j.comgeo.2013.12.008", "10.1109/tvcg.2015.2424872", "10.1145/571647.571649", "10.1109/tvcg.2015.2467752", "10.2307/2288400", "10.1109/tvcg.2012.279", "10.1109/tvcg.2011.197", "10.1145/1056018.1056041", "10.1109/tvcg.2012.220", "10.1109/tvcg.2014.2346298", "10.1109/tvcg.2018.2864889", "10.1016/j.dam.2006.08.005", "10.1109/pacificvis.2018.00020", "10.1109/tvcg.2013.91"], "wos": 1, "children": [], "len": 1}], "len": 17}, "index": 790, "embedding": [3.0814006328582764, 2.1747934818267822, -0.026634581387043, 3.8604202270507812, -0.6745967864990234, 0.16650904715061188, -0.700136661529541, 2.9302666187286377, -0.43282294273376465, -0.8137040734291077, 1.8918994665145874, 1.639166235923767, -0.13324885070323944, 3.0540525913238525, 0.6135265827178955, 3.8659963607788086, 1.2439707517623901, 0.5256140828132629, -0.650787889957428, 5.635785102844238, -0.06630208343267441, 2.6581296920776367, 1.6078920364379883, 1.8306994438171387, -0.8797236084938049, 0.38676509261131287, -0.5500518083572388, 1.294701337814331, 3.3444457054138184, 2.0420801639556885, 2.149306297302246, 3.0603413581848145], "projection": [-2.995957612991333, 7.8505778312683105], "size": 9, "height": 3, "width": 6}