{"data": {"doi": "10.1109/tvcg.2018.2865138", "title": "Evaluating ‘Graphical Perception’ with CNNs", "year": "2018", "conferenceName": "InfoVis", "authors": "Daniel Haehn;James Tompkin;Hanspeter Pfister", "citationCount": "6", "affiliation": "Haehn, D (Corresponding Author), Harvard Univ, Cambridge, MA 02138 USA. Haehn, Daniel; Pfister, Hanspeter, Harvard Univ, Cambridge, MA 02138 USA. Tompkin, James, Brown Univ, Providence, RI 02912 USA.", "countries": "USA", "abstract": "Convolutional neural networks can successfully perform many computer vision tasks on images. For visualization, how do CNNs perform when applied to graphical perception tasks? We investigate this question by reproducing Cleveland and McGill's seminal 1984 experiments, which measured human perception efficiency of different visual encodings and defined elementary perceptual tasks for visualization. We measure the graphical perceptual capabilities of four network architectures on five different visualization tasks and compare to existing and new human performance baselines. While under limited circumstances CNNs are able to meet or outperform human task performance, we find that CNNs are not currently a good model for human graphical perception. We present the results of these experiments to foster the understanding of how CNNs succeed and fail when applied to data visualizations.", "keywords": "Machine Perception,Graphical Perception,Deep Learning,Convolutional Neural Networks", "link": "http://dx.doi.org/10.1109/TVCG.2018.2865138", "refList": ["10.1007/978-3-319-46454-1\\_49", "10.1109/tvcg.2014.2346979", "10.1007/978-3-319-46493-0\\_15", "10.5072/prism/30495", "10.1145/2470654.2481410", "10.1016/j.neuron.2017.06.011", "10.1126/science.aab3050", "10.1109/5.726791", "10.1126/science.229.4716.828", "10.1007/bf02288564", "10.1037/0033-295x.95.1.15", "10.1038/nature14539", "10.1109/tvcg.2014.2346320", "10.1038/nn.4244", "10.1007/978-3-642-46466-9\\_18", "10.1109/tvcg.2011.52", "10.2307/2288400", "10.1016/s0169-7439(00)00122-2", "10.1145/2642918.2647411", "10.1145/62402.62431", "10.1145/3065386", "10.1109/iccvw.2017.331", "10.1109/cvpr.2017.195"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934332", "title": "LassoNet: Deep Lasso-Selection of 3D Point Clouds", "year": "2019", "conferenceName": "SciVis", "authors": "Zhutian Chen;Wei Zeng 0004;Zhiguang Yang;Lingyun Yu;Chi-Wing Fu;Huamin Qu", "citationCount": "4", "affiliation": "Zeng, W (Corresponding Author), Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. Chen, Zhutian; Qu, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Zeng, Wei; Yang, Zhiguang, Chinese Acad Sci, Shenzhen Inst Adv Technol, Shenzhen, Peoples R China. Yu, Lingyun, Univ Groningen, Groningen, Netherlands. Fu, Chi-Wing, Chinese Univ Hong Kong, Hong Kong, Peoples R China.", "countries": "China;Netherlands", "abstract": "Selection is a fundamental task in exploratory analysis and visualization of 3D point clouds. Prior researches on selection methods were developed mainly based on heuristics such as local point density, thus limiting their applicability in general data. Specific challenges root in the great variabilities implied by point clouds (e.g., dense vs. sparse), viewpoint (e.g., occluded vs. non-occluded), and lasso (e.g., small vs. large). In this work, we introduce LassoNet, a new deep neural network for lasso selection of 3D point clouds, attempting to learn a latent mapping from viewpoint and lasso to point cloud regions. To achieve this, we couple user-target points with viewpoint and lasso information through 3D coordinate transform and naive selection, and improve the method scalability via an intention filtering and farthest point sampling. A hierarchical network is trained using a dataset with over 30K lasso-selection records on two different point cloud data. We conduct a formal user study to compare LassoNet with two state-of-the-art lasso-selection methods. The evaluations confirm that our approach improves the selection effectiveness and efficiency across different combinations of 3D point clouds, viewpoints, and lasso selections. Project Website: https://LassoNet.github.io", "keywords": "Point Clouds,Lasso Selection,Deep Learning", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934332", "refList": ["10.1111/j.1467-8659.2009.01515.x", "10.1109/tvcg.2015.2467202", "10.1109/tvcg.2016.2599049", "10.1109/iccv.2015.114", "10.1109/vppc.2018.8604993", "10.1111/cgf.13405", "10.1109/tvcg.2018.2843369", "10.1109/cvpr.2018.00278", "10.1145/3025453.3025957", "10.1109/mc.2013.178", "10.1145/2980179.2980238", "10.1109/msp.2017.2693418", "10.1145/237091.237105", "10.1145/2835487", "10.1109/cvpr.2010.5539838", "10.1016/j.visinf.2017.01.006", "10.1109/tcst.2018.2819965", "10.1109/tvcg.2018.2865138", "10.1109/83.623193", "10.1145/3072959.3073608", "10.1145/1053427.1053445", "10.1016/s0039-9140(96)02179-0", "10.1109/cvpr.2015.7298801", "10.1109/cvpr.2017.693", "10.1007/s12650-014-0206-5", "10.1145/3272127.3275110", "10.1109/cvpr.2015.7298845", "10.1109/iccvw.2015.112", "10.1109/iros.2015.7353481", "10.1007/s10994-009-5152-4", "10.1109/tvcg.2018.2865191", "10.1109/tvcg.2012.217", "10.1109/tridui.2006.1618279", "10.1109/tvcg.2012.292", "10.1109/cvpr.2016.609", "10.1016/j.cag.2012.12.003"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3028947", "title": "A Fluid Flow Data Set for Machine Learning and its Application to Neural Flow Map Interpolation", "year": "2020", "conferenceName": "SciVis", "authors": "Jakob Jakob;Markus H. Gross;Tobias Günther", "citationCount": "0", "affiliation": "Jakob, J (Corresponding Author), Swiss Fed Inst Technol, Zurich, Switzerland. Jakob, Jakob; Gross, Markus; Guenther, Tobias, Swiss Fed Inst Technol, Zurich, Switzerland.", "countries": "Switzerland", "abstract": "In recent years, deep learning has opened countless research opportunities across many different disciplines. At present, visualization is mainly applied to explore and explain neural networks. Its counterpart-the application of deep learning to visualization problems-requires us to share data more openly in order to enable more scientists to engage in data-driven research. In this paper, we construct a large fluid flow data set and apply it to a deep learning problem in scientific visualization. Parameterized by the Reynolds number, the data set contains a wide spectrum of laminar and turbulent fluid flow regimes. The full data set was simulated on a high-performance compute cluster and contains 8000 time-dependent 2D vector fields, accumulating to more than 16 TB in size. Using our public fluid data set, we trained deep convolutional neural networks in order to set a benchmark for an improved post-hoc Lagrangian fluid flow analysis. In in-situ settings, flow maps are exported and interpolated in order to assess the transport characteristics of time-dependent fluids. Using deep learning, we improve the accuracy of flow map interpolations, allowing a more precise flow analysis at a reduced memory IO footprint.", "keywords": "Scientific visualization,deep learning,flow maps", "link": "http://dx.doi.org/10.1109/TVCG.2020.3028947", "refList": ["10.1007/978-3-319-10593-2\\_25", "10.1145/3355089.3356560", "10.1109/access.2019.2903582", "10.1111/cgf.13405", "10.1109/tmm.2019.2919431", "10.1017/jfm.2016.151", "10.1016/j.physd.2005.10.007", "10.1007/978-3-030-00533-7\\_36", "10.3390/rs11161921", "10.1007/978-3-030-48457-6\\_1", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/tvcg.2007.70554", "10.1109/mcg.2018.2881523", "10.1109/cvpr.2016.207", "10.1145/1073204.1073264", "10.1145/3072959.3073643", "10.1109/tpami.2015.2439281", "10.2312/pgv", "10.4208/cicp.oa-2018-0035", "10.1109/cvpr.2017.693", "10.1109/tvcg.2013.128", "10.1109/igarss.2018.8519261", "10.1063/1.3270044", "10.2312/pgv.20191115", "10.1145/3197517.3201304", "10.1145/3065386", "10.1145/1360612.1360649", "10.1109/mcse.2015.103", "10.1145/3355089.3356575", "10.1109/mcg.2018.2881502", "10.1029/2019jd032121", "10.3390/informatics4030027", "10.1109/access.2019.2931781", "10.1007/s12650-018-0523-1", "10.1109/tvcg.2019.2934332", "10.1146/annurev.fluid.32.1.165", "10.1007/978-3-319-46475-6\\_43", "10.1126/science.1127647", "10.1007/978-3-319-46475-6\\_25", "10.1111/cgf.13689"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030337", "title": "QLens: Visual Analytics of MUlti-step Problem-solving Behaviors for Improving Question Design", "year": "2020", "conferenceName": "VAST", "authors": "Meng Xia;Reshika Palaniyappan Velumani;Yong Wang;Huamin Qu;Xiaojuan Ma", "citationCount": "0", "affiliation": "Xia, M (Corresponding Author), Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Xia, Meng; Velumani, Reshika Palaniyappan; Wang, Yong; Qu, Huamin; Ma, Xiaojuan, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China.", "countries": "China", "abstract": "With the rapid development of online education in recent years, there has been an increasing number of learning platforms that provide students with multi-step questions to cultivate their problem-solving skills. To guarantee the high quality of such learning materials, question designers need to inspect how students' problem-solving processes unfold step by step to infer whether students' problem-solving logic matches their design intent. They also need to compare the behaviors of different groups (e.g., students from different grades) to distribute questions to students with the right level of knowledge. The availability of fine-grained interaction data, such as mouse movement trajectories from the online platforms, provides the opportunity to analyze problem-solving behaviors. However, it is still challenging to interpret, summarize, and compare the high dimensional problem-solving sequence data. In this paper, we present a visual analytics system, QLens, to help question designers inspect detailed problem-solving trajectories, compare different student groups, distill insights for design improvements. In particular, QLens models problem-solving behavior as a hybrid state transition graph and visualizes it through a novel glyph-embedded Sankey diagram, which reflects students' problem-solving logic, engagement, and encountered difficulties. We conduct three case studies and three expert interviews to demonstrate the usefulness of QLens on real-world datasets that consist of thousands of problem-solving traces.", "keywords": "Learning Behavior Analysis,Visual Analytics,Time Series Data", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030337", "refList": ["10.3389/frobt.2019.00082", "10.1109/tvcg.2017.2745181", "10.1109/vr.2019.8798065", "10.1016/j.visinf.2018.12.001", "10.1109/pacificvis.2017.8031577", "10.1109/vr.2019.8798125", "10.1109/vr.2019.8797717", "10.1109/mprv.2017.35", "10.1109/tvcg.2013.192", "10.1109/tvcg.2017.2744218", "10.1016/j.visinf.2017.01.006", "10.1007/s11042-011-0833-y", "10.1109/visual.2001.964496", "10.1111/cgf.13325", "10.1109/mcg.2016.101", "10.1109/icdmw.2017.12", "10.1111/cgf.13189", "10.1016/j.visinf.2017.11.002", "10.1007/s11432-018-9801-4", "10.1109/tvcg.2018.2865041", "10.1109/vast.2014.7042477", "10.1109/vast.2014.7042478", "10.1167/11.5.13", "10.1109/vr.2019.8798227", "10.1145/3025453.3025566", "10.1109/tvcg.2018.2865192", "10.1109/vr.2018.8446350", "10.1109/tvcg.2018.2865191", "10.1109/tvcg.2019.2934332", "10.1109/tvcg.2014.2346445", "10.1016/j.cag.2012.12.003", "10.1109/tvcg.2016.2598831"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030346", "title": "V2V: A Deep Learning Approach to Variable-to-Variable Selection and Translation for Multivariate Time-Varying Data", "year": "2020", "conferenceName": "SciVis", "authors": "Jun Han;Hao Zheng 0006;Yunhao Xing;Danny Ziyi Chen;Chaoli Wang", "citationCount": "0", "affiliation": "Han, J (Corresponding Author), Univ Notre Dame, Notre Dame, IN 46556 USA. Han, Jun; Zheng, Hao; Chen, Danny Z.; Wang, Chaoli, Univ Notre Dame, Notre Dame, IN 46556 USA. Xing, Yunhao, Sichuan Univ, Chengdu, Sichuan, Peoples R China.", "countries": "China;USA", "abstract": "We present V2V, a novel deep learning framework, as a general-purpose solution to the variable-to-variable (V2V) selection and translation problem for multivariate time-varying data (MTVD) analysis and visualization. V2V leverages a representation learning algorithm to identify transferable variables and utilizes Kullback-Leibler divergence to determine the source and target variables. It then uses a generative adversarial network (GAN) to learn the mapping from the source variable to the target variable via the adversarial, volumetric, and feature losses. V2V takes the pairs of time steps of the source and target variable as input for training, Once trained, it can infer unseen time steps of the target variable given the corresponding time steps of the source variable. Several multivariate time-varying data sets of different characteristics are used to demonstrate the effectiveness of V2V, both quantitatively and qualitatively. We compare V2V against histogram matching and two other deep learning solutions (Pix2Pix and CycleGAN).", "keywords": "Multivariate time-varying data,variable selection and translation,generative adversarial network,data extrapolation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030346", "refList": ["10.1007/978-3-319-10593-2\\_25", "10.1109/access.2019.2903582", "10.1111/cgf.13405", "10.1109/cvpr.2017.19", "10.1109/tmm.2019.2919431", "10.1017/jfm.2016.151", "10.1016/j.physd.2005.10.007", "10.1146/annurev", "10.3390/rs11161921", "10.1109/tvcg.2007.70551", "10.1145/3309993", "10.1007/978-3-030-48457-6\\_1", "10.1109/igarss.2018.8518411", "10.1109/pacificvis.2018.00018", "10.1109/tvcg.2007.70554", "10.1109/cvpr.2016.207", "10.1145/1073204.1073264", "10.1109/tpami.2015.2439281", "10.2312/pgv", "10.4208/cicp.oa-2018-0035", "10.1109/cvpr.2017.693", "10.1109/igarss.2018.8519261", "10.1063/1.3270044", "10.2312/pgv.20191115", "10.1145/3197517.3201304", "10.1145/3065386", "10.1145/1360612.1360649", "10.1109/mcse.2015.103", "10.1145/3355089.3356575", "10.1109/mcg.2018.2881502", "10.1029/2019jd032121", "10.3390/informatics4030027", "10.1146/annurev-fluid-010313-141322", "10.1109/access.2019.2931781", "10.1007/s12650-018-0523-1", "10.1109/tvcg.2019.2934332", "10.1146/annurev.fluid.32.1.165", "10.1126/science.1127647"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030374", "title": "VC-Net: Deep Volume-Composition Networks for Segmentation and Visualization of Highly Sparse and Noisy Image Data", "year": "2020", "conferenceName": "SciVis", "authors": "Yifan Wang;Guoli Yan;Haikuan Zhu;Sagar Buch;Ying Wang;E. Mark Haacke;Jing Hua;Zichun Zhong", "citationCount": "0", "affiliation": "Wang, YF (Corresponding Author), Wayne State Univ, Dept Comp Sci, Detroit, MI 48202 USA. Wang, Yifan; Yan, Guoli; Zhu, Haikuan; Hua, Jing; Zhong, Zichun, Wayne State Univ, Dept Comp Sci, Detroit, MI 48202 USA. Buch, Sagar; Wang, Ying; Haacke, Ewart Mark, Wayne State Univ, Dept Radiol, Detroit, MI 48201 USA.", "countries": "USA", "abstract": "The fundamental motivation of the proposed work is to present a new visualization-guided computing paradigm to combine direct 3D volume processing and volume rendered clues for effective 3D exploration. For example, extracting and visualizing microstructures in-vivo have been a long-standing challenging problem. However, due to the high sparseness and noisiness in cerebrovasculature data as well as highly complex geometry and topology variations of micro vessels, it is still extremely challenging to extract the complete 3D vessel structure and visualize it in 3D with high fidelity. In this paper, we present an end-to-end deep learning method, VC-Net, for robust extraction of 3D microvascular structure through embedding the image composition, generated by maximum intensity projection (MIP), into the 3D volumetric image learning process to enhance the overall performance. The core novelty is to automatically leverage the volume visualization technique (e.g., MIP - a volume rendering scheme for 3D volume images) to enhance the 3D data exploration at the deep learning level. The MIP embedding features can enhance the local vessel signal (through canceling out the noise) and adapt to the geometric variability and scalability of vessels, which is of great importance in microvascular tracking. A multi-stream convolutional neural network (CNN) framework is proposed to effectively learn the 3D volume and 2D MIP feature vectors, respectively, and then explore their inter-dependencies in a joint volume-composition embedding space by unprojecting the 2D feature vectors into the 3D volume embedding space. It is noted that the proposed framework can better capture the small/micro vessels and improve the vessel connectivity. To our knowledge, this is the first time that a deep learning framework is proposed to construct a joint convolutional embedding space, where the computed vessel probabilities from volume rendering based 2D projection and 3D volume can be explored and integrated synergistically. Experimental results are evaluated and compared with the traditional 3D vessel segmentation methods and the state-of-the-art in deep learning, by using extensive public and real patient (micro- )cerebrovascular image datasets. The application of this accurate segmentation and visualization of sparse and complicated 3D microvascular structure facilitated by our method demonstrates the potential in a powerful MR arteriogram and venogram diagnosis of vascular disease.", "keywords": "Deep neural network,3D cerebrovascular segmentation and visualization,maximum intensity projection (MIP),joint embedding", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030374", "refList": ["10.1109/cluster.2018.00036", "10.1109/iccv.2015.123", "10.1109/tvcg.2013.133", "10.1109/cvpr.2017.19", "10.1109/tvcg.2019.2934312", "10.1007/978-3-319-46487-9\\_40", "10.1109/tvcg.2006.175", "10.1109/tvcg.2007.70523", "10.1109/tvcg.2018.2880207", "10.1145/3309993", "10.1109/pacificvis.2018.00018", "10.1109/iccv.2017.244", "10.1109/cvpr.2017.632", "10.1109/tvcg.2018.2816059", "10.1109/pacificvis.2009.4906852", "10.1109/tvcg.2018.2864808", "10.1109/mcg.2018.2881523", "10.1109/tvcg.2015.2467431", "10.1109/tpami.2015.2439281", "10.1109/pacificvis48177.2020.8737", "10.1109/cvpr.2019.00244", "10.1109/tvcg.2006.165", "10.1109/bigdata.2018.8622520", "10.1007/978-3-319-46466-4\\_29", "10.1109/visual.2019.8933759", "10.1145/3197517.3201304", "10.1109/pacificvis.2011.5742378", "10.1109/cvpr.2006.91", "10.1109/pacificvis.2011.5742369", "10.1109/tvcg.2019.2934255", "10.1109/cvpr.2016.90", "10.1007/978-3-319-24574-4\\_28", "10.1109/pacificvis.2019.00041", "10.1109/tvcg.2019.2934332", "10.1109/cvpr.2018.00916", "10.1007/978-3-319-46475-6\\_43"], "wos": 1, "children": [], "len": 1}], "len": 9}, {"doi": "10.1109/tvcg.2020.3030351", "title": "Chartem: Reviving Chart Images with Data Embedding", "year": "2020", "conferenceName": "InfoVis", "authors": "Jiayun Fu;Bin Zhu;Weiwei Cui;Song Ge;Yun Wang 0012;Haidong Zhang;He Huang;Yuanyuan Tang;Dongmei Zhang;Xiaojing Ma 0002", "citationCount": "0", "affiliation": "Fu, JY (Corresponding Author), Huazhong Univ Sci \\& Technol, Natl Engn Res Ctr Big Data Tech \\& Syst, Big Data Sec Eng Res Ctr, Sch Cyber Sci \\& Technol, Wuhan, Peoples R China. Fu, Jiayun; Tang, Yuanyuan; Ma, Xiaojing, Huazhong Univ Sci \\& Technol, Natl Engn Res Ctr Big Data Tech \\& Syst, Big Data Sec Eng Res Ctr, Sch Cyber Sci \\& Technol, Wuhan, Peoples R China. Zhu, Bin; Cui, Weiwei; Ge, Song; Wang, Yun; Zhang, Haidong; Huang, He; Zhang, Dongmei, Microsoft Res Asia, Beijing, Peoples R China.", "countries": "China", "abstract": "In practice, charts are widely stored as bitmap images. Although easily consumed by humans, they are not convenient for other uses. For example, changing the chart style or type or a data value in a chart image practically requires creating a completely new chart, which is often a time-consuming and error-prone process. To assist these tasks, many approaches have been proposed to automatically extract information from chart images with computer vision and machine learning techniques. Although they have achieved promising preliminary results, there are still a lot of challenges to overcome in terms of robustness and accuracy. In this paper, we propose a novel alternative approach called Chartem to address this issue directly from the root. Specifically, we design a data-embedding schema to encode a significant amount of information into the background of a chart image without interfering human perception of the chart. The embedded information, when extracted from the image, can enable a variety of visualization applications to reuse or repurpose chart images. To evaluate the effectiveness of Chartem, we conduct a user study and performance experiments on Chartem embedding and extraction algorithms. We further present several prototype applications to demonstrate the utility of Chartem.", "keywords": "Chart embedding,background embedding,data embedding,chart image,chart reuse", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030351", "refList": ["10.1300/j104v40n03\\_02", "10.1109/icpr.2006.479", "10.1109/tvcg.2015.2467732", "10.1109/cvpr.2014.81", "10.3390/fi10060054", "10.1109/tpami.2016.2577031", "10.1145/2858036.2858435", "10.1109/tvcg.2011.185", "10.2352/issn.2470-1173.2016.8.mwsf-078", "10.1109/lsp.2017.2745572", "10.1109/ares.2008.72", "10.1145/2896818", "10.1007/s12650-018-0530-2", "10.1002/j.1538-7305.1948.tb00917.x", "10.1109/ipta.2010.5586786", "10.1109/cvpr.2019.00766", "10.1109/tvcg.2018.2865138", "10.1137/0108018", "10.1111/cgf.13193", "10.1145/2307636.2307645", "10.1145/3152823", "10.1007/978-3-642-21551-3\\_13", "10.1111/cgf.13686", "10.1007/s10479-005-5724-z", "10.1038/540330a", "10.1109/cvpr.2019.00161", "10.1007/s00521-014-1702-1", "10.1006/jcss.2002.1827", "10.1016/j.jvlc.2018.08.005", "10.1109/cvpr.2018.00068", "10.1109/tip.2003.819861", "10.1007/978-3-642-16435-4\\_13", "10.1109/tvcg.2013.234", "10.1109/lsp.2006.870357", "10.1109/tvcg.2016.2525771", "10.1109/tvcg.2017.2744320", "10.1109/cvpr.2016.90", "10.1007/978-3-319-24574-4\\_28", "10.1016/s0019-9958(60)90287-4", "10.1109/wifs.2012.6412655", "10.1016/j.visinf.2018.04.011", "10.1109/tvcg.2019.2934431", "10.1117/12.337436"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030376", "title": "Insight Beyond Numbers: The Impact of Qualitative Factors on Visual Data Analysis", "year": "2020", "conferenceName": "VAST", "authors": "Benjamin Karer;Hans Hagen;Dirk J. Lehmann", "citationCount": "0", "affiliation": "Karer, B (Corresponding Author), Fed Criminal Police Off Germany, Wiesbaden, Germany. Karer, Benjamin, Fed Criminal Police Off Germany, Wiesbaden, Germany. Hagen, Hans, TU Kaiserslautern, Kaiserslautern, Germany. Lehmann, Dirk J., Ostfalia Univ Appl Sci, Wolfenbuttel, Germany. Lehmann, Dirk J., IAV GmbH, Berlin, Germany.", "countries": "Germany", "abstract": "As of today, data analysis focuses primarily on the findings to be made inside the data and concentrates less on how those findings relate to the domain of investigation. Contemporary visualization as a field of research shows a strong tendency to adopt this data-centrism. Despite their decisive influence on the analysis result, qualitative aspects of the analysis process such as the structure, soundness, and complexity of the applied reasoning strategy are rarely discussed explicitly. We argue that if the purpose of visualization is the provision of domain insight rather than the depiction of data analysis results, a holistic perspective requires a qualitative component to to be added to the discussion of quantitative and human factors. To support this point, we demonstrate how considerations of qualitative factors in visual analysis can be applied to obtain explanations and possible solutions for a number of practical limitations inherent to the data-centric perspective on analysis. Based on this discussion of what we call qualitative visual analysis, we develop an inside-outside principle of nested levels of context that can serve as a conceptual basis for the development of visualization systems that optimally support the emergence of insight during analysis.", "keywords": "Visualization,Reasoning,Qualitative Aspects", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030376", "refList": ["10.1057/ivs.2009.22", "10.1109/tvcg.2015.2467732", "10.1109/infvis.2000.885092", "10.1109/vast.2014.7042482", "10.1145/1498700.1498704", "10.1109/tvcg.2009.108", "10.1109/tvcg.2018.2829750", "10.1037/0033-295x.111.4.1036", "10.1109/tvcg.2012.199", "10.1109/38.267476", "10.1007/978-3-540-70956-5\\_2", "10.1109/tvcg.2015.2467613", "10.1109/tvcg.2015.2467195", "10.1109/tvcg.2014.2346419", "10.1109/vast.2017.8585669", "10.1109/tvcg.2010.132", "10.1145/22949.22950", "10.1109/tvcg.2014.2346984", "10.1017/cbo9780511816772", "10.1109/mcg.2003.1231171", "10.1111/coin.12227", "10.1109/tvcg.2018.2865138", "10.1109/38.788803", "10.1109/tvcg.2018.2864849", "10.1109/mcg.2012.120", "10.1109/tvcg.2007.70535", "10.1162/neco.2008.12-06-420", "10.1109/tvcg.2018.2865240", "10.1089/tmj.2010.0114", "10.1109/beliv.2018.8634267", "10.1109/tvcg.2014.2346481", "10.1207/s15327809jls0402\\_2", "10.1109/tvcg.2006.80", "10.1145/2858036.2858280", "10.1109/tvcg.2017.2674978", "10.1109/tvcg.2011.52", "10.1016/j.cag.2014.03.002", "10.1109/tvcg.2015.2513410", "10.1111/j.1756-8765.2011.01150.x", "10.1109/infvis.2005.1532142", "10.1002/spe.4380211102", "10.1186/s41235-018-0120-9", "10.1073/pnas.1807180116", "10.1109/tvcg.2012.133", "10.1109/tvcg.2012.273", "10.1111/j.1467-8659.2011.01928.x", "10.1145/353485.353486", "10.1109/tvcg.2015.2462356", "10.1109/mcg.2019.2923483", "10.1111/cgf.13264", "10.1057/palgrave.ivs.9500070", "10.1145/1168149.1168158", "10.1109/mcg.2019.2961716", "10.1016/s0167-739x(96)00029-5", "10.1111/j.1467-8659.2009.01667.x", "10.1177/1473871611415989", "10.1109/tvcg.2013.234", "10.1109/iv.2012.33", "10.1111/cgf.13446", "10.1057/ivs.2008.28", "10.1111/cgf.12379", "10.1037/0033-295x.112.1.159", "10.1109/tvcg.2010.161", "10.1109/tvcg.2017.2744319", "10.1145/989863.989880", "10.1007/s11390-016-1663-1", "10.1177/1473871615609787", "10.1016/j.cola.2019.100911"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030423", "title": "MobileVisFixer: Tailoring Web Visualizations for Mobile Phones Leveraging an Explainable Reinforcement Learning Framework", "year": "2020", "conferenceName": "InfoVis", "authors": "Aoyu Wu;Wai Tong;Tim Dwyer;Bongshin Lee;Petra Isenberg;Huamin Qu", "citationCount": "0", "affiliation": "Wu, AY (Corresponding Author), Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Wu, Aoyu; Tong, Wai; Qu, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Dwyer, Tim, Monash Univ, Clayton, Vic, Australia. Lee, Bongshin, Microsoft Res, Redmond, WA USA. Isenberg, Petra, INRIA, Le Chesnay Rocquencourt, France.", "countries": "USA;China;France;Australia", "abstract": "We contribute MobileVisFixer, a new method to make visualizations more mobile-friendly. Although mobile devices have become the primary means of accessing information on the web, many existing visualizations are not optimized for small screens and can lead to a frustrating user experience. Currently, practitioners and researchers have to engage in a tedious and time-consuming process to ensure that their designs scale to screens of different sizes, and existing toolkits and libraries provide little support in diagnosing and repairing issues. To address this challenge, MobileVisFixer automates a mobile-friendly visualization re-design process with a novel reinforcement learning framework. To inform the design of MobileVisFixer, we first collected and analyzed SVG-based visualizations on the web, and identified five common mobile-friendly issues. MobileVisFixer addresses four of these issues on single-view Cartesian visualizations with linear or discrete scales by a Markov Decision Process model that is both generalizable across various visualizations and fully explainable. MobileVisFixer deconstructs charts into declarative formats, and uses a greedy heuristic based on Policy Gradient methods to find solutions to this difficult, multi-criteria optimization problem in reasonable time. In addition, MobileVisFixer can be easily extended with the incorporation of optimization algorithms for data visualizations. Quantitative evaluation on two real-world datasets demonstrates the effectiveness and generalizability of our method.", "keywords": "Mobile visualization,Responsive visualization,Machine learning for visualizations,Reinforcement learning", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030423", "refList": ["10.1109/mcg.2014.82", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2012.196", "10.1145/3092703.3092726", "10.1109/pimrc.2015.7343276", "10.1109/tvcg.2014.48", "10.1145/3025453.3025957", "10.1145/2047196.2047247", "10.1145/3173574.3174168", "10.1109/icst.2019.00027", "10.1109/tvcg.2007.70594", "10.1145/3197517.3201311", "10.1145/3126594.3126653", "10.1109/mcg.2019.2924636", "10.1145/3180155.3180262", "10.1109/tvcg.2017.2659744", "10.1145/3123266.3123274", "10.1109/tvcg.2019.2934538", "10.1109/cvpr.2018.00592", "10.1109/tvcg.2018.2865138", "10.1109/tsmcc.2012.2218595", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13193", "10.1145/2775441.2775478", "10.1145/3313831.3376777", "10.1109/mc.2006.109", "10.1111/cgf.13686", "10.1109/tvcg.2015.2467091", "10.4230/dagrep.9.7.78", "10.1007/978-3-319-71249-9\\_9", "10.1007/s00778-019-00588-3", "10.1109/ase.2015.31", "10.1007/bf02124742", "10.1109/tvcg.2019.2934397", "10.1109/adprl.2007.368196", "10.1109/mcg.2020.2968244", "10.1145/3092703.3092712", "10.1109/tvcg.2017.2744320", "10.1023/a:1017992615625", "10.1145/2642918", "10.1145/2858036.2858558", "10.1145/3290605.3300358", "10.1109/tvcg.2019.2934431", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030406", "title": "Palettailor: Discriminable Colorization for Categorical Data", "year": "2020", "conferenceName": "InfoVis", "authors": "Kecheng Lu;Mi Feng;Xin Chen;Michael Sedlmair;Oliver Deussen;Dani Lischinski;Zhanglin Cheng;Yunhai Wang", "citationCount": "0", "affiliation": "Wang, YH (Corresponding Author), Shandong Univ, Jinan, Peoples R China. Cheng, ZL (Corresponding Author), SIAT, Shenzhen VesuCA Key Lab, Shenzhen, Peoples R China. Lu, Kecheng; Chen, Xin; Wang, Yunhai, Shandong Univ, Jinan, Peoples R China. Feng, Mi, Twitter Inc, San Francisco, CA USA. Lu, Kecheng; Deussen, Oliver; Cheng, Zhanglin, SIAT, Shenzhen VesuCA Key Lab, Shenzhen, Peoples R China. Sedlmair, Michael, Univ Stuttgart, VISUS, Stuttgart, Germany. Deussen, Oliver, Konstanz Univ, Constance, Germany. Lischinski, Dani, Hebrew Univ Jerusalem, Jerusalem, Israel.", "countries": "USA;Israel;Germany;China", "abstract": "We present an integrated approach for creating and assigning color palettes to different visualizations such as multi-class scatterplots, line, and bar charts. While other methods separate the creation of colors from their assignment, our approach takes data characteristics into account to produce color palettes, which are then assigned in a way that fosters better visual discrimination of classes. To do so, we use a customized optimization based on simulated annealing to maximize the combination of three carefully designed color scoring functions: point distinctness, name difference, and color discrimination. We compare our approach to state-of-the-art palettes with a controlled user study for scatterplots and line charts, furthermore we performed a case study. Our results show that Palettailor, as a fully-automated approach, generates color palettes with a higher discrimination quality than existing approaches. The efficiency of our optimization allows us also to incorporate user modifications into the color selection process.", "keywords": "Color Palette,Discriminability,Multi-Class Scatterplot,Line Chart,Bar Chart", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030406", "refList": ["10.1109/mcg.2014.82", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2012.196", "10.1145/3092703.3092726", "10.1109/tvcg.2014.48", "10.1145/3025453.3025957", "10.1145/2047196.2047247", "10.1145/3173574.3174168", "10.1109/icst.2019.00027", "10.1109/tvcg.2007.70594", "10.1145/3197517.3201311", "10.1145/3126594.3126653", "10.1109/mcg.2019.2924636", "10.1145/3180155.3180262", "10.1109/tvcg.2017.2659744", "10.1145/3123266.3123274", "10.1109/tvcg.2018.2865234", "10.1109/tvcg.2019.2934538", "10.1109/cvpr.2018.00592", "10.1145/2815833.2816956", "10.1109/tvcg.2018.2865138", "10.1109/tsmcc.2012.2218595", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13193", "10.1145/2775441.2775478", "10.1145/3313831.3376777", "10.1109/mc.2006.109", "10.1111/cgf.13686", "10.1109/tvcg.2015.2467091", "10.4230/dagrep.9.7.78", "10.1007/978-3-319-71249-9\\_9", "10.1007/s00778-019-00588-3", "10.1109/ase.2015.31", "10.1007/bf02124742", "10.1145/3025453.3025768", "10.1109/tvcg.2019.2934397", "10.1109/adprl.2007.368196", "10.1109/mcg.2020.2968244", "10.1145/3092703.3092712", "10.1109/tvcg.2017.2744320", "10.1023/a:1017992615625", "10.1145/2642918", "10.1145/2858036.2858558", "10.1145/3290605.3300358", "10.1109/tvcg.2019.2934431", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030395", "title": "Towards Modeling Visualization Processes as Dynamic Bayesian Networks", "year": "2020", "conferenceName": "InfoVis", "authors": "Christian Heine 0002", "citationCount": "0", "affiliation": "Heine, C (Corresponding Author), Univ Leipzig, Leipzig, Germany. Heine, Christian, Univ Leipzig, Leipzig, Germany.", "countries": "Germany", "abstract": "Visualization designs typically need to be evaluated with user studies, because their suitability for a particular task is hard to predict. What the field of visualization is currently lacking are theories and models that can be used to explain why certain designs work and others do not. This paper outlines a general framework for modeling visualization processes that can serve as the first step towards such a theory. It surveys related research in mathematical and computational psychology and argues for the use of dynamic Bayesian networks to describe these time-dependent, probabilistic processes. It is discussed how these models could be used to aid in design evaluation. The development of concrete models will be a long process. Thus, the paper outlines a research program sketching how to develop prototypes and their extensions from existing models, controlled experiments, and observational studies.", "keywords": "Visualization,model building,perception,cognition,dynamic Bayesian networks", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030395", "refList": ["10.1057/ivs.2009.22", "10.1109/tvcg.2015.2467732", "10.1109/infvis.2000.885092", "10.1109/vast.2014.7042482", "10.1145/1498700.1498704", "10.1109/tvcg.2009.108", "10.1109/tvcg.2018.2829750", "10.1037/0033-295x.111.4.1036", "10.1109/tvcg.2012.199", "10.1111/cgf.13899", "10.1109/38.267476", "10.1007/978-3-540-70956-5\\_2", "10.1109/tvcg.2015.2467613", "10.1109/tvcg.2015.2467195", "10.1109/tvcg.2014.2346419", "10.1145/3290605.3300562", "10.1109/vl.1996.545307", "10.1109/vast.2017.8585669", "10.1109/infvis.2003.1249004", "10.1109/tvcg.2010.132", "10.1145/22949.22950", "10.1109/tvcg.2014.2346984", "10.1145/3290605.3300418", "10.1017/cbo9780511816772", "10.1109/mcg.2003.1231171", "10.1111/coin.12227", "10.1109/tvcg.2018.2865138", "10.1109/38.788803", "10.1109/tvcg.2018.2864849", "10.1109/mcg.2012.120", "10.1109/tvcg.2007.70535", "10.1162/neco.2008.12-06-420", "10.1109/tvcg.2018.2865240", "10.1089/tmj.2010.0114", "10.1109/beliv.2018.8634267", "10.1109/tvcg.2014.2346481", "10.1207/s15327809jls0402\\_2", "10.1109/tvcg.2006.80", "10.1145/2858036.2858280", "10.1109/tvcg.2017.2674978", "10.1109/tvcg.2011.52", "10.1016/j.cag.2014.03.002", "10.1109/tvcg.2015.2513410", "10.1111/j.1756-8765.2011.01150.x", "10.1109/infvis.2005.1532142", "10.1002/spe.4380211102", "10.1186/s41235-018-0120-9", "10.1073/pnas.1807180116", "10.1109/tvcg.2012.133", "10.1109/tvcg.2012.273", "10.1111/j.1467-8659.2011.01928.x", "10.1145/353485.353486", "10.1109/tvcg.2015.2462356", "10.1109/mcg.2019.2923483", "10.1111/cgf.13264", "10.1057/palgrave.ivs.9500070", "10.1145/1168149.1168158", "10.1109/mcg.2019.2961716", "10.1016/s0167-739x(96)00029-5", "10.1111/j.1467-8659.2009.01667.x", "10.1177/1473871611415989", "10.1109/tvcg.2013.234", "10.1109/iv.2012.33", "10.1111/cgf.13446", "10.1057/ivs.2008.28", "10.1111/cgf.12379", "10.1037/0033-295x.112.1.159", "10.1017/cb09781139033916.005", "10.1109/tvcg.2010.161", "10.1109/tvcg.2017.2744319", "10.1145/989863.989880", "10.1007/s11390-016-1663-1", "10.1177/1473871615609787", "10.1016/j.cola.2019.100911", "10.1057/palgrave.ivs.9500025"], "wos": 1, "children": [], "len": 1}], "len": 21}, "index": 822, "embedding": [2.22918963432312, 2.577641725540161, -0.5349108576774597, 3.938157320022583, -0.6745967864990234, 0.16650904715061188, -0.700136661529541, 4.369593620300293, -0.43282294273376465, -0.8137040734291077, 1.1518595218658447, 1.9512139558792114, -0.13324885070323944, 5.726245403289795, 4.115359783172607, 4.296823501586914, 0.988301694393158, 1.9736722707748413, -0.650787889957428, 2.0263431072235107, -0.06630208343267441, 4.3825507164001465, 2.2411046028137207, 1.0022419691085815, 2.210202693939209, 0.09129026532173157, -0.5500518083572388, 2.0683603286743164, 3.384176254272461, 2.9721834659576416, 2.5274972915649414, 4.080023288726807], "projection": [-3.431006908416748, 8.096071243286133], "size": 11, "height": 3, "width": 6}