{"data": {"doi": "10.1109/tvcg.2018.2865142", "title": "Glanceable Visualization: Studies of Data Comparison Performance on Smartwatches", "year": "2018", "conferenceName": "InfoVis", "authors": "Tanja Blascheck;Lonni Besançon;Anastasia Bezerianos;Bongshin Lee;Petra Isenberg", "citationCount": "4", "affiliation": "Blascheck, T (Corresponding Author), INRIA, Paris, France. Blascheck, Tanja; Isenberg, Petra, INRIA, Paris, France. Besancon, Lonni; Bezerianos, Anastasia, Univ Paris Saclay, Paris, France. Bezerianos, Anastasia, Univ Paris Sud, CNRS, INRIA, Paris, France. Lee, Bongshin, Microsoft Res, Richmond, VA USA.", "countries": "USA;France", "abstract": "We present the results of two perception studies to assess how quickly people can perform a simple data comparison task for small-scale visualizations on a smartwatch. The main goal of these studies is to extend our understanding of design constraints for smartwatch visualizations. Previous work has shown that a vast majority of smartwatch interactions last under 5 s. It is still unknown what people can actually perceive from visualizations during such short glances, in particular with such a limited display space of smartwatches. To shed light on this question, we conducted two perception studies that assessed the lower bounds of task time for a simple data comparison task. We tested three chart types common on smartwatches: bar charts, donut charts, and radial bar charts with three different data sizes: 7, 12, and 24 data values. In our first study, we controlled the differences of the two target bars to be compared, while the second study varied the difference randomly. For both studies, we found that participants performed the task on average in &lt;;300 ms for the bar chart, &lt;;220 ms for the donut chart, and in &lt;; 1780 ms for the radial bar chart. Thresholds in the second study per chart type were on average 1.14-1.35× higher than in the first study. Our results show that bar and donut charts should be preferred on smartwatch displays when quick data comparisons are necessary.", "keywords": "Glanceable visualization,smartwatch,perception,quantitative evaluation,data comparison", "link": "http://dx.doi.org/10.1109/TVCG.2018.2865142", "refList": ["10.1109/tvcg.2014.2346435", "10.1109/tvcg.2012.233", "10.1145/3025453.3025817", "10.1109/tvcg.2012.196", "10.1007/978-3-540-33037-08", "10.1109/tvcg.2016.2618797", "10.7326/0003-4819-130-12-199906150-00008", "10.1145/2802083.2802085", "10.1109/mcg.2012.37", "10.1145/2702123.2702226", "10.1145/3173574.3173593", "10.1016/s0042-6989(97)00340-4", "10.1111/j.1467-9280.2009.02316.x", "10.1109/tvcg.2013.192", "10.1145/3123266.3123274", "10.1145/2807442.2807499", "10.1016/s0079-6123(06)55002-2", "10.1038/nature06860", "10.2312/conf/eg2013/stars/039-063", "10.1109/tvcg.2014.2346320", "10.1111/cgf.12888", "10.1109/infvis.2005.1532144", "10.1109/tvcg.2017.2674958", "10.1016/0010-0277(84)90023-4", "10.1109/pacificvis.2014.67", "10.1109/tvcg.2016.2549018", "10.1111/cgf.12104", "10.1145/2971648.2971754", "10.2307/2288400", "10.1038/nmeth.2659", "10.1109/tvcg.2007.70589", "10.1080/00335558008248231", "10.1111/j.1540-5907.2011.00525.x", "10.1007/978-3-540", "10.1109/tvcg.2010.162", "10.1007/978-3-319-26633-6\\_13", "10.1007/978-3-540-33037-0\\_8", "10.1145/2858036.2858522", "10.1111/j.1751-5823.2012.00187\\_26.x", "10.1016/j.socec.2004.09.033", "10.1057/palgrave.ivs.9500025"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934397", "title": "A Comparative Evaluation of Animation and Small Multiples for Trend Visualization on Mobile Phones", "year": "2019", "conferenceName": "InfoVis", "authors": "Matthew Brehmer;Bongshin Lee;Petra Isenberg;Eun Kyoung Choe", "citationCount": "3", "affiliation": "Brehmer, M (Corresponding Author), Microsoft Res, Redmond, WA 98052 USA. Brehmer, Matthew; Lee, Bongshin, Microsoft Res, Redmond, WA 98052 USA. Isenberg, Petra, INRIA, Rocquencourt, France. Choe, Eun Kyoung, Univ Maryland, College Pk, MD 20742 USA.", "countries": "USA;France", "abstract": "We compare the efficacy of animated and small multiples variants of scatterplots on mobile phones for comparing trends in multivariate datasets. Visualization is increasingly prevalent in mobile applications and mobile-first websites, yet there is little prior visualization research dedicated to small displays. In this paper, we build upon previous experimental research carried out on larger displays that assessed animated and non-animated variants of scatterplots. Incorporating similar experimental stimuli and tasks, we conducted an experiment where 96 crowdworker participants performed nine trend comparison tasks using their mobile phones. We found that those using a small multiples design consistently completed tasks in less time, albeit with slightly less confidence than those using an animated design. The accuracy results were more task-dependent, and we further interpret our results according to the characteristics of the individual tasks, with a specific focus on the trajectories of target and distractor data items in each task. We identify cases that appear to favor either animation or small multiples, providing new questions for further experimental research and implications for visualization design on mobile devices. Lastly, we provide a reflection on our evaluation methodology.", "keywords": "Evaluation,graphical perception,mobile phones,trend visualization,animation,small multiples,crowdsourcing", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934397", "refList": ["10.1109/mcg.2015.113", "10.1111/cgf.12106", "10.1109/tvcg.2011.185", "10.1111/cgf.13444", "10.1145/2786567.2786571", "10.1109/tvcg.2013.254", "10.1007/978-3-319-68517-5\\_1", "10.1145/3123266.3123274", "10.1007/978-3-319-66435-4\\_5", "10.1109/tvcg.2018.2865234", "10.1111/j.1467-8659.2012.03093.x", "10.1145/1133265.1133364", "10.1145/2470654.2481318", "10.1145/2993901.2993906", "10.1145/3290605.3300786", "10.1109/tvcg.2016.2598876", "10.2307/2288400", "10.1038/nmeth.2659", "10.1109/tvcg.2018.2865142", "10.1167/7.13.14", "10.1109/tvcg.2008.125", "10.1145/3025453.3025752", "10.1109/tvcg.2015.2502587", "10.1109/tvcg.2010.78", "10.1145/2396636.2396675", "10.1007/978-3-319-26633-6\\_13", "10.1145/2858036.2858558", "10.1145/3290605.3300771"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030423", "title": "MobileVisFixer: Tailoring Web Visualizations for Mobile Phones Leveraging an Explainable Reinforcement Learning Framework", "year": "2020", "conferenceName": "InfoVis", "authors": "Aoyu Wu;Wai Tong;Tim Dwyer;Bongshin Lee;Petra Isenberg;Huamin Qu", "citationCount": "0", "affiliation": "Wu, AY (Corresponding Author), Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Wu, Aoyu; Tong, Wai; Qu, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Dwyer, Tim, Monash Univ, Clayton, Vic, Australia. Lee, Bongshin, Microsoft Res, Redmond, WA USA. Isenberg, Petra, INRIA, Le Chesnay Rocquencourt, France.", "countries": "USA;China;France;Australia", "abstract": "We contribute MobileVisFixer, a new method to make visualizations more mobile-friendly. Although mobile devices have become the primary means of accessing information on the web, many existing visualizations are not optimized for small screens and can lead to a frustrating user experience. Currently, practitioners and researchers have to engage in a tedious and time-consuming process to ensure that their designs scale to screens of different sizes, and existing toolkits and libraries provide little support in diagnosing and repairing issues. To address this challenge, MobileVisFixer automates a mobile-friendly visualization re-design process with a novel reinforcement learning framework. To inform the design of MobileVisFixer, we first collected and analyzed SVG-based visualizations on the web, and identified five common mobile-friendly issues. MobileVisFixer addresses four of these issues on single-view Cartesian visualizations with linear or discrete scales by a Markov Decision Process model that is both generalizable across various visualizations and fully explainable. MobileVisFixer deconstructs charts into declarative formats, and uses a greedy heuristic based on Policy Gradient methods to find solutions to this difficult, multi-criteria optimization problem in reasonable time. In addition, MobileVisFixer can be easily extended with the incorporation of optimization algorithms for data visualizations. Quantitative evaluation on two real-world datasets demonstrates the effectiveness and generalizability of our method.", "keywords": "Mobile visualization,Responsive visualization,Machine learning for visualizations,Reinforcement learning", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030423", "refList": ["10.1109/mcg.2014.82", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2012.196", "10.1145/3092703.3092726", "10.1109/pimrc.2015.7343276", "10.1109/tvcg.2014.48", "10.1145/3025453.3025957", "10.1145/2047196.2047247", "10.1145/3173574.3174168", "10.1109/icst.2019.00027", "10.1109/tvcg.2007.70594", "10.1145/3197517.3201311", "10.1145/3126594.3126653", "10.1109/mcg.2019.2924636", "10.1145/3180155.3180262", "10.1109/tvcg.2017.2659744", "10.1145/3123266.3123274", "10.1109/tvcg.2019.2934538", "10.1109/cvpr.2018.00592", "10.1109/tvcg.2018.2865138", "10.1109/tsmcc.2012.2218595", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13193", "10.1145/2775441.2775478", "10.1145/3313831.3376777", "10.1109/mc.2006.109", "10.1111/cgf.13686", "10.1109/tvcg.2015.2467091", "10.4230/dagrep.9.7.78", "10.1007/978-3-319-71249-9\\_9", "10.1007/s00778-019-00588-3", "10.1109/ase.2015.31", "10.1007/bf02124742", "10.1109/tvcg.2019.2934397", "10.1109/adprl.2007.368196", "10.1109/mcg.2020.2968244", "10.1145/3092703.3092712", "10.1109/tvcg.2017.2744320", "10.1023/a:1017992615625", "10.1145/2642918", "10.1145/2858036.2858558", "10.1145/3290605.3300358", "10.1109/tvcg.2019.2934431", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030406", "title": "Palettailor: Discriminable Colorization for Categorical Data", "year": "2020", "conferenceName": "InfoVis", "authors": "Kecheng Lu;Mi Feng;Xin Chen;Michael Sedlmair;Oliver Deussen;Dani Lischinski;Zhanglin Cheng;Yunhai Wang", "citationCount": "0", "affiliation": "Wang, YH (Corresponding Author), Shandong Univ, Jinan, Peoples R China. Cheng, ZL (Corresponding Author), SIAT, Shenzhen VesuCA Key Lab, Shenzhen, Peoples R China. Lu, Kecheng; Chen, Xin; Wang, Yunhai, Shandong Univ, Jinan, Peoples R China. Feng, Mi, Twitter Inc, San Francisco, CA USA. Lu, Kecheng; Deussen, Oliver; Cheng, Zhanglin, SIAT, Shenzhen VesuCA Key Lab, Shenzhen, Peoples R China. Sedlmair, Michael, Univ Stuttgart, VISUS, Stuttgart, Germany. Deussen, Oliver, Konstanz Univ, Constance, Germany. Lischinski, Dani, Hebrew Univ Jerusalem, Jerusalem, Israel.", "countries": "USA;Israel;Germany;China", "abstract": "We present an integrated approach for creating and assigning color palettes to different visualizations such as multi-class scatterplots, line, and bar charts. While other methods separate the creation of colors from their assignment, our approach takes data characteristics into account to produce color palettes, which are then assigned in a way that fosters better visual discrimination of classes. To do so, we use a customized optimization based on simulated annealing to maximize the combination of three carefully designed color scoring functions: point distinctness, name difference, and color discrimination. We compare our approach to state-of-the-art palettes with a controlled user study for scatterplots and line charts, furthermore we performed a case study. Our results show that Palettailor, as a fully-automated approach, generates color palettes with a higher discrimination quality than existing approaches. The efficiency of our optimization allows us also to incorporate user modifications into the color selection process.", "keywords": "Color Palette,Discriminability,Multi-Class Scatterplot,Line Chart,Bar Chart", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030406", "refList": ["10.1109/mcg.2014.82", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2012.196", "10.1145/3092703.3092726", "10.1109/tvcg.2014.48", "10.1145/3025453.3025957", "10.1145/2047196.2047247", "10.1145/3173574.3174168", "10.1109/icst.2019.00027", "10.1109/tvcg.2007.70594", "10.1145/3197517.3201311", "10.1145/3126594.3126653", "10.1109/mcg.2019.2924636", "10.1145/3180155.3180262", "10.1109/tvcg.2017.2659744", "10.1145/3123266.3123274", "10.1109/tvcg.2018.2865234", "10.1109/tvcg.2019.2934538", "10.1109/cvpr.2018.00592", "10.1145/2815833.2816956", "10.1109/tvcg.2018.2865138", "10.1109/tsmcc.2012.2218595", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13193", "10.1145/2775441.2775478", "10.1145/3313831.3376777", "10.1109/mc.2006.109", "10.1111/cgf.13686", "10.1109/tvcg.2015.2467091", "10.4230/dagrep.9.7.78", "10.1007/978-3-319-71249-9\\_9", "10.1007/s00778-019-00588-3", "10.1109/ase.2015.31", "10.1007/bf02124742", "10.1145/3025453.3025768", "10.1109/tvcg.2019.2934397", "10.1109/adprl.2007.368196", "10.1109/mcg.2020.2968244", "10.1145/3092703.3092712", "10.1109/tvcg.2017.2744320", "10.1023/a:1017992615625", "10.1145/2642918", "10.1145/2858036.2858558", "10.1145/3290605.3300358", "10.1109/tvcg.2019.2934431", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030385", "title": "Staged Animation Strategies for Online Dynamic Networks", "year": "2020", "conferenceName": "InfoVis", "authors": "Tarik Crnovrsanin;Shilpika;Senthil K. Chandrasegaran;Kwan-Liu Ma", "citationCount": "0", "affiliation": "Crnovrsanin, T (Corresponding Author), Univ Calif Davis, Davis, CA 95616 USA. Crnovrsanin, Tarik; Shilpika; Chandrasegaran, Senthil; Ma, Kwan-Liu, Univ Calif Davis, Davis, CA 95616 USA.", "countries": "USA", "abstract": "Dynamic networks-networks that change over time-can be categorized into two types: offline dynamic networks, where all states of the network are known, and online dynamic networks, where only the past states of the network are known. Research on staging animated transitions in dynamic networks has focused more on offline data, where rendering strategies can take into account past and future states of the network. Rendering online dynamic networks is a more challenging problem since it requires a balance between timeliness for monitoring tasks-so that the animations do not lag too far behind the events-and clarity for comprehension tasks-to minimize simultaneous changes that may be difficult to follow. To illustrate the challenges placed by these requirements, we explore three strategies to stage animations for online dynamic networks: time-based, event-based, and a new hybrid approach that we introduce by combining the advantages of the first two. We illustrate the advantages and disadvantages of each strategy in representing low- and high-throughput data and conduct a user study involving monitoring and comprehension of dynamic networks. We also conduct a follow-up, think-aloud study combining monitoring and comprehension with experts in dynamic network visualization. Our findings show that animation staging strategies that emphasize comprehension do better for participant response times and accuracy. However, the notion of “comprehension” is not always clear when it comes to complex changes in highly dynamic networks, requiring some iteration in staging that the hybrid approach affords. Based on our results, we make recommendations for balancing event-based and time-based parameters for our hybrid approach.", "keywords": "Dynamic networks,graph visualization,animation,mental map,user study", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030385", "refList": ["10.1109/infvis.2004.18", "10.1109/tvcg.2008.141", "10.1017/s0033291717001751", "10.1109/tvcg.2014.2346424", "10.1007/978-3-319-73915-1\\_31", "10.1145/2702123.27023123", "10.1111/cgf.12791", "10.1109/tvcg.2011.226", "10.1145/985692.985748", "10.1109/tvcg.2008.11", "10.1007/s10654-016-0149-3", "10.1109/tvcg.2011.185", "10.1145/1143518.1143521", "10.1109/tvcg.2011.213", "10.1109/tvcg.2013.254", "10.1006/ijhc.1017", "10.1109/tvcg.2011.169", "10.1111/j.1467-8659.2012.03093.x", "10.1016/j.ins.2015.04.017", "10.1057/ivs.2010.10", "10.1145/2576099", "10.1145/2858036.2858387", "10.1007/3-540-31190-4", "10.1109/tvcg.2013.238", "10.1093/aje/kwx259", "10.1145/3290607.3310432", "10.1109/visual.2019.8933748", "10.1109/tvcg", "10.1007/1155526124", "10.1145/1165734.1165736", "10.1080/00031305.2016.1154108", "10.1109/tvcg.2016.2592906", "10.1002/spe.4380211102", "10.1111/cgf.13206", "10.1109/tvcg.2013.163", "10.1109/tvcg.2006.166", "10.1109/tvcg.2018.2886901", "10.1109/tvcg.2019.2934397", "10.1109/tvcg.2015.2467751", "10.1109/wsc.2003.1261490", "10.1109/tvcg.2010.78", "10.1109/mc.2018.2890217", "10.1007/3", "10.1038/sdata.2014.56", "10.1111/cgf.12804", "10.1111/j.1467-8659.2009.01687.x", "10.2312/eurovisshort.20141149", "10.1109/tvcg.2013.205"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030396", "title": "What Makes a Data-GIF Understandable?", "year": "2020", "conferenceName": "InfoVis", "authors": "Xinhuan Shu;Aoyu Wu;Junxiu Tang;Benjamin Bach;Yingcai Wu;Huamin Qu", "citationCount": "1", "affiliation": "Wu, YC (Corresponding Author), Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Peoples R China. Shu, Xinhuan; Tang, Junxiu; Wu, Yingcai, Zhejiang Univ, State Key Lab CAD\\&CG, Hangzhou, Peoples R China. Shu, Xinhuan; Wu, Aoyu; Qu, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Shu, Xinhuan, Zhejiang Univ, Hangzhou, Peoples R China. Bach, Benjamin, Univ Edinburgh, Edinburgh, Midlothian, Scotland.", "countries": "Scotland;China", "abstract": "GIFs are enjoying increasing popularity on social media as a format for data-driven storytelling with visualization; simple visual messages are embedded in short animations that usually last less than 15 seconds and are played in automatic repetition. In this paper, we ask the question, “What makes a data-GIF understandable?” While other storytelling formats such as data videos, infographics, or data comics are relatively well studied, we have little knowledge about the design factors and principles for “data-GIFs”. To close this gap, we provide results from semi-structured interviews and an online study with a total of 118 participants investigating the impact of design decisions on the understandability of data-GIFs. The study and our consequent analysis are informed by a systematic review and structured design space of 108 data-GIFs that we found online. Our results show the impact of design dimensions from our design space such as animation encoding, context preservation, or repetition on viewers understanding of the GIF's core message. The paper concludes with a list of suggestions for creating more effective Data-GIFs.", "keywords": "Data-GIFs,Data-driven Storytelling,Evaluation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030396", "refList": ["10.1109/tvcg.2016.2598647", "10.1016/j.visinf.2020.07.001", "10.1177/1473871615594652", "10.1109/tvcg.2014.2346424", "10.1111/cgf.13195", "10.1109/vlsicircuits18222.2020.9162811", "10.1109/tvcg.2018.2864909", "10.1109/tvcg.2018.2864903", "10.1145/2702123.2702431", "10.1016/j.visinf.2019.12.002", "10.1145/3274349", "10.1111/cgf.13444", "10.1145/3206505.3206552", "10.1145/3290605.3300280", "10.1109/jstqe.2020.3021589", "10.1145/2647868.2656408", "10.1006/ijhc.1017", "10.1145/3290605.3300335", "10.1007/s12650-020-00689-0", "10.1145/2818048.2819936", "10.1111/cgf.13325", "10.1145/2858036.2858387", "10.1145/3027063.3053139", "10.1145/3290605.3300474", "10.1109/tvcg.2016.2598920", "10.1109/tvcg.2018.2864899", "10.1145/3290605.3300483", "10.1145/3173574.3173612", "10.1145/2909132.2909255", "10.1109/tvcg.2016.2598620", "10.1016/j.learninstruc.2007.09.013", "10.1109/tvcg.2007.70539", "10.1109/tvcg.2008.125", "10.1145/3173574.3173909", "10.1109/tvcg.2019.2934397", "10.1111/cgf.13709", "10.1109/tvcg.2013.234", "10.1109/tvcg.2019.2934401", "10.1145/2858036.2858532", "10.1016/j.visinf.2020.08.001", "10.1109/tvcg.2010.179", "10.1109/cicc48029.2020.9075900"], "wos": 1, "children": [], "len": 1}], "len": 9}, {"doi": "10.1109/tvcg.2019.2934208", "title": "Evaluating Perceptual Bias During Geometric Scaling of Scatterplots", "year": "2019", "conferenceName": "VAST", "authors": "Yating Wei;Honghui Mei;Ying Zhao;Shuyue Zhou;Bingru Lin;Haojing Jiang;Wei Chen", "citationCount": "5", "affiliation": "Chen, W (Corresponding Author), Zhejiang Univ, State Key Lab CAD \\& CG, Hangzhou 310058, Zhejiang, Peoples R China. Zhao, Y (Corresponding Author), Cent South Univ, Sch Comp Sci \\& Engn, Changsha 410083, Hunan, Peoples R China. Wei, Yating; Mei, Honghui; Zhou, Shuyue; Lin, Bingru; Chen, Wei, Zhejiang Univ, State Key Lab CAD \\& CG, Hangzhou 310058, Zhejiang, Peoples R China. Zhao, Ying; Jiang, Haojing, Cent South Univ, Sch Comp Sci \\& Engn, Changsha 410083, Hunan, Peoples R China.", "countries": "China", "abstract": "Scatterplots are frequently scaled to fit display areas in multi-view and multi-device data analysis environments. A common method used for scaling is to enlarge or shrink the entire scatterplot together with the inside points synchronously and proportionally. This process is called geometric scaling. However, geometric scaling of scatterplots may cause a perceptual bias, that is, the perceived and physical values of visual features may be dissociated with respect to geometric scaling. For example, if a scatterplot is projected from a laptop to a large projector screen, then observers may feel that the scatterplot shown on the projector has fewer points than that viewed on the laptop. This paper presents an evaluation study on the perceptual bias of visual features in scatterplots caused by geometric scaling. The study focuses on three fundamental visual features (i.e., numerosity, correlation, and cluster separation) and three hypotheses that are formulated on the basis of our experience. We carefully design three controlled experiments by using well-prepared synthetic data and recruit participants to complete the experiments on the basis of their subjective experience. With a detailed analysis of the experimental results, we obtain a set of instructive findings. First, geometric scaling causes a bias that has a linear relationship with the scale ratio. Second, no significant difference exists between the biases measured from normally and uniformly distributed scatterplots. Third, changing the point radius can correct the bias to a certain extent. These findings can be used to inspire the design decisions of scatterplots in various scenarios.", "keywords": "Evaluation,scatterplot,geometric scaling,bias,perceptual consistency", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934208", "refList": ["10.2307/2288843", "10.1109/tvcg.2017.2744359", "10.1109/tvcg.2015.2467732", "10.1109/tvcg.2014.2346979", "10.1126/science.216.4550.1138", "10.1109/tvcg.2017.2744138", "10.1111/j.1467-8659.2009.01467.x", "10.1145/2491568.2491577", "10.1109/mwc.2018.1700325", "10.1145/2449396.2449439", "10.1109/tvcg.2011.127", "10.1109/tvcg.2011.229", "10.1167/15.5.4", "10.1073/pnas.1113195108", "10.1145/2702123.2702545", "10.1109/vast.2009.5332628", "10.1109/tvcg.2018.2800013", "10.1007/s12650-018-0530-2", "10.1016/s0042-6989(97)00340-4", "10.1109/vast.2010.5652460", "10.1109/mcg.2018.2879067", "10.1109/tvcg.2018.2864912", "10.1109/pacificvis.2010.5429604", "10.1109/tcst.2018.2819965", "10.1167/10.2.10", "10.1145/2470654.2481318", "10.1145/1842993.1843002", "10.1167/12.6.8", "10.1109/tvcg.2013.124", "10.1057/ivs.2008.13", "10.1109/tvcg.2007.70596", "10.1109/tvcg.2018.2865266", "10.1145/3173574.3173664", "10.1109/tvcg.2015.2467671", "10.1016/j.cag.2017.07.004", "10.1177/0956797613501520", "10.1109/tvcg.2018.2865020", "10.1111/j.1467-8659.2012.03125.x", "10.3758/bf03205986", "10.3758/s13423-016-1174-7", "10.1109/tvcg.2017.2680452", "10.1109/mc.2006.109", "10.1109/tvcg.2017.2744098", "10.1038/srep32810", "10.1016/j.visres.2013.06.006", "10.1002/jhbs.20078", "10.1109/tvcg.2006.163", "10.1109/tvcg.2014.2346594", "10.1109/tvcg.2017.2744184", "10.1016/j.cognition.2007.10.009", "10.1109/tvcg.2018.2865142", "10.3758/app.72.7.1839", "10.1109/tvcg.2018.2810918", "10.1016/j.jvlc.2017.10.001", "10.1145/2682623", "10.1109/tvcg.2018.2864884", "10.1145/3025453.3025984", "10.1109/tvcg.2006.184", "10.1109/tvcg.2013.153", "10.1016/j.jvlc.2018.08.003", "10.1109/tvcg.2016.2520921", "10.1111/cgf.13446", "10.1017/s0022381612000187", "10.1145/2702123.2702406", "10.1109/vast.2012.6400487", "10.1109/tvcg.2013.183", "10.1177/1473871611415997", "10.1145/2702123.2702585", "10.1145/2993901.2993903", "10.1109/tvcg.2013.120", "10.1111/cgf.12632", "10.1145/1385569.1385602", "10.1109/tvcg.2017.2754480", "10.1111/j.1467-8659.2009.01694.x"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030456", "title": "Cartographic Relief Shading with Neural Networks", "year": "2020", "conferenceName": "InfoVis", "authors": "Bernhard Jenny;Magnus Heitzler;Dilpreet Singh;Marianna Farmakis-Serebryakova;Jeffery Chieh Liu;Lorenz Hurni", "citationCount": "4", "affiliation": "Jenny, B (Corresponding Author), Monash Univ, Melbourne, Vic, Australia. Jenny, Bernhard; Singh, Dilpreet; Liu, Jeffery Chieh, Monash Univ, Melbourne, Vic, Australia. Heitzler, Magnus; Farmakis-Serebryakova, Marianna; Hurni, Lorenz, Swiss Fed Inst Technol, Inst Cartog \\& Geoinformat, Zurich, Switzerland.", "countries": "Switzerland;Australia", "abstract": "Shaded relief is an effective method for visualising terrain on topographic maps, especially when the direction of illumination is adapted locally to emphasise individual terrain features. However, digital shading algorithms are unable to fully match the expressiveness of hand-crafted masterpieces, which are created through a laborious process by highly specialised cartographers. We replicate hand-drawn relief shading using U-Net neural networks. The deep neural networks are trained with manual shaded relief images of the Swiss topographic map series and terrain models of the same area. The networks generate shaded relief that closely resemble hand-drawn shaded relief art. The networks learn essential design principles from manual relief shading such as removing unnecessary terrain details, locally adjusting the illumination direction to accentuate individual terrain features, and varying brightness to emphasise larger landforms. Neural network shadings are generated from digital elevation models in a few seconds, and a study with 18 relief shading experts found that they are of high quality.", "keywords": "Relief shading,shaded relief,hillshade,neural rendering,illustrative visualisation,image-to-image translation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030456", "refList": ["10.1145/1456650.1456652", "10.1145/1145/1556262.1556270", "10.1145/345513.345271", "10.1109/tvcg.2019.2934803", "10.1145/3180658", "10.1109/tridui.2006.1618264", "10.3389/fict.2018.00015", "10.1109/vr.2018.8447558", "10.1518/hfes.45.1.160.27234", "10.1145/3290605.3300377", "10.1089/cpb.2006.9.157", "10.1007/s00779-011-0500-3", "10.1109/vl.1996.545307", "10.1109/tvcg.2019.2934415", "10.1109/5.726791", "10.1145/3290605.3300288", "10.1109/tvcg.2017.2745941", "10.1109/vr.2001.913779", "10.1145/586081.586086", "10.18637/jss.v067.i01", "10.1145/1502800.1502805", "10.1145/1165734.1165736", "10.1145/3126594.3126613", "10.1109/tvcg.2008.109", "10.1109/tvcg.2017.2744184", "10.1016/j.cola.2019.100937", "10.1109/visual.2019.8933545", "10.1145/3290605.3300555", "10.1111/cgf.13431", "10.1109/tvcg.2019.2934395", "10.1109/vr.2019.8798340", "10.1145/3025453.3026046", "10.1109/vr.2019.8797871", "10.1145/3290605.3300752", "10.1109/tvcg.2016.2520921", "10.1109/tvcg.2018.2865191", "10.1145/1970378.1970384", "10.1109/tvcg.2019.2934208", "10.18637/jss.v069.i01", "10.1162/105474698565659", "10.1145/1124772.1124775", "10.1109/vrais.1997.583043"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030443", "title": "CAVA: A Visual Analytics System for Exploratory Columnar Data Augmentation Using Knowledge Graphs", "year": "2020", "conferenceName": "VAST", "authors": "Dylan Cashman;Shenyu Xu;Subhajit Das;Florian Heimerl;Cong Liu;Shah Rukh Humayoun;Michael Gleicher;Alex Endert;Remco Chang", "citationCount": "0", "affiliation": "Cashman, D (Corresponding Author), Tufts Univ, Medford, MA 02155 USA. Cashman, Dylan; Liu, Cong; Chang, Remco, Tufts Univ, Medford, MA 02155 USA. Xu, Shenyu; Das, Subhajit; Endert, Alex, Georgia Tech, Atlanta, GA USA. Heimerl, Florian; Gleicher, Michael, Univ Wisconsin, Madison, WI 53706 USA. Humayoun, Shah Rukh, San Francisco State Univ, San Francisco, CA 94132 USA.", "countries": "USA", "abstract": "Most visual analytics systems assume that all foraging for data happens before the analytics process; once analysis begins, the set of data attributes considered is fixed. Such separation of data construction from analysis precludes iteration that can enable foraging informed by the needs that arise in-situ during the analysis. The separation of the foraging loop from the data analysis tasks can limit the pace and scope of analysis. In this paper, we present CAVA, a system that integrates data curation and data augmentation with the traditional data exploration and analysis tasks, enabling information foraging in-situ during analysis. Identifying attributes to add to the dataset is difficult because it requires human knowledge to determine which available attributes will be helpful for the ensuing analytical tasks. CAVA crawls knowledge graphs to provide users with a a broad set of attributes drawn from external data to choose from. Users can then specify complex operations on knowledge graphs to construct additional attributes. CAVA shows how visual analytics can help users forage for attributes by letting users visually explore the set of available data, and by serving as an interface for query construction. It also provides visualizations of the knowledge graph itself to help users understand complex joins such as multi-hop aggregations. We assess the ability of our system to enable users to perform complex data combinations without programming in a user study over two datasets. We then demonstrate the generalizability of CAVA through two additional usage scenarios. The results of the evaluation confirm that CAVA is effective in helping the user perform data foraging that leads to improved analysis outcomes, and offer evidence in support of integrating data augmentation as a part of the visual analytics pipeline.", "keywords": "Visual Analytics,Information Foraging,Data Augmentation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030443", "refList": ["10.1057/palgrave.ivs.9500122", "10.1109/tvcg.2016.2598867", "10.1111/cgf.13708", "10.1109/tvcg.2019.2934799", "10.1109/tvcg.2019.2934541", "10.1109/tvcg.2013.65", "10.1109/tvcg.2018.2875702", "10.1109/iv.2004.1320207", "10.1068/p260471", "10.1145/1778765.1778816", "10.1109/tvcg.2018.2808489", "10.1109/tvcg.2018.2864912", "10.1016/j.apgeog.2015.12.006", "10.1111/j.1467-8659.2011.01960.x", "10.1109/tvcg.2018.2864843", "10.1109/pacificvis.2010.5429604", "10.1109/tvcg.2014.2346898", "10.1109/5.726791", "10.1177/1475090214540874", "10.1109/icde.2016.7498287", "10.1145/1556262.1556289", "10.1109/tvcg.2007.70535", "10.1109/vast.2012.6400489", "10.1145/1056808.1056914", "10.1016/j.neucom.2014.09.063", "10.1145/7529.8927", "10.1109/tvcg.2016.2598495", "10.1109/tvcg.2016.2607204", "10.1109/vast47406.2019.8986943", "10.3758/bf03205986", "10.1109/infvis.2005.1532142", "10.1145/1150402.1150479", "10.1109/tvcg.2017.2674978", "10.1109/tvcg.2019.2945960", "10.1109/tvcg.2017.2744098", "10.1109/tvcg.2017.2674999", "10.1109/tvcg.2011.279", "10.1109/tvcg.2014.2346594", "10.1109/tvcg.2017.2744184", "10.1111/cgf.12876", "10.1007/s4095-020-0191-7", "10.1007/s11390-015-1535-0", "10.1111/cgf.12640", "10.1109/tvcg.2016.2598667", "10.1111/cgf.13683", "10.1109/tvcg.2013.153", "10.1109/tvcg.2019.2934208", "10.1109/tvcg.2019.2934655", "10.1111/cgf.12655", "10.1007/s11023-010-9221-z", "10.1109/vast.2012.6400487", "10.1145/2702123.2702585", "10.1007/bf00310175", "10.1109/tvcg.2017.2744378", "10.1103/physreve.64.061907", "10.1109/ldav.2017.8231848", "10.1109/tvcg.2016.2598831"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030432", "title": "Evaluation of Sampling Methods for Scatterplots", "year": "2020", "conferenceName": "VAST", "authors": "Jun Yuan;Shouxing Xiang;Jiazhi Xia;Lingyun Yu;Shixia Liu", "citationCount": "0", "affiliation": "Liu, SX (Corresponding Author), Tsinghua Univ, BNRist, Beijing, Peoples R China. Yuan, Jun; Xiang, Shouxing; Liu, Shixia, Tsinghua Univ, BNRist, Beijing, Peoples R China. Xia, Jiazhi, Cent South Univ, Changsha, Peoples R China. Yu, Lingyun, Xian Jiaotong Liverpool Univ, Suzhou, Peoples R China.", "countries": "China", "abstract": "Given a scatterplot with tens of thousands of points or even more, a natural question is which sampling method should be used to create a small but “good” scatterplot for a better abstraction. We present the results of a user study that investigates the influence of different sampling strategies on multi-class scatterplots. The main goal of this study is to understand the capability of sampling methods in preserving the density, outliers, and overall shape of a scatterplot. To this end, we comprehensively review the literature and select seven typical sampling strategies as well as eight representative datasets. We then design four experiments to understand the performance of different strategies in maintaining: 1) region density; 2) class density; 3) outliers; and 4) overall shape in the sampling results. The results show that: 1) random sampling is preferred for preserving region density; 2) blue noise sampling and random sampling have comparable performance with the three multi-class sampling strategies in preserving class density; 3) outlier biased density based sampling, recursive subdivision based sampling, and blue noise sampling perform the best in keeping outliers; and 4) blue noise sampling outperforms the others in maintaining the overall shape of a scatterplot.", "keywords": "Scatterplot,data sampling,empirical evaluation", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030432", "refList": ["10.1057/palgrave.ivs.9500122", "10.1109/tvcg.2016.2598867", "10.1109/tvcg.2015.2467591", "10.1111/cgf.13708", "10.1109/tvcg.2019.2934799", "10.1109/tvcg.2019.2934541", "10.1109/tvcg.2013.65", "10.1109/iv.2004.1320207", "10.1068/p260471", "10.1145/1778765.1778816", "10.1109/tvcg.2018.2808489", "10.1109/tvcg.2018.2864912", "10.1016/j.apgeog.2015.12.006", "10.1111/j.1467-8659.2011.01960.x", "10.1109/tvcg.2018.2864843", "10.1109/pacificvis.2010.5429604", "10.1109/tvcg.2014.2346898", "10.1109/5.726791", "10.1177/1475090214540874", "10.1145/1556262.1556289", "10.1109/tvcg.2007.70535", "10.1109/vast.2012.6400489", "10.1145/1056808.1056914", "10.1016/j.neucom.2014.09.063", "10.1145/7529.8927", "10.1109/tvcg.2016.2607204", "10.1109/vast47406.2019.8986943", "10.3758/bf03205986", "10.1109/infvis.2005.1532142", "10.1145/1150402.1150479", "10.1109/tvcg.2017.2674978", "10.1109/tvcg.2017.2744098", "10.1109/tvcg.2017.2674999", "10.1109/tvcg.2011.279", "10.1109/tvcg.2014.2346594", "10.1109/tvcg.2017.2744184", "10.1111/cgf.12876", "10.1109/1011101.2019.2945960", "10.1007/s4095-020-0191-7", "10.1007/s11390-015-1535-0", "10.1111/cgf.12640", "10.1109/tvcg.2016.2598667", "10.1111/cgf.13683", "10.1109/tvcg.2013.153", "10.1109/tvcg.2019.2934208", "10.1109/tvcg.2019.2934655", "10.1111/cgf.12655", "10.1007/s11023-010-9221-z", "10.1109/vast.2012.6400487", "10.1145/2702123.2702585", "10.1007/bf00310175", "10.1109/tvcg.2017.2744378", "10.1103/physreve.64.061907", "10.1109/ldav.2017.8231848", "10.1109/tvcg.2016.2598831"], "wos": 1, "children": [], "len": 1}], "len": 7}, {"doi": "10.1111/cgf.13716", "year": "2019", "title": "Augmenting Tactile 3D Data Navigation With Pressure Sensing", "conferenceName": "EuroVis", "authors": "Xiyao Wang;Lonni Besan{\\c{c}}on;Mehdi Ammi;Tobias Isenberg", "citationCount": "1", "affiliation": "Wang, XY (Corresponding Author), INRIA, Rocquencourt, France.\nWang, XY (Corresponding Author), Univ Paris Saclay, St Aubin, France.\nWang, Xiyao; Isenberg, Tobias, INRIA, Rocquencourt, France.\nWang, Xiyao, Univ Paris Saclay, St Aubin, France.\nBesancon, Lonni, Linkoping Univ, Norrkoping, Sweden.\nAmmi, Mehdi, Univ Paris 08, St Denis, France.", "countries": "Sweden;France", "abstract": "We present a pressure-augmented tactile 3D data navigation technique, specifically designed for small devices, motivated by the need to support the interactive visualization beyond traditional workstations. While touch input has been studied extensively on large screens, current techniques do not scale to small and portable devices. We use phone-based pressure sensing with a binary mapping to separate interaction degrees of freedom (DOF) and thus allow users to easily select different manipulation schemes (e. g., users first perform only rotation and then with a simple pressure input to switch to translation). We compare our technique to traditional 3D-RST (rotation, scaling, translation) using a docking task in a controlled experiment. The results show that our technique increases the accuracy of interaction, with limited impact on speed. We discuss the implications for 3D interaction design and verify that our results extend to older devices with pseudo pressure and are valid in realistic phone usage scenarios.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13716", "refList": ["10.1145/2207676.2208589", "10.1145/2788940.2788950", "10.1109/38.974511", "10.1145/1731903.1731930", "10.1038/nature.2016.19503", "10.1145/2559206.2578881", "10.1145/985692.985754", "10.1145/1851600.1851631", "10.1145/1124772.1124801", "10.1145/1643928.1643942", "10.1177/0956797613504966", "10.1109/mc.2013.178", "10.1109/mcg.2010.30", "10.1109/tvcg.2017.2744019", "10.1109/tvcg.2015.2440233", "10.1145/2992154.2996779", "10.1007/978-3-030-01388-2\\_4", "10.1145/3025453.3025565", "10.1109/tvcg.2016.2599217", "10.4108/icst.mobiquitous.2014.257919", "10.1109/tvcg.2004.1260759", "10.1207/s15327051hci0702\\_1", "10.1201/b17511", "10.7717/peerj.3544", "10.1016/b978-0-08-051574-8.50051-0", "10.1145/964696.964721", "10.1007/978-3-319-45853-3\\_6", "10.3390/s150101022", "10.1145/2642918.2647392", "10.1145/2207676.2208691", "10.1109/mcg.2004.20", "10.1145/2037373.2037393", "10.1145/2702123.2702371", "10.1145/3290607.3310432", "10.1145/2702123.2702300", "10.1145/1979742.1979895", "10.1111/j.1467-8659.2012.03197.x", "10.1145/2858036.2858095", "10.1109/3dui.2011.5759220", "10.1145/2493190.2493193", "10.1145/302979.302983", "10.1145/2541016.2541024", "10.1145/1054972.1055055", "10.1162/105474602317343640", "10.1145/2414536.2414572", "10.1145/2468356.2468578", "10.1038/nmeth.2659", "10.1109/tvcg.2011.283", "10.1016/0022-1031(71)90078-3", "10.1145/1868914.1868958", "10.1109/tvcg.2018.2865142", "10.1145/3025453.3025890", "10.1145/1140491.1140502", "10.1177/154193120605000909", "10.1109/tvcg.2018.2848906", "10.1145/2993148.2993152", "10.1007/s00779-018-1147-0", "10.4324/9780203807002", "10.1145/3027063.3053151", "10.1145/2371574.2371582", "10.1145/2396636.2396674", "10.1145/1088463.1088507", "10.1145/300523.300546", "10.1145/3025453.3025863", "10.1109/tvcg.2012.251", "10.1109/tridui.2006.1618267", "10.1109/tvcg.2011.224", "10.1080/01973533.2015.1060240", "10.1007/978-3-319-26633-6\\_13", "10.1145/1889863.1889888", "10.1109/tvcg.2010.157", "10.1109/tvcg.2007.70515", "10.1109/tabletop.2006.26", "10.1145/965139.807392", "10.1145/2983310.2985750", "10.20380/gi2009.23"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13992", "year": "2020", "title": "Feature Driven Combination of Animated Vector Field Visualizations", "conferenceName": "EuroVis", "authors": "Mar{\\'{\\i}}a{-}Jes{\\'{u}}s Lobo;Alexandru C. Telea;Christophe Hurter", "citationCount": "0", "affiliation": "Lobo, MJ (Corresponding Author), Ecole Natl Aviat Civile, Toulouse, France.\nLobo, M-J.; Hurter, C., Ecole Natl Aviat Civile, Toulouse, France.\nTelea, A. C., Univ Utrecht, Utrecht, Netherlands.", "countries": "France;Netherlands", "abstract": "Animated visualizations are one of the methods for finding and understanding complex structures of time-dependent vector fields. Many visualization designs can be used to this end, such as streamlines, vector glyphs, and image-based techniques. While all such designs can depict any vector field, their effectiveness in highlighting particular field aspects has not been fully explored. To fill this gap, we compare three animated vector field visualization techniques, OLIC, IBFV, and particles, for a critical point detection-and-classification task through a user study. Our results show that the effectiveness of the studied techniques depends on the nature of the critical points. We use these results to design a new flow visualization technique that combines all studied techniques in a single view by locally using the most effective technique for the patterns present in the flow data at that location. A second user study shows that our technique is more efficient and less error prone than the three other techniques used individually for the critical point detection task.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13992", "refList": ["10.1109/ca.1997.601035", "10.1109/tvcg.2013.10", "10.1109/2.35197", "10.1016/0004-3702(81)90024-2", "10.1109/visual.1999.809905", "10.1016/j.compenvurbsys.2014.01.005", "10.1111/cgf.12662", "10.1109/visual.2003.1250363", "10.1007/978-3-540-70823-0\\_1", "10.1145/3078714.3078715", "10.1111/j.1467-8659.2008.01234.x", "10.1177/0956797613504966", "10.1109/tvcg.2008.36", "10.1109/tvcg.2004.1260754", "10.1111/j.1467-8659.2008.01201.x", "10.1111/j.1467-8659.2004.00753.x", "10.1109/visual.1997.663899", "10.1109/tvcg.2003.1207436", "10.1109/tvcg.2011.233", "10.1145/800186.810616", "10.1109/visual.2004.32", "10.1109/mcg.2006.88", "10.1111/j.1467-8659.2012.03103.x", "10.1007/978-3-540-70823-0\\_5", "10.1145/2931002.2931012", "10.1109/tvcg.2016.2515611", "10.1177/1473871612465214", "10.1111/j.1467-8659.2011.01927.x", "10.1109/mcg.2018.2880821", "10.1109/tvcg.2011.110", "10.1109/tvcg.2010.131", "10.1111/j.1467-8659.2010.01650.x", "10.1109/visual.1991.175773", "10.1109/tvcg.2018.2865142", "10.1111/j.1467-8659.2012.03079.x", "10.1109/tvcg.2015.2467153", "10.1109/visual.1997.663897", "10.1109/tvcg.2005.87", "10.1109/tvcg.2005.4", "10.1177/109434208900300203", "10.1111/cgf.13528", "10.1109/tools.1999.778999", "10.1109/pacificvis.2015.7156354", "10.1111/j.1467-8659.2003.00723.x", "10.1109/tvcg.2012.170", "10.1109/tvcg.2012.316", "10.1007/978-3-319-26633-6\\_13", "10.1109/tvcg.2004.39", "10.1109/mcg.2004.1274065"], "wos": 1, "children": [], "len": 1}], "len": 23}, "index": 825, "embedding": [1.351241111755371, 1.4477421045303345, -1.0626764297485352, -2.5201807022094727, -0.6737499833106995, 0.16650904715061188, -0.7139257192611694, 2.330252170562744, -0.19080057740211487, 3.3116648197174072, -0.6020879745483398, 0.3906417787075043, -0.13027368485927582, 1.2601255178451538, 0.5971684455871582, 3.1375279426574707, 1.0170518159866333, 8.001445770263672, -0.6413080096244812, 1.163219928741455, -0.06630208343267441, 2.8094468116760254, 0.013735074549913406, 3.158334970474243, -2.334244728088379, 2.1661317348480225, -0.5483691096305847, 1.8183605670928955, 1.7511224746704102, 0.665785014629364, 0.04523318260908127, 2.135037660598755], "projection": [-0.37806403636932373, 10.721294403076172], "size": 12, "height": 3, "width": 7}