{"data": {"doi": "10.1109/tvcg.2018.2865158", "title": "Charticulator: Interactive Construction of Bespoke Chart Layouts", "year": "2018", "conferenceName": "InfoVis", "authors": "Donghao Ren;Bongshin Lee;Matthew Brehmer", "citationCount": "11", "affiliation": "Ren, DH (Corresponding Author), Univ Calif Santa Barbara, Santa Barbara, CA 93106 USA. Ren, DH (Corresponding Author), Microsoft Res, Redmond, WA 98052 USA. Ren, Donghao, Univ Calif Santa Barbara, Santa Barbara, CA 93106 USA. Ren, Donghao; Lee, Bongshin; Brehmer, Matthew, Microsoft Res, Redmond, WA 98052 USA.", "countries": "USA", "abstract": "We present Charticulator, an interactive authoring tool that enables the creation of bespoke and reusable chart layouts. Charticulator is our response to most existing chart construction interfaces that require authors to choose from predefined chart layouts, thereby precluding the construction of novel charts. In contrast, Charticulator transforms a chart specification into mathematical layout constraints and automatically computes a set of layout attributes using a constraint-solving algorithm to realize the chart. It allows for the articulation of compound marks or glyphs as well as links between these glyphs, all without requiring any coding or knowledge of constraint satisfaction. Furthermore, thanks to the constraint-based layout approach, Charticulator can export chart designs into reusable templates that can be imported into other visualization tools. In addition to describing Charticulator's conceptual framework and design, we present three forms of evaluation: a gallery to illustrate its expressiveness, a user study to verify its usability, and a click-count comparison between Charticulator and three existing tools. Finally, we discuss the limitations and potentials of Charticulator as well as directions for future research. Charticulator is available with its source code at https://charticulator.com.", "keywords": "Interactive visualization authoring,Chart layout design,Glyph design,Constraint-based design,Reusable chart layout", "link": "http://dx.doi.org/10.1109/TVCG.2018.2865158", "refList": ["10.1145/504704.504705", "10.1145/964696.964710", "10.1109/tvcg.2015.2467732", "10.1007/978-0-387-98141-3\\_1", "10.1145/2858036.2858075", "10.1145/2858036.2858435", "10.1109/tvcg.2011.185", "10.1145/2501988.2502046", "10.1145/358886.358895", "10.1109/tvcg.2016.2598609", "10.1109/pacificvis.2017.8031599", "10.1016/j.visinf.2018.04.008", "10.1109/vl.2000.874345", "10.1145/74878.74917", "10.1145/3125571.3125585", "10.1023/a:1009708715411", "10.2312/pe.eurovisshorteurovisshort2013.019-023", "10.1109/tvcg.2006.147", "10.1145/2207676.2208292", "10.1111/cgf.12391", "10.1145/263407.263521", "10.1109/tvcg.2015.2467091", "10.1109/tvcg.2016.2598620", "10.1007/s00146-006-0050-9", "10.1109/tvcg.2014.2346291", "10.1109/2945.981851", "10.1016/04c.2017.10.001", "10.1145/3173574.3173909", "10.1109/tvcg.2009.174", "10.1109/tvcg.2015.2467191", "10.1145/3173574.3173697", "10.1145/3173574.3173797", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934784", "title": "A Comparison of Radial and Linear Charts for Visualizing Daily Patterns", "year": "2019", "conferenceName": "InfoVis", "authors": "Manuela Waldner;Alexandra Diehl;Denis Gracanin;Rainer Splechtna;Claudio Delrieux;Kresimir Matkovic", "citationCount": "0", "affiliation": "Waldner, M (Corresponding Author), TU Wien, Vienna, Austria. Waldner, Manuela, TU Wien, Vienna, Austria. Diehl, Alexandra, Univ Zurich, Zurich, Switzerland. Gracanin, Denis, Virginia Tech, Blacksburg, VA USA. Splechtna, Rainer; Matkovic, Kresimir, VRVis Res Ctr, Vienna, Austria. Delrieux, Claudio, Univ Nacl Sur, Elect \\& Comp Eng Dept, Bahia Blanca, Buenos Aires, Argentina.", "countries": "Argentina;Switzerland;USA;Austria", "abstract": "Radial charts are generally considered less effective than linear charts. Perhaps the only exception is in visualizing periodical time-dependent data, which is believed to be naturally supported by the radial layout. It has been demonstrated that the drawbacks of radial charts outweigh the benefits of this natural mapping. Visualization of daily patterns, as a special case, has not been systematically evaluated using radial charts. In contrast to yearly or weekly recurrent trends, the analysis of daily patterns on a radial chart may benefit from our trained skill on reading radial clocks that are ubiquitous in our culture. In a crowd-sourced experiment with 92 non-expert users, we evaluated the accuracy, efficiency, and subjective ratings of radial and linear charts for visualizing daily traffic accident patterns. We systematically compared juxtaposed 12-hours variants and single 24-hours variants for both layouts in four low-level tasks and one high-level interpretation task. Our results show that over all tasks, the most elementary 24-hours linear bar chart is most accurate and efficient and is also preferred by the users. This provides strong evidence for the use of linear layouts – even for visualizing periodical daily patterns.", "keywords": "Radial charts,time series series data,daily patterns,crowd-sourced experiment", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934784", "refList": ["10.1109/infvis.2000.885091", "10.1109/tvcg.2018.2865158", "10.1177/1473871611406623", "10.1111/cgf.13444", "10.1038/scientificamerican0384-128", "10.1109/tvcg.2018.2865234", "10.1109/tvcg.2015.2467771", "10.1109/tvcg.2018.2865077", "10.1109/tvcg.2013.184", "10.1109/tvcg.2014.2346320", "10.1145/2858036.2858300", "10.1109/tvcg.2017.2674958", "10.1109/iv.2013.12", "10.1145/2470654.2466443", "10.1007/s10763-012-9362-z", "10.1207/s15427625tcq1402\\_3", "10.2307/2288400", "10.1136/jnnp.64.5.588", "10.1109/tvcg.2014.2346426", "10.1109/infvis.1998.729557", "10.1007/bf03217308", "10.1145/506443.506505", "10.1109/infvis.2001.963273", "10.1111/j.1467-8659.2011.01947.x", "10.1109/tvcg.2013.234", "10.1109/38.974517", "10.2312/pe/eurovisshort/eurovisshort2012/097-101", "10.1145/1743546.1743567", "10.1109/tvcg.2010.162", "10.2307/2289447", "10.1145/2110192.2110202", "10.1109/tvcg.2009.23", "10.3102/10769986030004353", "10.1109/tvcg.2010.209"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2019.2934281", "title": "Critical Reflections on Visualization Authoring Systems", "year": "2019", "conferenceName": "InfoVis", "authors": "Arvind Satyanarayan;Bongshin Lee;Donghao Ren;Jeffrey Heer;John T. Stasko;John Thompson 0002;Matthew Brehmer;Zhicheng Liu", "citationCount": "6", "affiliation": "Satyanarayan, A (Corresponding Author), MIT, 77 Massachusetts Ave, Cambridge, MA 02139 USA. Satyanarayan, Arvind, MIT, 77 Massachusetts Ave, Cambridge, MA 02139 USA. Lee, Bongshin; Brehmer, Matthew, Microsoft Res, Redmond, WA USA. Ren, Donghao, Univ Calif Santa Barbara, Santa Barbara, CA USA. Heer, Jeffrey, Univ Washington, Seattle, WA 98195 USA. Stasko, John; Thompson, John, Georgia Inst Technol, Atlanta, GA 30332 USA. Liu, Zhicheng, Adobe Res, San Jose, CA USA.", "countries": "USA", "abstract": "An emerging generation of visualization authoring systems support expressive information visualization without textual programming. As they vary in their visualization models, system architectures, and user interfaces, it is challenging to directly compare these systems using traditional evaluative methods. Recognizing the value of contextualizing our decisions in the broader design space, we present critical reflections on three systems we developed —Lyra, Data Illustrator, and Charticulator. This paper surfaces knowledge that would have been daunting within the constituent papers of these three systems. We compare and contrast their (previously unmentioned) limitations and trade-offs between expressivity and learnability. We also reflect on common assumptions that we made during the development of our systems, thereby informing future research directions in visualization authoring systems.", "keywords": "Critical reflection,visualization authoring,expressivity,learnability,reusability", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934281", "refList": ["10.1145/344949.344959", "10.1109/tvcg.2018.2865158", "10.1145/2642918.2647360", "10.1016/0142-694x(91)90003-f", "10.1145/2858036.2858435", "10.1109/tvcg.2011.185", "10.2312/pe.eurovisshort.eurovisshort2013.019-023", "10.1145/2598153.2598175", "10.1109/tvcg.2016.2598609", "10.1145/22949.22950", "10.1145/3025453.3025942", "10.1016/j.visinf.2018.04.008", "10.1145/3173574.3174212", "10.1145/1054972.1055012", "10.1145/3125571.3125585", "10.1145/2939502.2939506", "10.1111/cgf.12391", "10.1109/tvcg.2015.2467091", "10.1145/3173574.3173797", "10.1109/tvcg.2015.2467271", "10.1145/1879831.1879836", "10.1109/tvcg.2016.2598620", "10.1007/s00146-006-0050-9", "10.1109/tvcg.2014.2346291", "10.1109/2945.981851", "10.1145/3173574.3173909", "10.1109/tvcg.2009.174", "10.1111/cgf.12635", "10.1109/tvcg.2015.2467191", "10.1145/3173574.3173697", "10.1207/s15327051hci0104\\_2", "10.1109/mcg.2019.2914844", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3029413", "title": "A Design Space of Vision Science Methods for Visualization Research", "year": "2020", "conferenceName": "InfoVis", "authors": "Madison A. Elliott;Christine Nothelfer;Cindy Xiong;Danielle Albers Szafir", "citationCount": "0", "affiliation": "Elliott, MA (Corresponding Author), Univ British Columbia, Vancouver, BC, Canada. Elliott, Madison A., Univ British Columbia, Vancouver, BC, Canada. Nothelfer, Christine, Northwestern Univ, Evanston, IL 60208 USA. Xiong, Cindy, Univ Massachusetts, Amherst, MA 01003 USA. Szafir, Danielle Albers, Univ Colorado, Boulder, CO 80309 USA.", "countries": "Canada;USA", "abstract": "A growing number of efforts aim to understand what people see when using a visualization. These efforts provide scientific grounding to complement design intuitions, leading to more effective visualization practice. However, published visualization research currently reflects a limited set of available methods for understanding how people process visualized data. Alternative methods from vision science offer a rich suite of tools for understanding visualizations, but no curated collection of these methods exists in either perception or visualization research. We introduce a design space of experimental methods for empirically investigating the perceptual processes involved with viewing data visualizations to ultimately inform visualization design guidelines. This paper provides a shared lexicon for facilitating experimental visualization research. We discuss popular experimental paradigms, adjustment types, response types, and dependent measures used in vision science research, rooting each in visualization examples. We then discuss the advantages and limitations of each technique. Researchers can use this design space to create innovative studies and progress scientific understanding of design choices and evaluations in visualization. We highlight a history of collaborative success between visualization and vision science research and advocate for a deeper relationship between the two fields that can elaborate on and extend the methodological design space for understanding visualization and vision.", "keywords": "Perception,human vision,empirical research,evaluation,HCI", "link": "http://dx.doi.org/10.1109/TVCG.2020.3029413", "refList": ["10.1109/tvcg.2019.2934790", "10.1177/146879410200200205", "10.2312/eurovisshort", "10.1109/tvcg.2015.2467811", "10.1111/j.1467-6486.2009.00859.x", "10.1177/1473871613510429", "10.1109/tvcg.2018.2864836", "10.1109/tvcg.2018.2865076", "10.1109/tvcg.2013.231", "10.1002/cphy.c100079", "10.1177/0886109909354981", "10.1109/tvcg.2018.2865149", "10.1080/1750984x.2017.1317357", "10.1007/978-3-7643-8472-2\\_6", "10.1093/bioinformatics/btq110", "10.1111/cgf.13728", "10.2307/1511837", "10.1109/tvcg.2019.2934539", "10.3233/efi-2004-22201", "10.1002/chp.1340180402", "10.1111/2041-210x.12034", "10.1111/j.2041-210x.2011.00169.x", "10.1109/tvcg.2015.2467452", "10.1002/chp", "10.1177/1077800410383121", "10.1177/1744987107081254", "10.1002/cpbi.96", "10.1109/tvcg.2018.2864526", "10.1109/beliv.2018.8634026", "10.2307/1511637", "10.1109/tvcg.2014.2346431", "10.1111/cgf.12883", "10.1109/tvcg.2019.2934281", "10.1145/2993901.2993916", "10.2307/3178066", "10.1145/2993901.2993913", "10.1145/1182475.1182476", "10.1016/j.destud.2004.06.002", "10.1177/1609406918763214", "10.2312/eurovisshort.20151137", "10.1145/882262.882291", "10.1177/174498710501000305", "10.1017/s1049096513001789", "10.1109/tvcg.2012.213", "10.1093/nar/gkz239", "10.1093/sysbio/sys062", "10.1109/tvcg.2019.2898186", "10.1109/tvcg.2018.2811488", "10.1007/s11135-006-9044-4", "10.1109/tvcg.2009.111", "10.1111/2041-210x.12066", "10.1109/mcg.2018.2874523", "10.1177/1609406920909938"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030403", "title": "Calliope: Automatic Visual Data Story Generation from a Spreadsheet", "year": "2020", "conferenceName": "InfoVis", "authors": "Danqing Shi;Xinyue Xu;Fuling Sun;Yang Shi 0007;Nan Cao", "citationCount": "0", "affiliation": "Cao, N (Corresponding Author), Tongji Univ, Intelligent Big Data Visualizat Lab, Shanghai, Peoples R China. Shi, Danqing; Xu, Xinyue; Sun, Fuling; Shi, Yang; Cao, Nan, Tongji Univ, Intelligent Big Data Visualizat Lab, Shanghai, Peoples R China.", "countries": "China", "abstract": "Visual data stories shown in the form of narrative visualizations such as a poster or a data video, are frequently used in data-oriented storytelling to facilitate the understanding and memorization of the story content. Although useful, technique barriers, such as data analysis, visualization, and scripting, make the generation of a visual data story difficult. Existing authoring tools rely on users' skills and experiences, which are usually inefficient and still difficult. In this paper, we introduce a novel visual data story generating system, Calliope, which creates visual data stories from an input spreadsheet through an automatic process and facilities the easy revision of the generated story based on an online story editor. Particularly, Calliope incorporates a new logic-oriented Monte Carlo tree search algorithm that explores the data space given by the input spreadsheet to progressively generate story pieces (i.e., data facts) and organize them in a logical order. The importance of data facts is measured based on information theory, and each data fact is visualized in a chart and captioned by an automatically generated description. We evaluate the proposed technique through three example stories, two controlled experiments, and a series of interviews with 10 domain experts. Our evaluation shows that Calliope is beneficial to efficient visual data story generation.", "keywords": "Information Visualization,Visual Storytelling,Data Story", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030403", "refList": ["10.1007/s11063-017-9759-3", "10.1109/tvcg.2016.2598647", "10.1162/0891201054223977", "10.1109/tvcg.2015.2467732", "10.3390/info9030065", "10.1109/tvcg.2019.2934398", "10.1016/j.visinf.2018.12.001", "10.1145/2002353.2002355", "10.1109/tvcg.2007.70594", "10.1111/cgf.12392", "10.14778/2831360.2831371", "10.1093/biomet/33.3.239", "10.1109/mcg.2019.2924636", "10.1109/tvcg.2017.2659744", "10.1109/pacificvis.2009.4906837", "10.1109/pacificvis.2017.8031599", "10.4103/1755-6783.179101", "10.1145/2362394.2362398", "10.1111/cgf.12925", "10.1109/icde.2018.00019", "10.1109/tvcg.2018.2865240", "10.1109/mcg.2015.99", "10.1109/vds48975.2019.8973383", "10.1038/nature16961", "10.1109/tciaig.2012.2186810", "10.1145/3035918.3035922", "10.1145/3197517.3201362", "10.1109/tvcg.2019.2934281", "10.1109/tvcg.2016.2598620", "10.1155/2019/8480905", "10.1109/iccchina.2013.6671183", "10.1109/tvcg.2018.2865145", "10.1145/3299869.3314037", "10.1017/s1351324907004664", "10.1109/tvcg.2019.2934785", "10.1177/1473871618806555", "10.1613/jair.2989", "10.1109/tvcg.2010.179", "10.1145/3303766"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030405", "title": "Insights From Experiments With Rigor in an EvoBio Design Study", "year": "2020", "conferenceName": "InfoVis", "authors": "Jennifer Rogers;Austin H. Patton;Luke Harmon;Alexander Lex;Miriah D. Meyer", "citationCount": "0", "affiliation": "Rogers, J (Corresponding Author), Univ Utah, Salt Lake City, UT 84112 USA. Rogers, Jen; Lex, Alexander; Meyer, Miriah, Univ Utah, Salt Lake City, UT 84112 USA. Patton, Austin H., Washington State Univ, Pullman, WA 99164 USA. Harmon, Luke, Univ Idaho, Moscow, ID 83843 USA.", "countries": "USA", "abstract": "Design study is an established approach of conducting problem-driven visualization research. The academic visualization community has produced a large body of work for reporting on design studies, informed by a handful of theoretical frameworks, and applied to a broad range of application areas. The result is an abundance of reported insights into visualization design, with an emphasis on novel visualization techniques and systems as the primary contribution of these studies. In recent work we proposed a new, interpretivist perspective on design study and six companion criteria for rigor that highlight the opportunities for researchers to contribute knowledge that extends beyond visualization idioms and software. In this work we conducted a year-long collaboration with evolutionary biologists to develop an interactive tool for visual exploration of multivariate datasets and phylogenetic trees. During this design study we experimented with methods to support three of the rigor criteria: ABUNDANT, REFLEXIVE, and TRANSPARENT. As a result we contribute two novel visualization techniques for the analysis of multivariate phylogenetic datasets, three methodological recommendations for conducting design studies drawn from reflections over our process of experimentation, and two writing devices for reporting interpretivist design study. We offer this work as an example for implementing the rigor criteria to produce a diverse range of knowledge contributions.", "keywords": "Methodologies,Application Motivated Visualization,Guidelines,Life Sciences Visualization,Health,Medicine,Biology,Bioinformatics,Genomics", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030405", "refList": ["10.1109/tvcg.2019.2934790", "10.1177/146879410200200205", "10.2312/eurovisshort", "10.1109/tvcg.2015.2467811", "10.1111/j.1467-6486.2009.00859.x", "10.1177/1473871613510429", "10.1109/tvcg.2018.2864836", "10.1109/tvcg.2018.2865076", "10.1109/tvcg.2013.231", "10.1002/cphy.c100079", "10.1109/tvcg.2018.2865149", "10.1080/1750984x.2017.1317357", "10.1007/978-3-7643-8472-2\\_6", "10.1111/cgf.13728", "10.2307/1511837", "10.1109/tvcg.2019.2934539", "10.3233/efi-2004-22201", "10.1080/17493460802276893", "10.1002/chp.1340180402", "10.1111/2041-210x.12034", "10.1111/j.2041-210x.2011.00169.x", "10.1109/tvcg.2015.2467452", "10.1002/chp", "10.1177/1077800410383121", "10.1002/cpbi.96", "10.1109/tvcg.2018.2864526", "10.1109/beliv.2018.8634026", "10.2307/1511637", "10.1109/tvcg.2014.2346431", "10.1111/cgf.12883", "10.1109/tvcg.2019.2934281", "10.1145/2993901.2993916", "10.2307/3178066", "10.1145/2993901.2993913", "10.1145/1182475.1182476", "10.1016/j.destud.2004.06.002", "10.1177/1609406918763214", "10.2312/eurovisshort.20151137", "10.1145/882262.882291", "10.1109/tvcg.2012.213", "10.1109/tvcg.2019.2898186", "10.1109/tvcg.2018.2811488", "10.1007/s11135-006-9044-4", "10.1109/tvcg.2009.111", "10.1111/2041-210x.12066", "10.1109/mcg.2018.2874523", "10.1177/1609406920909938"], "wos": 1, "children": [], "len": 1}], "len": 7}, {"doi": "10.1109/tvcg.2019.2934398", "title": "DataShot: Automatic Generation of Fact Sheets from Tabular Data", "year": "2019", "conferenceName": "InfoVis", "authors": "Yun Wang 0012;Zhida Sun;Haidong Zhang;Weiwei Cui;Ke Xu;Xiaojuan Ma;Dongmei Zhang", "citationCount": "3", "affiliation": "Wang, Y (Corresponding Author), Microsoft Res Asia, Beijing, Peoples R China. Wang, Yun; Sun, Zhida; Zhang, Haidong; Cui, Weiwei; Xu, Ke; Zhang, Dongmei, Microsoft Res Asia, Beijing, Peoples R China. Sun, Zhida; Xu, Ke; Ma, Xiaojuan, Hong Kong Univ Sci \\& Technol, Dept Comp Sci \\& Engn, Hong Kong, Peoples R China.", "countries": "China", "abstract": "Fact sheets with vivid graphical design and intriguing statistical insights are prevalent for presenting raw data. They help audiences understand data-related facts effectively and make a deep impression. However, designing a fact sheet requires both data and design expertise and is a laborious and time-consuming process. One needs to not only understand the data in depth but also produce intricate graphical representations. To assist in the design process, we present DataShot which, to the best of our knowledge, is the first automated system that creates fact sheets automatically from tabular data. First, we conduct a qualitative analysis of 245 infographic examples to explore general infographic design space at both the sheet and element levels. We identify common infographic structures, sheet layouts, fact types, and visualization styles during the study. Based on these findings, we propose a fact sheet generation pipeline, consisting of fact extraction, fact composition, and presentation synthesis, for the auto-generation workflow. To validate our system, we present use cases with three real-world datasets. We conduct an in-lab user study to understand the usage of our system. Our evaluation results show that DataShot can efficiently generate satisfactory fact sheets to support further customization and data presentation.", "keywords": "Fact sheet,infographic,visualization,and automated design", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934398", "refList": ["10.1109/tvcg.2016.2598647", "10.1109/tvcg.2018.2865158", "10.1111/cgf.13195", "10.1145/2851141.2851145", "10.1109/tvcg.2018.2829750", "10.1145/2556288.2557228", "10.1111/cgf.12392", "10.1145/3025171.3025227", "10.1109/vl.1996.545307", "10.1109/tvcg.2017.2744198", "10.14778/2733004.2733035", "10.1109/pacificvis.2017.8031599", "10.1109/pacificvis.2009.4906837", "10.1145/22949.22950", "10.1137/1.9781611972788.22", "10.1145/2702123.2702149", "10.1109/infvis.2005.1532136", "10.1109/mcg.2015.99", "10.1145/1183614.1183688", "10.1109/tvcg.2015.2467321", "10.1109/tvcg.2013.119", "10.1109/tvcg.2016.2598876", "10.1145/2470654.2481374", "10.1145/3025453.3025866", "10.1145/2901790.2901817", "10.1145/3035918.3035922", "10.1111/cgf.12391", "10.1145/3173574.3173612", "10.1109/tvcg.2016.2598620", "10.1109/tvcg.2014.2346291", "10.1145/3173574.3173909", "10.1109/mc.2013.36", "10.1109/tvcg.2015.2467191", "10.1109/tvcg.2013.234", "10.1177/1473871618806555", "10.1145/3173574.3173697", "10.1109/tvcg.2010.179", "10.1016/j.ijhcs.2018.01.004", "10.1109/tvcg.2016.2614803"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030403", "title": "Calliope: Automatic Visual Data Story Generation from a Spreadsheet", "year": "2020", "conferenceName": "InfoVis", "authors": "Danqing Shi;Xinyue Xu;Fuling Sun;Yang Shi 0007;Nan Cao", "citationCount": "0", "affiliation": "Cao, N (Corresponding Author), Tongji Univ, Intelligent Big Data Visualizat Lab, Shanghai, Peoples R China. Shi, Danqing; Xu, Xinyue; Sun, Fuling; Shi, Yang; Cao, Nan, Tongji Univ, Intelligent Big Data Visualizat Lab, Shanghai, Peoples R China.", "countries": "China", "abstract": "Visual data stories shown in the form of narrative visualizations such as a poster or a data video, are frequently used in data-oriented storytelling to facilitate the understanding and memorization of the story content. Although useful, technique barriers, such as data analysis, visualization, and scripting, make the generation of a visual data story difficult. Existing authoring tools rely on users' skills and experiences, which are usually inefficient and still difficult. In this paper, we introduce a novel visual data story generating system, Calliope, which creates visual data stories from an input spreadsheet through an automatic process and facilities the easy revision of the generated story based on an online story editor. Particularly, Calliope incorporates a new logic-oriented Monte Carlo tree search algorithm that explores the data space given by the input spreadsheet to progressively generate story pieces (i.e., data facts) and organize them in a logical order. The importance of data facts is measured based on information theory, and each data fact is visualized in a chart and captioned by an automatically generated description. We evaluate the proposed technique through three example stories, two controlled experiments, and a series of interviews with 10 domain experts. Our evaluation shows that Calliope is beneficial to efficient visual data story generation.", "keywords": "Information Visualization,Visual Storytelling,Data Story", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030403", "refList": ["10.1007/s11063-017-9759-3", "10.1109/tvcg.2016.2598647", "10.1162/0891201054223977", "10.1109/tvcg.2015.2467732", "10.3390/info9030065", "10.1109/tvcg.2019.2934398", "10.1016/j.visinf.2018.12.001", "10.1145/2002353.2002355", "10.1109/tvcg.2007.70594", "10.1111/cgf.12392", "10.14778/2831360.2831371", "10.1093/biomet/33.3.239", "10.1109/mcg.2019.2924636", "10.1109/tvcg.2017.2659744", "10.1109/pacificvis.2009.4906837", "10.1109/pacificvis.2017.8031599", "10.4103/1755-6783.179101", "10.1145/2362394.2362398", "10.1111/cgf.12925", "10.1109/icde.2018.00019", "10.1109/tvcg.2018.2865240", "10.1109/mcg.2015.99", "10.1109/vds48975.2019.8973383", "10.1038/nature16961", "10.1109/tciaig.2012.2186810", "10.1145/3035918.3035922", "10.1145/3197517.3201362", "10.1109/tvcg.2019.2934281", "10.1109/tvcg.2016.2598620", "10.1155/2019/8480905", "10.1109/iccchina.2013.6671183", "10.1109/tvcg.2018.2865145", "10.1145/3299869.3314037", "10.1017/s1351324907004664", "10.1109/tvcg.2019.2934785", "10.1177/1473871618806555", "10.1613/jair.2989", "10.1109/tvcg.2010.179", "10.1145/3303766"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.14004", "year": "2020", "title": "Infomages: Embedding Data into Thematic Images", "conferenceName": "EuroVis", "authors": "Darius Coelho;Klaus Mueller", "citationCount": "0", "affiliation": "Coelho, D (Corresponding Author), SUNY Stony Brook, Dept Comp Sci, Stony Brook, NY 11794 USA.\nCoelho, D.; Mueller, K., SUNY Stony Brook, Dept Comp Sci, Stony Brook, NY 11794 USA.", "countries": "USA", "abstract": "Recent studies have indicated that visually embellished charts such as infographics have the ability to engage viewers and positively affect memorability. Fueled by these findings, researchers have proposed a variety of infographic design tools. However, these tools do not cover the entire design space. In this work, we identify a subset of infographics that we call infomages. Infomages are casual visuals of data in which a data chart is embedded into a thematic image such that the content of the image reflects the subject and the designer's interpretation of the data. Creating an effective infomage, however, can require a fair amount of design expertise and is thus out of reach for most people. In order to also afford non-artists with the means to design convincing infomages, we first study the principled design of existing infomages and identify a set of key chart embedding techniques. Informed by these findings we build a design tool that links web-scale image search with a set of interactive image processing tools to empower novice users with the ability to design a wide variety of infomages. As the embedding process might introduce some amount of visual distortion of the data our tool also aids users to gauge the amount of this distortion, if any. We experimentally demonstrate the usability of our tool and conclude with a discussion of infomages and our design tool.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14004", "refList": ["10.1109/mcg.2018.2879066", "10.1109/tvcg.2015.2467732", "10.1002/acp.2350030302", "10.1145/361237.361242", "10.1109/tvcg.2019.2934398", "10.1145/2702123.2702275", "10.1109/tvcg.2019.2934810", "10.1111/cgf.12634", "10.1109/tvcg.2012.221", "10.1145/2702123.2702545", "10.1145/2501988.2502046", "10.1109/tvcg.2012.197", "10.1109/tvcg.2016.2598609", "10.1086/209244", "10.1145/1015706.1015720", "10.1109/tvcg.2011.175", "10.1111/cgf.12888", "10.1109/tvcg.2015.2467321", "10.2307/2288400", "10.1109/tvcg.2006.163", "10.1109/tvcg.2015.2440241", "10.1080/10447319509526110", "10.1109/tvcg.2016.2598620", "10.1109/tvcg.2013.234", "10.1109/tvcg.2019.2934785", "10.1126/science.220.4598.671", "10.1111/j.1469-8986.1993.tb03352.x", "10.1179/000870403235002042", "10.1145/2702123.2702608"], "wos": 1, "children": [], "len": 1}], "len": 5}, {"doi": "10.1109/tvcg.2019.2934785", "title": "Text-to-Viz: Automatic Generation of Infographics from Proportion-Related Natural Language Statements", "year": "2019", "conferenceName": "InfoVis", "authors": "Weiwei Cui;Xiaoyu Zhang;Yun Wang 0012;He Huang;Bei Chen;Lei Fang;Haidong Zhang;Jian-Guan Lou;Dongmei Zhang", "citationCount": "1", "affiliation": "Cui, WW (Corresponding Author), Microsoft Res Asia, Beijing, Peoples R China. Cui, Weiwei; Zhang, Xiaoyu; Wang, Yun; Huang, He; Chen, Bei; Fang, Lei; Zhang, Haidong; Lou, Jian-Guan; Zhang, Dongmei, Microsoft Res Asia, Beijing, Peoples R China. Zhang, Xiaoyu, Univ Calif Davis, ViDi Res Grp, Davis, CA 95616 USA.", "countries": "USA;China", "abstract": "Combining data content with visual embellishments, infographics can effectively deliver messages in an engaging and memorable manner. Various authoring tools have been proposed to facilitate the creation of infographics. However, creating a professional infographic with these authoring tools is still not an easy task, requiring much time and design expertise. Therefore, these tools are generally not attractive to casual users, who are either unwilling to take time to learn the tools or lacking in proper design expertise to create a professional infographic. In this paper, we explore an alternative approach: to automatically generate infographics from natural language statements. We first conducted a preliminary study to explore the design space of infographics. Based on the preliminary study, we built a proof-of-concept system that automatically converts statements about simple proportion-related statistics to a set of infographics with pre-designed styles. Finally, we demonstrated the usability and usefulness of the system through sample results, exhibits, and expert reviews.", "keywords": "Visualization for the masses,infographic,automatic visualization,presentation,and dissemination", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934785", "refList": ["10.1145/504704.504705", "10.1109/tvcg.2016.2598647", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2015.2467732", "10.1016/0010-0285(72)90002-3", "10.1145/2702123.2702275", "10.1109/tvcg.2015.2467471", "10.1145/2858036.2858435", "10.1109/tvcg.2012.221", "10.1109/tvcg.2007.70594", "10.1145/2702123.2702545", "10.1109/tvcg.2012.197", "10.1109/mcg.2016.2", "10.1109/pacificvis.2017.8031599", "10.1109/caia.1991.120841", "10.1002/spe.4380111102", "10.1109/icde.2018.00019", "10.1109/tvcg.2018.2865240", "10.1007/978-3-319-91376-6\\_21", "10.1109/tvcg.2015.2467321", "10.1145/2984511.2984588", "10.1111/cgf.12127", "10.1109/tvcg.2016.2598876", "10.1145/2470654.2481374", "10.1016/j.ergon.2008.02.020", "10.1111/cgf.12391", "10.1109/tvcg.2007.70577", "10.3115/1119176.1119206", "10.1109/tvcg.2016.2598620", "10.1109/tvcg.2014.2346291", "10.1177/1473871611415996", "10.1145/2807442.2807478", "10.3115/974557.974586", "10.1109/tvcg.2015.2467191", "10.1109/tvcg.2013.234", "10.1177/1473871618806555", "10.1145/3173574.3173697", "10.1109/tvcg.2010.179", "10.1109/tnn.2003.820440", "10.1111/cgf.13207"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030403", "title": "Calliope: Automatic Visual Data Story Generation from a Spreadsheet", "year": "2020", "conferenceName": "InfoVis", "authors": "Danqing Shi;Xinyue Xu;Fuling Sun;Yang Shi 0007;Nan Cao", "citationCount": "0", "affiliation": "Cao, N (Corresponding Author), Tongji Univ, Intelligent Big Data Visualizat Lab, Shanghai, Peoples R China. Shi, Danqing; Xu, Xinyue; Sun, Fuling; Shi, Yang; Cao, Nan, Tongji Univ, Intelligent Big Data Visualizat Lab, Shanghai, Peoples R China.", "countries": "China", "abstract": "Visual data stories shown in the form of narrative visualizations such as a poster or a data video, are frequently used in data-oriented storytelling to facilitate the understanding and memorization of the story content. Although useful, technique barriers, such as data analysis, visualization, and scripting, make the generation of a visual data story difficult. Existing authoring tools rely on users' skills and experiences, which are usually inefficient and still difficult. In this paper, we introduce a novel visual data story generating system, Calliope, which creates visual data stories from an input spreadsheet through an automatic process and facilities the easy revision of the generated story based on an online story editor. Particularly, Calliope incorporates a new logic-oriented Monte Carlo tree search algorithm that explores the data space given by the input spreadsheet to progressively generate story pieces (i.e., data facts) and organize them in a logical order. The importance of data facts is measured based on information theory, and each data fact is visualized in a chart and captioned by an automatically generated description. We evaluate the proposed technique through three example stories, two controlled experiments, and a series of interviews with 10 domain experts. Our evaluation shows that Calliope is beneficial to efficient visual data story generation.", "keywords": "Information Visualization,Visual Storytelling,Data Story", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030403", "refList": ["10.1007/s11063-017-9759-3", "10.1109/tvcg.2016.2598647", "10.1162/0891201054223977", "10.1109/tvcg.2015.2467732", "10.3390/info9030065", "10.1109/tvcg.2019.2934398", "10.1016/j.visinf.2018.12.001", "10.1145/2002353.2002355", "10.1109/tvcg.2007.70594", "10.1111/cgf.12392", "10.14778/2831360.2831371", "10.1093/biomet/33.3.239", "10.1109/mcg.2019.2924636", "10.1109/tvcg.2017.2659744", "10.1109/pacificvis.2009.4906837", "10.1109/pacificvis.2017.8031599", "10.4103/1755-6783.179101", "10.1145/2362394.2362398", "10.1111/cgf.12925", "10.1109/icde.2018.00019", "10.1109/tvcg.2018.2865240", "10.1109/mcg.2015.99", "10.1109/vds48975.2019.8973383", "10.1038/nature16961", "10.1109/tciaig.2012.2186810", "10.1145/3035918.3035922", "10.1145/3197517.3201362", "10.1109/tvcg.2019.2934281", "10.1109/tvcg.2016.2598620", "10.1155/2019/8480905", "10.1109/iccchina.2013.6671183", "10.1109/tvcg.2018.2865145", "10.1145/3299869.3314037", "10.1017/s1351324907004664", "10.1109/tvcg.2019.2934785", "10.1177/1473871618806555", "10.1613/jair.2989", "10.1109/tvcg.2010.179", "10.1145/3303766"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.14004", "year": "2020", "title": "Infomages: Embedding Data into Thematic Images", "conferenceName": "EuroVis", "authors": "Darius Coelho;Klaus Mueller", "citationCount": "0", "affiliation": "Coelho, D (Corresponding Author), SUNY Stony Brook, Dept Comp Sci, Stony Brook, NY 11794 USA.\nCoelho, D.; Mueller, K., SUNY Stony Brook, Dept Comp Sci, Stony Brook, NY 11794 USA.", "countries": "USA", "abstract": "Recent studies have indicated that visually embellished charts such as infographics have the ability to engage viewers and positively affect memorability. Fueled by these findings, researchers have proposed a variety of infographic design tools. However, these tools do not cover the entire design space. In this work, we identify a subset of infographics that we call infomages. Infomages are casual visuals of data in which a data chart is embedded into a thematic image such that the content of the image reflects the subject and the designer's interpretation of the data. Creating an effective infomage, however, can require a fair amount of design expertise and is thus out of reach for most people. In order to also afford non-artists with the means to design convincing infomages, we first study the principled design of existing infomages and identify a set of key chart embedding techniques. Informed by these findings we build a design tool that links web-scale image search with a set of interactive image processing tools to empower novice users with the ability to design a wide variety of infomages. As the embedding process might introduce some amount of visual distortion of the data our tool also aids users to gauge the amount of this distortion, if any. We experimentally demonstrate the usability of our tool and conclude with a discussion of infomages and our design tool.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14004", "refList": ["10.1109/mcg.2018.2879066", "10.1109/tvcg.2015.2467732", "10.1002/acp.2350030302", "10.1145/361237.361242", "10.1109/tvcg.2019.2934398", "10.1145/2702123.2702275", "10.1109/tvcg.2019.2934810", "10.1111/cgf.12634", "10.1109/tvcg.2012.221", "10.1145/2702123.2702545", "10.1145/2501988.2502046", "10.1109/tvcg.2012.197", "10.1109/tvcg.2016.2598609", "10.1086/209244", "10.1145/1015706.1015720", "10.1109/tvcg.2011.175", "10.1111/cgf.12888", "10.1109/tvcg.2015.2467321", "10.2307/2288400", "10.1109/tvcg.2006.163", "10.1109/tvcg.2015.2440241", "10.1080/10447319509526110", "10.1109/tvcg.2016.2598620", "10.1109/tvcg.2013.234", "10.1109/tvcg.2019.2934785", "10.1126/science.220.4598.671", "10.1111/j.1469-8986.1993.tb03352.x", "10.1179/000870403235002042", "10.1145/2702123.2702608"], "wos": 1, "children": [], "len": 1}], "len": 5}, {"doi": "10.1109/tvcg.2020.3030423", "title": "MobileVisFixer: Tailoring Web Visualizations for Mobile Phones Leveraging an Explainable Reinforcement Learning Framework", "year": "2020", "conferenceName": "InfoVis", "authors": "Aoyu Wu;Wai Tong;Tim Dwyer;Bongshin Lee;Petra Isenberg;Huamin Qu", "citationCount": "0", "affiliation": "Wu, AY (Corresponding Author), Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Wu, Aoyu; Tong, Wai; Qu, Huamin, Hong Kong Univ Sci \\& Technol, Hong Kong, Peoples R China. Dwyer, Tim, Monash Univ, Clayton, Vic, Australia. Lee, Bongshin, Microsoft Res, Redmond, WA USA. Isenberg, Petra, INRIA, Le Chesnay Rocquencourt, France.", "countries": "USA;China;France;Australia", "abstract": "We contribute MobileVisFixer, a new method to make visualizations more mobile-friendly. Although mobile devices have become the primary means of accessing information on the web, many existing visualizations are not optimized for small screens and can lead to a frustrating user experience. Currently, practitioners and researchers have to engage in a tedious and time-consuming process to ensure that their designs scale to screens of different sizes, and existing toolkits and libraries provide little support in diagnosing and repairing issues. To address this challenge, MobileVisFixer automates a mobile-friendly visualization re-design process with a novel reinforcement learning framework. To inform the design of MobileVisFixer, we first collected and analyzed SVG-based visualizations on the web, and identified five common mobile-friendly issues. MobileVisFixer addresses four of these issues on single-view Cartesian visualizations with linear or discrete scales by a Markov Decision Process model that is both generalizable across various visualizations and fully explainable. MobileVisFixer deconstructs charts into declarative formats, and uses a greedy heuristic based on Policy Gradient methods to find solutions to this difficult, multi-criteria optimization problem in reasonable time. In addition, MobileVisFixer can be easily extended with the incorporation of optimization algorithms for data visualizations. Quantitative evaluation on two real-world datasets demonstrates the effectiveness and generalizability of our method.", "keywords": "Mobile visualization,Responsive visualization,Machine learning for visualizations,Reinforcement learning", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030423", "refList": ["10.1109/mcg.2014.82", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2012.196", "10.1145/3092703.3092726", "10.1109/pimrc.2015.7343276", "10.1109/tvcg.2014.48", "10.1145/3025453.3025957", "10.1145/2047196.2047247", "10.1145/3173574.3174168", "10.1109/icst.2019.00027", "10.1109/tvcg.2007.70594", "10.1145/3197517.3201311", "10.1145/3126594.3126653", "10.1109/mcg.2019.2924636", "10.1145/3180155.3180262", "10.1109/tvcg.2017.2659744", "10.1145/3123266.3123274", "10.1109/tvcg.2019.2934538", "10.1109/cvpr.2018.00592", "10.1109/tvcg.2018.2865138", "10.1109/tsmcc.2012.2218595", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13193", "10.1145/2775441.2775478", "10.1145/3313831.3376777", "10.1109/mc.2006.109", "10.1111/cgf.13686", "10.1109/tvcg.2015.2467091", "10.4230/dagrep.9.7.78", "10.1007/978-3-319-71249-9\\_9", "10.1007/s00778-019-00588-3", "10.1109/ase.2015.31", "10.1007/bf02124742", "10.1109/tvcg.2019.2934397", "10.1109/adprl.2007.368196", "10.1109/mcg.2020.2968244", "10.1145/3092703.3092712", "10.1109/tvcg.2017.2744320", "10.1023/a:1017992615625", "10.1145/2642918", "10.1145/2858036.2858558", "10.1145/3290605.3300358", "10.1109/tvcg.2019.2934431", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030406", "title": "Palettailor: Discriminable Colorization for Categorical Data", "year": "2020", "conferenceName": "InfoVis", "authors": "Kecheng Lu;Mi Feng;Xin Chen;Michael Sedlmair;Oliver Deussen;Dani Lischinski;Zhanglin Cheng;Yunhai Wang", "citationCount": "0", "affiliation": "Wang, YH (Corresponding Author), Shandong Univ, Jinan, Peoples R China. Cheng, ZL (Corresponding Author), SIAT, Shenzhen VesuCA Key Lab, Shenzhen, Peoples R China. Lu, Kecheng; Chen, Xin; Wang, Yunhai, Shandong Univ, Jinan, Peoples R China. Feng, Mi, Twitter Inc, San Francisco, CA USA. Lu, Kecheng; Deussen, Oliver; Cheng, Zhanglin, SIAT, Shenzhen VesuCA Key Lab, Shenzhen, Peoples R China. Sedlmair, Michael, Univ Stuttgart, VISUS, Stuttgart, Germany. Deussen, Oliver, Konstanz Univ, Constance, Germany. Lischinski, Dani, Hebrew Univ Jerusalem, Jerusalem, Israel.", "countries": "USA;Israel;Germany;China", "abstract": "We present an integrated approach for creating and assigning color palettes to different visualizations such as multi-class scatterplots, line, and bar charts. While other methods separate the creation of colors from their assignment, our approach takes data characteristics into account to produce color palettes, which are then assigned in a way that fosters better visual discrimination of classes. To do so, we use a customized optimization based on simulated annealing to maximize the combination of three carefully designed color scoring functions: point distinctness, name difference, and color discrimination. We compare our approach to state-of-the-art palettes with a controlled user study for scatterplots and line charts, furthermore we performed a case study. Our results show that Palettailor, as a fully-automated approach, generates color palettes with a higher discrimination quality than existing approaches. The efficiency of our optimization allows us also to incorporate user modifications into the color selection process.", "keywords": "Color Palette,Discriminability,Multi-Class Scatterplot,Line Chart,Bar Chart", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030406", "refList": ["10.1109/mcg.2014.82", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2012.196", "10.1145/3092703.3092726", "10.1109/tvcg.2014.48", "10.1145/3025453.3025957", "10.1145/2047196.2047247", "10.1145/3173574.3174168", "10.1109/icst.2019.00027", "10.1109/tvcg.2007.70594", "10.1145/3197517.3201311", "10.1145/3126594.3126653", "10.1109/mcg.2019.2924636", "10.1145/3180155.3180262", "10.1109/tvcg.2017.2659744", "10.1145/3123266.3123274", "10.1109/tvcg.2018.2865234", "10.1109/tvcg.2019.2934538", "10.1109/cvpr.2018.00592", "10.1145/2815833.2816956", "10.1109/tvcg.2018.2865138", "10.1109/tsmcc.2012.2218595", "10.1109/tvcg.2018.2865240", "10.1111/cgf.13193", "10.1145/2775441.2775478", "10.1145/3313831.3376777", "10.1109/mc.2006.109", "10.1111/cgf.13686", "10.1109/tvcg.2015.2467091", "10.4230/dagrep.9.7.78", "10.1007/978-3-319-71249-9\\_9", "10.1007/s00778-019-00588-3", "10.1109/ase.2015.31", "10.1007/bf02124742", "10.1145/3025453.3025768", "10.1109/tvcg.2019.2934397", "10.1109/adprl.2007.368196", "10.1109/mcg.2020.2968244", "10.1145/3092703.3092712", "10.1109/tvcg.2017.2744320", "10.1023/a:1017992615625", "10.1145/2642918", "10.1145/2858036.2858558", "10.1145/3290605.3300358", "10.1109/tvcg.2019.2934431", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030476", "title": "StructGraphics: Flexible Visualization Design through Data-Agnostic and Reusable Graphical Structures", "year": "2020", "conferenceName": "InfoVis", "authors": "Theophanis Tsandilas", "citationCount": "0", "affiliation": "Tsandilas, T (Corresponding Author), Univ Paris Saclay, INRIA, Gif Sur Yvette, France. Tsandilas, T (Corresponding Author), CNRS, F-75700 Paris, France. Tsandilas, Theophanis, Univ Paris Saclay, INRIA, Gif Sur Yvette, France. Tsandilas, Theophanis, CNRS, F-75700 Paris, France.", "countries": "France", "abstract": "Information visualization research has developed powerful systems that enable users to author custom data visualizations without textual programming. These systems can support graphics-driven practices by bridging lazy data-binding mechanisms with vector-graphics editing tools. Yet, despite their expressive power, visualization authoring systems often assume that users want to generate visual representations that they already have in mind rather than explore designs. They also impose a data-to-graphics workflow, where binding data dimensions to graphical properties is a necessary step for generating visualization layouts. In this paper, we introduce StructGraphics, an approach for creating data-agnostic and fully reusable visualization designs. StructGraphics enables designers to construct visualization designs by drawing graphics on a canvas and then structuring their visual properties without relying on a concrete dataset or data schema. In StructGraphics, tabular data structures are derived directly from the structure of the graphics. Later, designers can link these structures with real datasets through a spreadsheet user interface. StructGraphics supports the design and reuse of complex data visualizations by combining graphical property sharing, by-example design specification, and persistent layout constraints. We demonstrate the power of the approach through a gallery of visualization examples and reflect on its strengths and limitations in interaction with graphic designers and data visualization experts.", "keywords": "Visualization design,graphical structures,visualization grammars,layout constraints,infographics,flexible data binding", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030476", "refList": ["10.1145/344949.344959", "10.1057/ivs.2009.22", "10.1109/mcg.1987.277079", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2016.2598839", "10.1145/2858036.2858435", "10.1145/3173574.3173610", "10.1145/3173574.3174106", "10.1109/tvcg.2011.185", "10.1109/tvcg.2007.70515", "10.1109/iv.2008.66", "10.1111/cgf.13718", "10.1109/tvcg.2014.2346250", "10.1109/tvcg.2017.2744198", "10.1145/22949.22950", "10.1145/1925844.1926423", "10.1109/mcg.2019.2903711", "10.1006/cogp.1994.1010", "10.1109/tvcg.2018.2865240", "10.1145/3125571.3125585", "10.1145/3022671.2984020", "10.1111/cgf.12391", "10.1109/tvcg.2015.2467091", "10.1109/infvis.2004.12", "10.1109/tvcg.2016.2598620", "10.1016/j.jvlc.2017.10.001", "10.1109/tvcg.2014.2346291", "10.1109/2945.981851", "10.1073/pnas.1807184115", "10.1109/tvcg.2010.177", "10.1145/3173574.3173697", "10.1080/1369118x.2016.1153126", "10.1109/tvcg.2015.2414454", "10.1145/2740908.2742849", "10.1023/a:1025671410623", "10.1111/cgf.12903", "10.1207/s15327051hci0104\\_2", "10.1145/3290605.3300358", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1111/cgf.13718", "year": "2019", "title": "Investigating the Manual View Specification and Visualization by Demonstration Paradigms for Visualization Construction", "conferenceName": "EuroVis", "authors": "Bahador Saket;Alex Endert", "citationCount": "1", "affiliation": "Saket, B (Corresponding Author), Georgia Inst Technol, Sch Interact Comp, Atlanta, GA 30332 USA.\nSaket, Bahador; Endert, Alex, Georgia Inst Technol, Sch Interact Comp, Atlanta, GA 30332 USA.", "countries": "USA", "abstract": "Interactivity plays an important role in data visualization. Therefore, understanding how people create visualizations given different interaction paradigms provides empirical evidence to inform interaction design. We present a two-phase study comparing people's visualization construction processes using two visualization tools: one implementing the manual view specification paradigm (Polestar) and another implementing visualization by demonstration (VisExemplar). Findings of our study indicate that the choice of interaction paradigm influences the visualization construction in terms of: 1) the overall effectiveness, 2) how participants phrase their goals, and 3) their perceived control and engagement. Based on our findings, we discuss trade-offs and open challenges with these interaction paradigms.", "keywords": "", "link": "https://doi.org/10.1111/cgf.13718", "refList": ["10.1111/cgf.12887", "10.1023/a:1008716330212", "10.1145/2470654.2466255", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2012.275", "10.1145/2493102.2493104", "10.1109/tvcg.2016.2598839", "10.1145/948496.948514", "10.1109/tvcg.2015.2467201", "10.2312/pe.eurovisshort.eurovisshort2013.019-023", "10.1109/tvcg.2007.70541", "10.1109/tvcg.2016.2598446", "10.1109/vl.1996.545307", "10.1109/tvcg.2014.2346250", "10.1145/3025453.3025942", "10.1145/2207676.2207741", "10.1145/3173574.3174212", "10.1109/tvcg.2015.2467615", "10.1145/2598784.2598806", "10.1109/tvcg.2017.2680452", "10.1145/2598510.2598566", "10.1109/tvcg.2007.70577", "10.1109/tvcg.2016.2598620", "10.2307/2530428", "10.1109/infvis.1998.729560", "10.1109/tvcg.2014.2346291", "10.1109/tvcg.2010.164", "10.1109/tvcg.2017.2743859", "10.1109/tvcg.2013.191", "10.1109/2.153286", "10.1109/tvcg.2015.2467191", "10.1145/3173574.3173697", "10.1145/1502650.1502667", "10.1109/tvcg.2007.70515"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2019.2934534", "title": "Investigating Direct Manipulation of Graphical Encodings as a Method for User Interaction", "year": "2019", "conferenceName": "InfoVis", "authors": "Bahador Saket;Samuel Huron;Charles Perin;Alex Endert", "citationCount": "0", "affiliation": "Saket, B (Corresponding Author), Georgia Tech, Atlanta, GA 30332 USA. Saket, Bahador; Endert, Alex, Georgia Tech, Atlanta, GA 30332 USA. Huron, Samuel, Univ Paris Saclay, Paris, France. Perin, Charles, Univ Victoria, Victoria, BC, Canada.", "countries": "Canada;USA;France", "abstract": "We investigate direct manipulation of graphical encodings as a method for interacting with visualizations. There is an increasing interest in developing visualization tools that enable users to perform operations by directly manipulating graphical encodings rather than external widgets such as checkboxes and sliders. Designers of such tools must decide which direct manipulation operations should be supported, and identify how each operation can be invoked. However, we lack empirical guidelines for how people convey their intended operations using direct manipulation of graphical encodings. We address this issue by conducting a qualitative study that examines how participants perform 15 operations using direct manipulation of standard graphical encodings. From this study, we 1) identify a list of strategies people employ to perform each operation, 2) observe commonalities in strategies across operations, and 3) derive implications to help designers leverage direct manipulation of graphical encoding as a method for user interaction.", "keywords": "Direct Manipulation,Data Visualization", "link": "http://dx.doi.org/10.1109/TVCG.2019.2934534", "refList": ["10.1145/2556288.2557379", "10.1109/tvcg.2016.2598839", "10.1145/2858036.2858435", "10.1145/2702123.2702237", "10.1111/j.1467-8659.2009.01678.x", "10.1109/tvcg.2011.185", "10.1109/mcg.2016.90", "10.1177/1473871611413180", "10.1111/cgf.13718", "10.1109/tvcg.2014.2346250", "10.1109/tvcg.2014.2346984", "10.1145/2207676.2207741", "10.1109/mcg.2019.2903711", "10.1109/tvcg.2018.2865075", "10.1109/tvcg.2014.2346279", "10.1109/iv.1999.781570", "10.1109/tvcg.2015.2467615", "10.1109/tvcg.2014.2346292", "10.1145/2984511.2984588", "10.1109/tvcg.2017.2680452", "10.1145/1166253.1166265", "10.1109/tvcg.2017.2745258", "10.1109/tvcg.2016.2598620", "10.1109/tvcg.2014.2346291", "10.2307/2530428", "10.1109/tvcg.2012.204", "10.1145/3173574.3173697", "10.1207/s15327051hci0104\\_2", "10.1109/vast.2012.6400486", "10.1109/tvcg.2017.2745078"], "wos": 1, "children": [], "len": 1}, {"doi": "10.1109/tvcg.2020.3030476", "title": "StructGraphics: Flexible Visualization Design through Data-Agnostic and Reusable Graphical Structures", "year": "2020", "conferenceName": "InfoVis", "authors": "Theophanis Tsandilas", "citationCount": "0", "affiliation": "Tsandilas, T (Corresponding Author), Univ Paris Saclay, INRIA, Gif Sur Yvette, France. Tsandilas, T (Corresponding Author), CNRS, F-75700 Paris, France. Tsandilas, Theophanis, Univ Paris Saclay, INRIA, Gif Sur Yvette, France. Tsandilas, Theophanis, CNRS, F-75700 Paris, France.", "countries": "France", "abstract": "Information visualization research has developed powerful systems that enable users to author custom data visualizations without textual programming. These systems can support graphics-driven practices by bridging lazy data-binding mechanisms with vector-graphics editing tools. Yet, despite their expressive power, visualization authoring systems often assume that users want to generate visual representations that they already have in mind rather than explore designs. They also impose a data-to-graphics workflow, where binding data dimensions to graphical properties is a necessary step for generating visualization layouts. In this paper, we introduce StructGraphics, an approach for creating data-agnostic and fully reusable visualization designs. StructGraphics enables designers to construct visualization designs by drawing graphics on a canvas and then structuring their visual properties without relying on a concrete dataset or data schema. In StructGraphics, tabular data structures are derived directly from the structure of the graphics. Later, designers can link these structures with real datasets through a spreadsheet user interface. StructGraphics supports the design and reuse of complex data visualizations by combining graphical property sharing, by-example design specification, and persistent layout constraints. We demonstrate the power of the approach through a gallery of visualization examples and reflect on its strengths and limitations in interaction with graphic designers and data visualization experts.", "keywords": "Visualization design,graphical structures,visualization grammars,layout constraints,infographics,flexible data binding", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030476", "refList": ["10.1145/344949.344959", "10.1057/ivs.2009.22", "10.1109/mcg.1987.277079", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2016.2598839", "10.1145/2858036.2858435", "10.1145/3173574.3173610", "10.1145/3173574.3174106", "10.1109/tvcg.2011.185", "10.1109/tvcg.2007.70515", "10.1109/iv.2008.66", "10.1111/cgf.13718", "10.1109/tvcg.2014.2346250", "10.1109/tvcg.2017.2744198", "10.1145/22949.22950", "10.1145/1925844.1926423", "10.1109/mcg.2019.2903711", "10.1006/cogp.1994.1010", "10.1109/tvcg.2018.2865240", "10.1145/3125571.3125585", "10.1145/3022671.2984020", "10.1111/cgf.12391", "10.1109/tvcg.2015.2467091", "10.1109/infvis.2004.12", "10.1109/tvcg.2016.2598620", "10.1016/j.jvlc.2017.10.001", "10.1109/tvcg.2014.2346291", "10.1109/2945.981851", "10.1073/pnas.1807184115", "10.1109/tvcg.2010.177", "10.1145/3173574.3173697", "10.1080/1369118x.2016.1153126", "10.1109/tvcg.2015.2414454", "10.1145/2740908.2742849", "10.1023/a:1025671410623", "10.1111/cgf.12903", "10.1207/s15327051hci0104\\_2", "10.1145/3290605.3300358", "10.1109/tvcg.2016.2599030"], "wos": 1, "children": [], "len": 1}], "len": 5}, {"doi": "10.1111/cgf.14002", "year": "2020", "title": "v-plots: Designing Hybrid Charts for the Comparative Analysis of Data Distributions", "conferenceName": "EuroVis", "authors": "Michael Blumenschein;Luka J. Debbeler;Nadine C. Lages;Britta Renner;Daniel A. Keim;Mennatallah El{-}Assady", "citationCount": "0", "affiliation": "Blumenschein, M (Corresponding Author), Univ Konstanz, Constance, Germany.\nBlumenschein, Michael; Debbeler, Luka J.; Lages, Nadine C.; Renner, Britta; Keim, Daniel A.; El-Assady, Mennatallah, Univ Konstanz, Constance, Germany.", "countries": "Germany", "abstract": "Comparing data distributions is a core focus in descriptive statistics, and part of most data analysis processes across disciplines. In particular, comparing distributions entails numerous tasks, ranging from identifying global distribution properties, comparing aggregated statistics (e.g., mean values), to the local inspection of single cases. While various specialized visualizations have been proposed (e.g., box plots, histograms, or violin plots), they are not usually designed to support more than a few tasks, unless they are combined. In this paper, we present the v-plot designer; a technique for authoring custom hybrid charts, combining mirrored bar charts, difference encodings, and violin-style plots. v-plots are customizable and enable the simultaneous comparison of data distributions on global, local, and aggregation levels. Our system design is grounded in an expert survey that compares and evaluates 20 common visualization techniques to derive guidelines for the task-driven selection of appropriate visualizations. This knowledge externalization step allowed us to develop a guiding wizard that can tailor v-plots to individual tasks and particular distribution properties. Finally, we confirm the usefulness of our system design and the userguiding process by measuring the fitness for purpose and applicability in a second study with four domain and statistic experts.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14002", "refList": ["10.2307/2683468", "10.1186/1475-2891-12-1", "10.18637/jss.v028.c01", "10.1109/tvcg.2018.2865158", "10.1007/s00267-011-9692-6", "10.1177/1473871611416549", "10.1016/s0043-1354(98)00138-9", "10.1186/1471-2458-12-556", "10.1201/9781351072304", "10.1002/2014wr016367", "10.1201/9781315140919.2", "10.1111/cgf.12634", "10.1109/tvcg.2017.2744018", "10.1111/j.1467-8659.2009.01677.x", "10.1029/2007gl031764", "10.1145/3025453.3025912", "10.1109/tvcg.2018.2859973", "10.1016/j.scitotenv.2018.06.190", "10.1111/j.1752-1688.2011.00540.x", "10.1201/9781351072304.5", "10.1002/9781118575574", "10.2312/conf/eg2013/stars/039-063", "10.2307/2685478", "10.1109/tvcg.2018.2865240", "10.1177/0013916513515239", "10.1145/3125571.3125585", "10.1109/tvcg.2018.2864907", "10.1201/9781315140919", "10.1109/tvcg.2015.2467752", "10.1111/cgf.12391", "10.1109/tvcg.2015.2467091", "10.1109/tvcg.2018.2864884", "10.1016/j.jhydrol.2005.06.008", "10.2307/2682899", "10.2307/2685133", "10.1001/archpediatrics.2011.83", "10.1109/tvcg.2014.2346298", "10.1016/j.scitotenv.2009.06.031", "10.1109/tvcg.2015.2467191", "10.1016/b978-0-12-079050-0.50020-5", "10.1016/j.csda.2007.11.008", "10.1017/s1368980015003559", "10.1145/2669557.2669572", "10.1016/j.appet.2017.03.039"], "wos": 1, "children": [{"doi": "10.1109/tvcg.2020.3030336", "title": "Visual cohort comparison for spatial single-cell omics-data", "year": "2020", "conferenceName": "VAST", "authors": "Antonios Somarakis;Marieke E. Ijsselsteijn;Sietse J. Luk;Boyd Kenkhuis;Noel F. C. C. de Miranda;Boudewijn P. F. Lelieveldt;Thomas Höllt", "citationCount": "0", "affiliation": "Hollt, T (Corresponding Author), Delft Univ Technol, Comp Graph \\& Visualizat Grp, Delft, Netherlands. Hollt, T (Corresponding Author), Leiden Univ, Med Ctr, Leiden Computat Biol Ctr, Leiden, Netherlands. Somarakis, Antonios; Lelieveldt, Boudewijn P. F., Leiden Univ, Med Ctr, Dept Radiol, Div Image Proc, Leiden, Netherlands. Ijsselsteijn, Marieke E.; de Miranda, Noel F. C. C., Leiden Univ, Med Ctr, Dept Pathol, Immunogen Grp, Leiden, Netherlands. Luk, Sietse J., Leiden Univ, Med Ctr, Hematol Dept, Leiden, Netherlands. Kenkhuis, Boyd, Leiden Univ, Med Ctr, Human Genet Dept, Leiden, Netherlands. Hollt, Thomas, Delft Univ Technol, Comp Graph \\& Visualizat Grp, Delft, Netherlands. Hollt, Thomas, Leiden Univ, Med Ctr, Leiden Computat Biol Ctr, Leiden, Netherlands.", "countries": "Netherlands", "abstract": "Spatially-resolved omics-data enable researchers to precisely distinguish cell types in tissue and explore their spatial interactions, enabling deep understanding of tissue functionality. To understand what causes or deteriorates a disease and identify related biomarkers, clinical researchers regularly perform large-scale cohort studies, requiring the comparison of such data at cellular level. In such studies, with little a-priori knowledge of what to expect in the data, explorative data analysis is a necessity. Here, we present an interactive visual analysis workflow for the comparison of cohorts of spatially-resolved omics-data. Our workflow allows the comparative analysis of two cohorts based on multiple levels-of-detail, from simple abundance of contained cell types over complex co-localization patterns to individual comparison of complete tissue images. As a result, the workflow enables the identification of cohort-differentiating features, as well as outlier samples at any stage of the workflow. During the development of the workflow, we continuously consulted with domain experts. To show the effectiveness of the workflow, we conducted multiple case studies with domain experts from different application areas and with different data modalities.", "keywords": "Visual analytics,Imaging Mass Cytometry,Vectra,spatially-resolved data,single-cell omics-data,Visual comparison", "link": "http://dx.doi.org/10.1109/TVCG.2020.3030336", "refList": ["10.1038/nmeth.2869", "10.18637/jss.v028.c01", "10.1177/1473871611416549", "10.1016/j.celrep.2020.107523", "10.1602/neurorx.1.2.182", "10.1038/nprot.2014.191", "10.1136/jnnp-2011-300403", "10.1126/sciadv.aax5851", "10.2312/pe.vmv.vmv13.105-112", "10.1038/s43018-020-0031-9", "10.1109/tvcg.2013.213", "10.1093/jnci/92.8.613", "10.1109/52.329404", "10.1109/tvcg.2017.2785271", "10.1007/s11548-013-0820-z", "10.1109/tvcg.2019.2934547", "10.1002/cjp2.113", "10.1080/2162402x.2018.1507600", "10.1109/tvcg.2013.124", "10.1016/s0140-6736(14)60958-2", "10.1038/s41467-017-01689-9", "10.1016/j.cell.2018.07.010", "10.1007/978-3-319-24523-2", "10.1038/nrg3832", "10.2352/j.imagingsci.technol.2017.61.6.060404", "10.1109/tvcg.2018.2864907", "10.1111/cgf.13413", "10.1007/978-3-319-67979-2\\_4", "10.1145/2836034.2836040", "10.1038/nmeth.2563", "10.1101/2020.03.27.001834", "10.1016/0377-0427(87)90125-7", "10.1016/j.immuni.2016.04.014", "10.1002/cyto.a.22702", "10.12688/wellcomeopenres.15191.1", "10.1109/2945.981851", "10.1038/s43018-020-0026-6", "10.1038/s41586-019-1876-x", "10.1109/tvcg.2019.2931299", "10.1109/annes.1995.499469", "10.1145/2133806.2133821", "10.1109/tvcg.2013.161", "10.1007/978-3-319-24523-210", "10.1126/scitranslmed.3004330", "10.1038/nmeth.4391", "10.1111/cgf.14002", "10.1559/152304003100010929", "10.1126/science.280.5363.585", "10.1007/978-3-319-24523-2\\_10", "10.1109/tvcg.2016.2598587", "10.1038/s41597-019-0258-4"], "wos": 1, "children": [], "len": 1}], "len": 3}, {"doi": "10.1111/cgf.14035", "year": "2020", "title": "Survey on the Analysis of User Interactions and Visualization Provenance", "conferenceName": "EuroVis", "authors": "Kai Xu;Alvitta Ottley;Conny Walchshofer;Marc Streit;Remco Chang;John E. Wenskovitch", "citationCount": "0", "affiliation": "Xu, K (Corresponding Author), Middlesex Univ, London, England.\nXu, Kai, Middlesex Univ, London, England.\nOttley, Alvitta, Washington Univ, St Louis, MO 63110 USA.\nWalchshofer, Conny; Streit, Marc, Johannes Kepler Univ Linz, Linz, Austria.\nChang, Remco, Tufts Univ, Medford, MA 02155 USA.\nWenskovitch, John, Virginia Tech, Blacksburg, VA USA.", "countries": "USA;England;Austria", "abstract": "There is fast-growing literature on provenance-related research, covering aspects such as its theoretical framework, use cases, and techniques for capturing, visualizing, and analyzing provenance data. As a result, there is an increasing need to identify and taxonomize the existing scholarship. Such an organization of the research landscape will provide a complete picture of the current state of inquiry and identify knowledge gaps or possible avenues for further investigation. In this STAR, we aim to produce a comprehensive survey of work in the data visualization and visual analytics field that focus on the analysis of user interaction and provenance data. We structure our survey around three primary questions: (1) WHY analyze provenance data, (2) WHAT provenance data to encode and how to encode it, and (3) HOW to analyze provenance data. A concluding discussion provides evidence-based guidelines and highlights concrete opportunities for future development in this emerging area. The survey and papers discussed can be explored online interactively at https://provenance-survey.caleydo.org.", "keywords": "", "link": "https://doi.org/10.1111/cgf.14035", "refList": ["10.1145/3186266", "10.1145/3185524", "10.1109/tvcg.2014.2346575", "10.1109/tvcg.2016.2598471", "10.1109/tvcg.2016.2598446", "10.1145/2856767.2856779", "10.1109/tvcg.2017.2745278", "10.1109/tvcg.2015.2467871", "10.1109/tvcg.2019.2934668", "10.1145/3301275.3302307", "10.1145/2207676.2208293", "10.1111/cgf.13402", "10.1111/cgf.12895", "10.1145/1084805.1084812", "10.1145/2983923", "10.1007/978-1-4419-5874-7\\_12", "10.1109/mcg.2010.18", "10.1109/tvcg.2015.2467153", "10.1109/tvcg.2013.211", "10.1145/3172944.3172964", "10.1145/3290605.3300360", "10.1109/tvcg.2009.199", "10.1109/vast.2016.7883515", "10.1145/2207676.2208412", "10.1145/1979742.1979570", "10.1145/2207676.2208565", "10.1109/tvcg.2017.2745078", "10.1109/tvcg.2013.226", "10.1145/3301275.3302270", "10.1145/2882903.2882919", "10.1109/tvcg.2013.132", "10.1007/978-1-4614-3223-4\\_6", "10.1007/978-1-4899-7993-3\\_80747-1", "10.1145/2449396.2449439", "10.4230/dagrep.8.11.35", "10.1111/cgf.13424", "10.1109/tvcg.2015.2467613", "10.1109/mcse.2007.106", "10.1109/vast.2014.7042486", "10.1145/3126594.3126653", "10.1145/2591510", "10.1109/vast.2017.8585665", "10.1109/tvcg.2017.2744684", "10.1109/vast.2009.5333564", "10.1111/cgf.12631", "10.1145/2702123.2702262", "10.1111/cgf.13717", "10.2312/evs.20191181", "10.1111/cgf.12925", "10.1145/2702123.2702590", "10.1109/tvcg.2015.2467551", "10.1145/3025171.3025187", "10.1145/3316416.3316418", "10.1109/tvcg.2015.2468078", "10.1109/mcg.2014.73", "10.1109/tvcg.2017.2744479", "10.1109/tvcg.2018.2859969", "10.1109/tvcg.2014.2346321", "10.1109/tvcg.2007.70589", "10.1007/s13218-012-0167-6", "10.1111/cgf.13670", "10.1145/2807442.2807478", "10.1111/cgf.13715", "10.1109/tvcg.2012.23", "10.1109/tvcg.2017.2745279", "10.1109/tvcg.2013.164", "10.1109/vast.2008.4677365", "10.1145/3301275.3302291", "10.1109/tvcg.2012.260", "10.1109/tvcg.2010.177", "10.1109/tvcg.2018.2865024", "10.1109/mcg.2015.51", "10.1145/2240236.2240260", "10.1109/tvcg.2016.2599030.2", "10.1109/tvcg.2007.70515", "10.1109/tvcg.2012.175", "10.1109/mcg.2019.2941856", "10.1109/tvcg.2008.137", "10.1016/j.visinf.2018.09.003", "10.4304/jmm.9.5.635-643", "10.1109/tvcg.2017.2744843", "10.1111/cgf.13405", "10.1145/2633043", "10.1109/tvcg.2009.129", "10.1109/tvcg.2019.2934609", "10.1111/cgf.12924", "10.1145/2702123.2702376", "10.1109/vast.2017.8585669", "10.1145/1502650.1502695", "10.1111/cgf.13730", "10.1109/tvcg.2013.124", "10.1109/tvcg.2017.2744805", "10.1109/mcg.2009.49", "10.1109/vast.2015.7347625", "10.1145/3009973", "10.1145/2470654.2470723", "10.1109/vast.2016.7883520", "10.1109/vast.2014.7042492", "10.1145/2984511.2984588", "10.1111/cgf.12391", "10.1561/1900000006", "10.1007/s00778-017-0486-1", "10.1109/vast.2009.5333020", "10.1145/1926385.1926423", "10.1145/1057977.1057978", "10.1145/3290605.3300892", "10.1111/j.1467-8659.2011.01928.x", "10.1109/tvcg.2013.188", "10.1109/tvcg.2015.2467191", "10.1109/iccicct.2014.6993023", "10.1145/3290605.3300874", "10.1145/2557500.2557524", "10.1109/mcg.2015.91", "10.1109/vast.2012.6400494", "10.1109/tvcg.2013.220", "10.1109/mcg.2019.2945378", "10.1109/vast.2012.6400486", "10.1109/tvcg.2018.2865158", "10.1109/tvcg.2016.2598839", "10.1145/1142473.1142574", "10.1177/1555343416672782", "10.1109/vast.2011.6102449", "10.1111/cgf.12090", "10.1109/vast.2016.7883518", "10.1111/cgf.13678", "10.1109/mcg.2009.53", "10.1109/tvcg.2014.2346250", "10.1109/tvcg.2016.2598797", "10.1111/cgf.13400", "10.1109/tvcg.2014.2346573", "10.1080/01431160600746456", "10.1145/2642918.2647378", "10.1109/mcg.2019.2945720", "10.1145/2207676.2207741", "10.1145/3025171.3025189", "10.1145/634067.634292", "10.1109/tvcg.2015.2467611", "10.1109/tit.1982.1056489", "10.1109/tvcg.2018.2865117", "10.1109/vast.2009.5333023", "10.1145/3332165.3347866", "10.1109/mcg.2019.2933419", "10.1145/3184900", "10.1109/tvcg.2012.273", "10.1109/vast.2010.5652885", "10.1109/vast.2015.7347627", "10.1145/3290605.3300803", "10.1109/tvcg.2012.258", "10.1109/mcg.2009.87", "10.1109/tvcg.2019.2934556", "10.1145/1869397.1869399", "10.1109/mcg.2015.50", "10.1145/3172944.3172979", "10.1111/cgf.13208", "10.1111/cgf.12619", "10.1145/3290605.3300358", "10.1109/vast.2008.4677352", "10.1109/tvcg.2016.2598468", "10.1109/vast.2016.7883519", "10.1109/mcse.2008.79"], "wos": 1, "children": [], "len": 1}], "len": 41}, "index": 833, "embedding": [5.154722690582275, 3.3443682193756104, -1.0222129821777344, -1.256189227104187, -0.630656361579895, 0.16650904715061188, -0.7150075435638428, 3.2540767192840576, -0.4060705304145813, 2.3386430740356445, 1.6737877130508423, 2.7533631324768066, -0.1321265697479248, 5.4624128341674805, 2.0891237258911133, 6.381150722503662, 2.771522283554077, 7.217710971832275, -0.6329802870750427, 6.35346794128418, -0.06630208343267441, 3.4685301780700684, 3.064568519592285, 4.551388263702393, -2.458800792694092, 2.988166570663452, -0.5019459128379822, 3.572835683822632, 3.91793155670166, 2.1112287044525146, 2.7799577713012695, 4.633090019226074], "projection": [0.5733490586280823, 10.374205589294434], "size": 21, "height": 3, "width": 10}